[Killed] BooleanLiteral
src/grammar/stack.ts:19:29
 export class GrammarStack {
   private stack: GrammarFrame[] = [];
   private diagnostics: Diagnostic[] = [];
-  private hasDuplicateKey = false;
+  private hasDuplicateKey = true;
   private maxDepth: number;
 
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='valid' when root is complete even if reason is not 'complete'
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/grammar/stack.ts:22:33
   private hasDuplicateKey = false;
   private maxDepth: number;
 
-  constructor(maxDepth: number) {
-    this.maxDepth = maxDepth;
-  }
+  constructor(maxDepth: number) {}
 
   /** Current depth (number of open containers). */
killedBy: Parser resource limits rejects depth exceeding maxDepth
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/grammar/stack.ts:27:23
   }
 
   /** Current depth (number of open containers). */
-  get depth(): number {
-    return this.stack.length;
-  }
+  get depth(): number {}
 
   /** Whether any duplicate key has been seen. */
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected undefined to deeply equal { path: '/src/app.ts' }

[Killed] BlockStatement
src/grammar/stack.ts:32:31
   }
 
   /** Whether any duplicate key has been seen. */
-  get hasDuplicate(): boolean {
-    return this.hasDuplicateKey;
-  }
+  get hasDuplicate(): boolean {}
 
   /** Get the current (top) frame, or undefined if empty. */
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected 'valid' to be 'invalid' // Object.is equality

[Killed] BlockStatement
src/grammar/stack.ts:37:43
   }
 
   /** Get the current (top) frame, or undefined if empty. */
-  get current(): GrammarFrame | undefined {
-    return this.stack[this.stack.length - 1];
-  }
+  get current(): GrammarFrame | undefined {}
 
   /**
killedBy: Parser push() returns incomplete for partial input
statusReason: expected 'root_complete' to be 'incomplete' // Object.is equality

[Killed] ArithmeticOperator
src/grammar/stack.ts:38:23
 
   /** Get the current (top) frame, or undefined if empty. */
   get current(): GrammarFrame | undefined {
-    return this.stack[this.stack.length - 1];
+    return this.stack[this.stack.length + 1];
   }
 
killedBy: Parser push() returns incomplete for partial input
statusReason: expected 'root_complete' to be 'incomplete' // Object.is equality

[Killed] BlockStatement
src/grammar/stack.ts:45:54
    * Push a new object container.
    * Returns the frame, or null if depth limit exceeded.
    */
-  pushObject(byteStart: number): GrammarFrame | null {
-    if (this.stack.length >= this.maxDepth) {
-      this.diagnostics.push(
-        createDiagnostic(
-          DiagnosticCode.E_LIMIT_DEPTH,
-          "fatal",
-          byteStart,
-          `Maximum nesting depth ${this.maxDepth} exceeded`,
-          false,
-        ),
-      );
-      return null;
-    }
-    const path = this.currentValuePath();
-    const frame = createObjectFrame(path, byteStart);
-    this.stack.push(frame);
-    return frame;
-  }
+  pushObject(byteStart: number): GrammarFrame | null {}
 
   /**
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/grammar/stack.ts:46:9
    * Returns the frame, or null if depth limit exceeded.
    */
   pushObject(byteStart: number): GrammarFrame | null {
-    if (this.stack.length >= this.maxDepth) {
+    if (this.stack.length < this.maxDepth) {
       this.diagnostics.push(
         createDiagnostic(
killedBy: Finish Honesty complete vs length: different executable for complete root
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/grammar/stack.ts:46:9
    * Returns the frame, or null if depth limit exceeded.
    */
   pushObject(byteStart: number): GrammarFrame | null {
-    if (this.stack.length >= this.maxDepth) {
+    if (true) {
       this.diagnostics.push(
         createDiagnostic(
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected [] to have a length of 1 but got +0

[NoCoverage] BooleanLiteral
src/grammar/stack.ts:53:11
           "fatal",
           byteStart,
           `Maximum nesting depth ${this.maxDepth} exceeded`,
-          false,
+          true,
         ),
       );

[Killed] BlockStatement
src/grammar/stack.ts:68:53
    * Push a new array container.
    * Returns the frame, or null if depth limit exceeded.
    */
-  pushArray(byteStart: number): GrammarFrame | null {
-    if (this.stack.length >= this.maxDepth) {
-      this.diagnostics.push(
-        createDiagnostic(
-          DiagnosticCode.E_LIMIT_DEPTH,
-          "fatal",
-          byteStart,
-          `Maximum nesting depth ${this.maxDepth} exceeded`,
-          false,
-        ),
-      );
-      return null;
-    }
-    const path = this.currentValuePath();
-    const frame = createArrayFrame(path, byteStart);
-    this.stack.push(frame);
-    return frame;
-  }
+  pushArray(byteStart: number): GrammarFrame | null {}
 
   /**
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/grammar/stack.ts:69:9
    * Returns the frame, or null if depth limit exceeded.
    */
   pushArray(byteStart: number): GrammarFrame | null {
-    if (this.stack.length >= this.maxDepth) {
+    if (this.stack.length < this.maxDepth) {
       this.diagnostics.push(
         createDiagnostic(
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
src/grammar/stack.ts:69:9
    * Returns the frame, or null if depth limit exceeded.
    */
   pushArray(byteStart: number): GrammarFrame | null {
-    if (this.stack.length >= this.maxDepth) {
+    if (this.stack.length > this.maxDepth) {
       this.diagnostics.push(
         createDiagnostic(
killedBy: Parser resource limits rejects depth exceeding maxDepth
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/grammar/stack.ts:73:11
       this.diagnostics.push(
         createDiagnostic(
           DiagnosticCode.E_LIMIT_DEPTH,
-          "fatal",
+          "",
           byteStart,
           `Maximum nesting depth ${this.maxDepth} exceeded`,

[Killed] BlockStatement
src/grammar/stack.ts:91:35
    * Pop the current container.
    * Returns the popped frame.
    */
-  pop(): GrammarFrame | undefined {
-    return this.stack.pop();
-  }
+  pop(): GrammarFrame | undefined {}
 
   /**
killedBy: Finish Honesty complete vs length: different executable for complete root
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/grammar/stack.ts:99:63
    * Register an object key. Returns true if the key is new.
    * If duplicate, emits diagnostic and returns false.
    */
-  registerObjectKey(key: string, byteOffset: number): boolean {
-    const frame = this.current;
-    if (!frame || frame.containerType !== "object" || !frame.seenKeys) {
-      return false;
-    }
-
-    if (frame.seenKeys.has(key)) {
-      this.hasDuplicateKey = true;
-      this.diagnostics.push(
-        createDiagnostic(
-          DiagnosticCode.E_DUPLICATE_KEY,
-          "error",
-          byteOffset,
-          `Duplicate object key: ${JSON.stringify(key)}`,
-          false,
-          frame.path,
-        ),
-      );
-      return false;
-    }
-
-    frame.seenKeys.add(key);
-    frame.currentKey = key;
-    return true;
-  }
+  registerObjectKey(key: string, byteOffset: number): boolean {}
 
   /**
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected {} to deeply equal { path: '/src/app.ts' }

[Killed] BooleanLiteral
src/grammar/stack.ts:101:55
    */
   registerObjectKey(key: string, byteOffset: number): boolean {
     const frame = this.current;
-    if (!frame || frame.containerType !== "object" || !frame.seenKeys) {
+    if (!frame || frame.containerType !== "object" || frame.seenKeys) {
       return false;
     }
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected {} to deeply equal { path: '/src/app.ts' }

[Killed] BooleanLiteral
src/grammar/stack.ts:101:9
    */
   registerObjectKey(key: string, byteOffset: number): boolean {
     const frame = this.current;
-    if (!frame || frame.containerType !== "object" || !frame.seenKeys) {
+    if (frame || frame.containerType !== "object" || !frame.seenKeys) {
       return false;
     }
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected {} to deeply equal { path: '/src/app.ts' }

[NoCoverage] BooleanLiteral
src/grammar/stack.ts:102:14
   registerObjectKey(key: string, byteOffset: number): boolean {
     const frame = this.current;
     if (!frame || frame.containerType !== "object" || !frame.seenKeys) {
-      return false;
+      return true;
     }
 

[Killed] ConditionalExpression
src/grammar/stack.ts:105:9
       return false;
     }
 
-    if (frame.seenKeys.has(key)) {
+    if (false) {
       this.hasDuplicateKey = true;
       this.diagnostics.push(
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected 'valid' to be 'invalid' // Object.is equality

[Killed] ConditionalExpression
src/grammar/stack.ts:105:9
       return false;
     }
 
-    if (frame.seenKeys.has(key)) {
+    if (true) {
       this.hasDuplicateKey = true;
       this.diagnostics.push(
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected {} to deeply equal { path: '/src/app.ts' }

[Killed] BooleanLiteral
src/grammar/stack.ts:106:30
     }
 
     if (frame.seenKeys.has(key)) {
-      this.hasDuplicateKey = true;
+      this.hasDuplicateKey = false;
       this.diagnostics.push(
         createDiagnostic(
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected 'valid' to be 'invalid' // Object.is equality

[Survived] BooleanLiteral
src/grammar/stack.ts:113:11
           "error",
           byteOffset,
           `Duplicate object key: ${JSON.stringify(key)}`,
-          false,
+          true,
           frame.path,
         ),

[Killed] BooleanLiteral
src/grammar/stack.ts:122:12
 
     frame.seenKeys.add(key);
     frame.currentKey = key;
-    return true;
+    return false;
   }
 
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected {} to deeply equal { path: '/src/app.ts' }

[Killed] BlockStatement
src/grammar/stack.ts:128:30
   /**
    * Get the JSON Pointer path for where the next value will go.
    */
-  currentValuePath(): string {
-    const frame = this.current;
-    if (!frame) return "";
-
-    if (frame.containerType === "object") {
-      if (frame.currentKey !== undefined) {
-        return appendPointer(frame.path, frame.currentKey);
-      }
-      return frame.path;
-    }
-    // array
-    return appendPointer(frame.path, frame.nextArrayIndex);
-  }
+  currentValuePath(): string {}
 
   /**
killedBy: Parser push() accepts a string chunk
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/grammar/stack.ts:130:9
    */
   currentValuePath(): string {
     const frame = this.current;
-    if (!frame) return "";
+    if (true) return "";
 
     if (frame.containerType === "object") {
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected '/src/app.ts' to deeply equal { path: '/src/app.ts' }

[Killed] BooleanLiteral
src/grammar/stack.ts:130:9
    */
   currentValuePath(): string {
     const frame = this.current;
-    if (!frame) return "";
+    if (frame) return "";
 
     if (frame.containerType === "object") {
killedBy: Parser push() accepts a string chunk
statusReason: Cannot read properties of undefined (reading 'containerType')

[Killed] BlockStatement
src/grammar/stack.ts:132:43
     const frame = this.current;
     if (!frame) return "";
 
-    if (frame.containerType === "object") {
-      if (frame.currentKey !== undefined) {
-        return appendPointer(frame.path, frame.currentKey);
-      }
-      return frame.path;
-    }
+    if (frame.containerType === "object") {}
     // array
     return appendPointer(frame.path, frame.nextArrayIndex);
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { Object (type, path, ...) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] EqualityOperator
src/grammar/stack.ts:132:9
     const frame = this.current;
     if (!frame) return "";
 
-    if (frame.containerType === "object") {
+    if (frame.containerType !== "object") {
       if (frame.currentKey !== undefined) {
         return appendPointer(frame.path, frame.currentKey);
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected { '0': '/src/app.ts' } to deeply equal { path: '/src/app.ts' }

[Killed] EqualityOperator
src/grammar/stack.ts:133:11
     if (!frame) return "";
 
     if (frame.containerType === "object") {
-      if (frame.currentKey !== undefined) {
+      if (frame.currentKey === undefined) {
         return appendPointer(frame.path, frame.currentKey);
       }
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected '/src/app.ts' to deeply equal { path: '/src/app.ts' }

[Killed] ConditionalExpression
src/grammar/stack.ts:133:11
     if (!frame) return "";
 
     if (frame.containerType === "object") {
-      if (frame.currentKey !== undefined) {
+      if (false) {
         return appendPointer(frame.path, frame.currentKey);
       }
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected '/src/app.ts' to deeply equal { path: '/src/app.ts' }

[Killed] BlockStatement
src/grammar/stack.ts:145:29
   /**
    * Advance the array index after an element value is committed.
    */
-  advanceArrayIndex(): void {
-    const frame = this.current;
-    if (frame && frame.containerType === "array") {
-      frame.nextArrayIndex++;
-    }
-  }
+  advanceArrayIndex(): void {}
 
   /**
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected [ 3 ] to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
src/grammar/stack.ts:147:18
    */
   advanceArrayIndex(): void {
     const frame = this.current;
-    if (frame && frame.containerType === "array") {
+    if (frame && frame.containerType !== "array") {
       frame.nextArrayIndex++;
     }
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected [ 3 ] to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
src/grammar/stack.ts:147:9
    */
   advanceArrayIndex(): void {
     const frame = this.current;
-    if (frame && frame.containerType === "array") {
+    if (false) {
       frame.nextArrayIndex++;
     }
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected [ 3 ] to deeply equal [ 1, 2, 3 ]

[Killed] UpdateOperator
src/grammar/stack.ts:148:7
   advanceArrayIndex(): void {
     const frame = this.current;
     if (frame && frame.containerType === "array") {
-      frame.nextArrayIndex++;
+      frame.nextArrayIndex--;
     }
   }
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected [ 1 ] to deeply equal [ 1, 2, 3 ]

[Killed] BlockStatement
src/grammar/stack.ts:155:35
   /**
    * Take accumulated diagnostics and clear.
    */
-  takeDiagnostics(): Diagnostic[] {
-    const result = this.diagnostics;
-    this.diagnostics = [];
-    return result;
-  }
+  takeDiagnostics(): Diagnostic[] {}
 
   /**
killedBy: Parser push() accepts a string chunk
statusReason: grammarDiags is not iterable

[Killed] BlockStatement
src/grammar/stack.ts:164:22
   /**
    * Check if the stack is empty (no open containers).
    */
-  isEmpty(): boolean {
-    return this.stack.length === 0;
-  }
+  isEmpty(): boolean {}
 
   /**
killedBy: Parser push() accepts a string chunk
statusReason: expected 'incomplete' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/grammar/stack.ts:165:12
    * Check if the stack is empty (no open containers).
    */
   isEmpty(): boolean {
-    return this.stack.length === 0;
+    return true;
   }
 
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected undefined to deeply equal { path: '/src/app.ts' }

[Killed] ConditionalExpression
src/grammar/stack.ts:165:12
    * Check if the stack is empty (no open containers).
    */
   isEmpty(): boolean {
-    return this.stack.length === 0;
+    return false;
   }
 
killedBy: Parser push() accepts a string chunk
statusReason: expected 'incomplete' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/grammar/stack.ts:171:40
   /**
    * Get all frames (for snapshot/pending info).
    */
-  getFrames(): readonly GrammarFrame[] {
-    return this.stack;
-  }
+  getFrames(): readonly GrammarFrame[] {}
 
   /**
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/grammar/stack.ts:179:32
    * Determine if all open containers can be safely closed by just appending '}' or ']'.
    * This is true if no container is waiting for a colon or a value.
    */
-  canSafelyCloseAll(): boolean {
-    for (const frame of this.stack) {
-      if (frame.containerType === "object") {
-        if (
-          frame.objectExpectation === "colon" ||
-          frame.objectExpectation === "value" ||
-          frame.objectExpectation === "key_after_comma"
-        ) {
-          return false; // Missing colon or value or key
-        }
-      } else {
-        if (frame.arrayExpectation === "value_after_comma") {
-          return false; // Missing value after comma
-        }
-      }
-    }
-    return true;
-  }
+  canSafelyCloseAll(): boolean {}
 }
 
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Survived] BlockStatement
src/grammar/stack.ts:180:37
    * This is true if no container is waiting for a colon or a value.
    */
   canSafelyCloseAll(): boolean {
-    for (const frame of this.stack) {
-      if (frame.containerType === "object") {
-        if (
-          frame.objectExpectation === "colon" ||
-          frame.objectExpectation === "value" ||
-          frame.objectExpectation === "key_after_comma"
-        ) {
-          return false; // Missing colon or value or key
-        }
-      } else {
-        if (frame.arrayExpectation === "value_after_comma") {
-          return false; // Missing value after comma
-        }
-      }
-    }
+    for (const frame of this.stack) {}
     return true;
   }

[Survived] ConditionalExpression
src/grammar/stack.ts:181:11
    */
   canSafelyCloseAll(): boolean {
     for (const frame of this.stack) {
-      if (frame.containerType === "object") {
+      if (true) {
         if (
           frame.objectExpectation === "colon" ||

[Survived] BlockStatement
src/grammar/stack.ts:181:45
    */
   canSafelyCloseAll(): boolean {
     for (const frame of this.stack) {
-      if (frame.containerType === "object") {
-        if (
-          frame.objectExpectation === "colon" ||
-          frame.objectExpectation === "value" ||
-          frame.objectExpectation === "key_after_comma"
-        ) {
-          return false; // Missing colon or value or key
-        }
-      } else {
+      if (frame.containerType === "object") {} else {
         if (frame.arrayExpectation === "value_after_comma") {
           return false; // Missing value after comma

[Killed] ConditionalExpression
src/grammar/stack.ts:183:11
     for (const frame of this.stack) {
       if (frame.containerType === "object") {
         if (
-          frame.objectExpectation === "colon" ||
-          frame.objectExpectation === "value" ||
-          frame.objectExpectation === "key_after_comma"
+          true
         ) {
           return false; // Missing colon or value or key
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/grammar/stack.ts:183:11
     for (const frame of this.stack) {
       if (frame.containerType === "object") {
         if (
-          frame.objectExpectation === "colon" ||
+          frame.objectExpectation !== "colon" ||
           frame.objectExpectation === "value" ||
           frame.objectExpectation === "key_after_comma"
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Killed] EqualityOperator
src/grammar/stack.ts:184:11
       if (frame.containerType === "object") {
         if (
           frame.objectExpectation === "colon" ||
-          frame.objectExpectation === "value" ||
+          frame.objectExpectation !== "value" ||
           frame.objectExpectation === "key_after_comma"
         ) {
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Survived] ConditionalExpression
src/grammar/stack.ts:184:11
       if (frame.containerType === "object") {
         if (
           frame.objectExpectation === "colon" ||
-          frame.objectExpectation === "value" ||
+          false ||
           frame.objectExpectation === "key_after_comma"
         ) {

[Killed] EqualityOperator
src/grammar/stack.ts:185:11
         if (
           frame.objectExpectation === "colon" ||
           frame.objectExpectation === "value" ||
-          frame.objectExpectation === "key_after_comma"
+          frame.objectExpectation !== "key_after_comma"
         ) {
           return false; // Missing colon or value or key
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Survived] ConditionalExpression
src/grammar/stack.ts:185:11
         if (
           frame.objectExpectation === "colon" ||
           frame.objectExpectation === "value" ||
-          frame.objectExpectation === "key_after_comma"
+          false
         ) {
           return false; // Missing colon or value or key

[NoCoverage] BlockStatement
src/grammar/stack.ts:186:11
           frame.objectExpectation === "colon" ||
           frame.objectExpectation === "value" ||
           frame.objectExpectation === "key_after_comma"
-        ) {
-          return false; // Missing colon or value or key
-        }
+        ) {}
       } else {
         if (frame.arrayExpectation === "value_after_comma") {

[NoCoverage] BooleanLiteral
src/grammar/stack.ts:187:18
           frame.objectExpectation === "value" ||
           frame.objectExpectation === "key_after_comma"
         ) {
-          return false; // Missing colon or value or key
+          return true; // Missing colon or value or key
         }
       } else {

[NoCoverage] BlockStatement
src/grammar/stack.ts:189:14
         ) {
           return false; // Missing colon or value or key
         }
-      } else {
-        if (frame.arrayExpectation === "value_after_comma") {
-          return false; // Missing value after comma
-        }
-      }
+      } else {}
     }
     return true;

[NoCoverage] ConditionalExpression
src/grammar/stack.ts:190:13
           return false; // Missing colon or value or key
         }
       } else {
-        if (frame.arrayExpectation === "value_after_comma") {
+        if (false) {
           return false; // Missing value after comma
         }

[NoCoverage] BlockStatement
src/grammar/stack.ts:190:61
           return false; // Missing colon or value or key
         }
       } else {
-        if (frame.arrayExpectation === "value_after_comma") {
-          return false; // Missing value after comma
-        }
+        if (frame.arrayExpectation === "value_after_comma") {}
       }
     }

[NoCoverage] BooleanLiteral
src/grammar/stack.ts:191:18
         }
       } else {
         if (frame.arrayExpectation === "value_after_comma") {
-          return false; // Missing value after comma
+          return true; // Missing value after comma
         }
       }
