[Killed] BlockStatement
src/lexer/scanner.ts:21:44
 import { createDiagnostic } from "../diagnostics/factory.js";
 
 /** Whitespace characters in JSON. */
-function isWhitespace(ch: string): boolean {
-  return ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
-}
+function isWhitespace(ch: string): boolean {}
 
 function isDigit(ch: string): boolean {
killedBy: Scanner whitespace handling skips whitespace between tokens
statusReason: expected 0 to be greater than or equal to 4

[Killed] EqualityOperator
src/lexer/scanner.ts:22:54
 
 /** Whitespace characters in JSON. */
 function isWhitespace(ch: string): boolean {
-  return ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
+  return ch === " " || ch === "\t" || ch === "\n" || ch !== "\r";
 }
 
killedBy: Scanner structural tokens scans empty object
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/lexer/scanner.ts:22:10
 
 /** Whitespace characters in JSON. */
 function isWhitespace(ch: string): boolean {
-  return ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
+  return (ch === " " || ch === "\t") && ch === "\n" || ch === "\r";
 }
 
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'invalid' to be 'salvaged' // Object.is equality

[Killed] BlockStatement
src/lexer/scanner.ts:25:39
   return ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
 }
 
-function isDigit(ch: string): boolean {
-  return ch >= "0" && ch <= "9";
-}
+function isDigit(ch: string): boolean {}
 
 function isHexDigit(ch: string): boolean {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending number at chunk end with byteOffset of number start
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/lexer/scanner.ts:26:10
 }
 
 function isDigit(ch: string): boolean {
-  return ch >= "0" && ch <= "9";
+  return true;
 }
 
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending true literal
statusReason: expected { type: 'number', path: '/flag', …(2) } to deeply equal { Object (type, path, ...) }

[Killed] ConditionalExpression
src/lexer/scanner.ts:26:10
 }
 
 function isDigit(ch: string): boolean {
-  return ch >= "0" && ch <= "9";
+  return true && ch <= "9";
 }
 
killedBy: Mutation Killer — Byte Range Accuracy accurately reports byteRange for ObjectStart, ObjectEnd, Comma, Colon and Numbers
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/lexer/scanner.ts:29:42
   return ch >= "0" && ch <= "9";
 }
 
-function isHexDigit(ch: string): boolean {
-  return (
-    (ch >= "0" && ch <= "9") ||
-    (ch >= "a" && ch <= "f") ||
-    (ch >= "A" && ch <= "F")
-  );
-}
+function isHexDigit(ch: string): boolean {}
 
 /**
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[Killed] LogicalOperator
src/lexer/scanner.ts:31:5
 
 function isHexDigit(ch: string): boolean {
   return (
-    (ch >= "0" && ch <= "9") ||
-    (ch >= "a" && ch <= "f") ||
+    ch >= "0" && ch <= "9" && ch >= "a" && ch <= "f" ||
     (ch >= "A" && ch <= "F")
   );
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:31:6
 
 function isHexDigit(ch: string): boolean {
   return (
-    (ch >= "0" && ch <= "9") ||
+    (false) ||
     (ch >= "a" && ch <= "f") ||
     (ch >= "A" && ch <= "F")
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:32:6
 function isHexDigit(ch: string): boolean {
   return (
     (ch >= "0" && ch <= "9") ||
-    (ch >= "a" && ch <= "f") ||
+    (ch > "a" && ch <= "f") ||
     (ch >= "A" && ch <= "F")
   );

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:32:6
 function isHexDigit(ch: string): boolean {
   return (
     (ch >= "0" && ch <= "9") ||
-    (ch >= "a" && ch <= "f") ||
+    (ch < "a" && ch <= "f") ||
     (ch >= "A" && ch <= "F")
   );

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:33:19
   return (
     (ch >= "0" && ch <= "9") ||
     (ch >= "a" && ch <= "f") ||
-    (ch >= "A" && ch <= "F")
+    (ch >= "A" && true)
   );
 }

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:33:6
   return (
     (ch >= "0" && ch <= "9") ||
     (ch >= "a" && ch <= "f") ||
-    (ch >= "A" && ch <= "F")
+    (true && ch <= "F")
   );
 }

[Killed] BlockStatement
src/lexer/scanner.ts:45:40
 export class Scanner {
   private options: ParserOptions;
 
-  constructor(options?: ParserOptions) {
-    this.options = options ?? {};
-  }
+  constructor(options?: ParserOptions) {}
 
   private state: ScannerState = ScannerState.Structural;
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: Cannot read properties of undefined (reading 'repairs')

[Killed] LogicalOperator
src/lexer/scanner.ts:46:20
   private options: ParserOptions;
 
   constructor(options?: ParserOptions) {
-    this.options = options ?? {};
+    this.options = options && {};
   }
 
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: Cannot read properties of undefined (reading 'repairs')

[Timeout] ArrayDeclaration
src/lexer/scanner.ts:50:29
   }
 
   private state: ScannerState = ScannerState.Structural;
-  private tokens: Token[] = [];
+  private tokens: Token[] = ["Stryker was here"];
   private diagnostics: Diagnostic[] = [];
   private repairs: RepairAction[] = [];

[Timeout] ArrayDeclaration
src/lexer/scanner.ts:51:39
 
   private state: ScannerState = ScannerState.Structural;
   private tokens: Token[] = [];
-  private diagnostics: Diagnostic[] = [];
+  private diagnostics: Diagnostic[] = ["Stryker was here"];
   private repairs: RepairAction[] = [];
 

[Timeout] StringLiteral
src/lexer/scanner.ts:55:26
   private repairs: RepairAction[] = [];
 
   // --- String state ---
-  private stringBuffer = "";
+  private stringBuffer = "Stryker was here!";
   private stringIsKey = false;
   private stringByteStart = 0;

[Timeout] BooleanLiteral
src/lexer/scanner.ts:56:25
 
   // --- String state ---
   private stringBuffer = "";
-  private stringIsKey = false;
+  private stringIsKey = true;
   private stringByteStart = 0;
 

[Timeout] StringLiteral
src/lexer/scanner.ts:60:30
   private stringByteStart = 0;
 
   // --- Unicode escape state ---
-  private unicodeHexBuffer = "";
+  private unicodeHexBuffer = "Stryker was here!";
   private highSurrogate = 0;
   /** Tracks position in surrogate pair sequence: 0=initial, 1=saw backslash, 2=saw 'u' */

[Timeout] BooleanLiteral
src/lexer/scanner.ts:68:28
   // --- Number state ---
   private numberBuffer = "";
   private numberByteStart = 0;
-  private numberHasDigit = false;
+  private numberHasDigit = true;
 
   // --- Literal state ---

[Survived] StringLiteral
src/lexer/scanner.ts:71:27
   private numberHasDigit = false;
 
   // --- Literal state ---
-  private literalTarget = "";
+  private literalTarget = "Stryker was here!";
   private literalIndex = 0;
   private literalByteStart = 0;

[Killed] BooleanLiteral
src/lexer/scanner.ts:81:29
 
   // --- Depth tracking for string context ---
   /** Whether we're in a key position for string parsing. */
-  private nextStringIsKey = false;
+  private nextStringIsKey = true;
 
   get currentState(): ScannerState {
killedBy: Scanner pending state reports pending string
statusReason: expected 'object_key' to be 'string' // Object.is equality

[Killed] BlockStatement
src/lexer/scanner.ts:83:36
   /** Whether we're in a key position for string parsing. */
   private nextStringIsKey = false;
 
-  get currentState(): ScannerState {
-    return this.state;
-  }
+  get currentState(): ScannerState {}
 
   /**
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] ConditionalExpression
src/lexer/scanner.ts:97:7
     this.currentByteOffset = byteOffset;
 
     switch (this.state) {
-      case ScannerState.Structural:
-        this.processStructural(ch, byteOffset, charByteLength);
-        break;
+      case ScannerState.Structural:
       case ScannerState.ObjectKey:
         this.processObjectKey(ch, byteOffset);
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:100:7
       case ScannerState.Structural:
         this.processStructural(ch, byteOffset, charByteLength);
         break;
-      case ScannerState.ObjectKey:
-        this.processObjectKey(ch, byteOffset);
-        break;
+      case ScannerState.ObjectKey:
       case ScannerState.InString:
         this.processString(ch, byteOffset, charByteLength);

[Killed] ConditionalExpression
src/lexer/scanner.ts:103:7
       case ScannerState.ObjectKey:
         this.processObjectKey(ch, byteOffset);
         break;
-      case ScannerState.InString:
-        this.processString(ch, byteOffset, charByteLength);
-        break;
+      case ScannerState.InString:
       case ScannerState.Escape:
         this.processEscape(ch, byteOffset, charByteLength);
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/lexer/scanner.ts:106:7
       case ScannerState.InString:
         this.processString(ch, byteOffset, charByteLength);
         break;
-      case ScannerState.Escape:
-        this.processEscape(ch, byteOffset, charByteLength);
-        break;
+      case ScannerState.Escape:
       case ScannerState.UnicodeEscape:
         this.processUnicodeEscape(ch, byteOffset, charByteLength);
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"msg":"hello\nworld"}
statusReason: expected {} to deeply equal { msg: 'hello\nworld' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:109:7
       case ScannerState.Escape:
         this.processEscape(ch, byteOffset, charByteLength);
         break;
-      case ScannerState.UnicodeEscape:
-        this.processUnicodeEscape(ch, byteOffset, charByteLength);
-        break;
+      case ScannerState.UnicodeEscape:
       case ScannerState.UnicodeSurrogatePending:
         this.processSurrogatePending(ch, byteOffset, charByteLength);
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:112:7
       case ScannerState.UnicodeEscape:
         this.processUnicodeEscape(ch, byteOffset, charByteLength);
         break;
-      case ScannerState.UnicodeSurrogatePending:
-        this.processSurrogatePending(ch, byteOffset, charByteLength);
-        break;
+      case ScannerState.UnicodeSurrogatePending:
       case ScannerState.NumberInteger:
       case ScannerState.NumberFraction:

[Killed] ConditionalExpression
src/lexer/scanner.ts:118:7
       case ScannerState.NumberInteger:
       case ScannerState.NumberFraction:
       case ScannerState.NumberExponentStart:
-      case ScannerState.NumberExponent:
-        this.processNumber(ch, byteOffset, charByteLength);
-        break;
+      case ScannerState.NumberExponent:
       case ScannerState.LiteralTrue:
       case ScannerState.LiteralFalse:
killedBy: Parser snapshot() includes committed number terminated by comma
statusReason: expected { a: null } to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/lexer/scanner.ts:123:7
         break;
       case ScannerState.LiteralTrue:
       case ScannerState.LiteralFalse:
-      case ScannerState.LiteralNull:
-        this.processLiteral(ch, byteOffset, charByteLength);
-        break;
+      case ScannerState.LiteralNull:
       case ScannerState.TrailingWhitespace:
         this.processTrailingWhitespace(ch, byteOffset);
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected { nested: {} } to deeply equal { nested: { x: true, y: false } }

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:126:7
       case ScannerState.LiteralNull:
         this.processLiteral(ch, byteOffset, charByteLength);
         break;
-      case ScannerState.TrailingWhitespace:
-        this.processTrailingWhitespace(ch, byteOffset);
-        break;
+      case ScannerState.TrailingWhitespace:
       case ScannerState.TrailingData:
         // Consume all trailing data silently — diagnostic was already emitted

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:129:7
       case ScannerState.TrailingWhitespace:
         this.processTrailingWhitespace(ch, byteOffset);
         break;
-      case ScannerState.TrailingData:
-        // Consume all trailing data silently — diagnostic was already emitted
-        break;
+      case ScannerState.TrailingData:
       case ScannerState.Invalid:
       case ScannerState.Finished:

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:133:7
         // Consume all trailing data silently — diagnostic was already emitted
         break;
       case ScannerState.Invalid:
-      case ScannerState.Finished:
-        // No-op — terminal states
-        break;
+      case ScannerState.Finished:
     }
   }

[Killed] BlockStatement
src/lexer/scanner.ts:143:25
    * Take all tokens accumulated since the last call.
    * Clears the internal token buffer.
    */
-  takeTokens(): Token[] {
-    const result = this.tokens;
-    this.tokens = [];
-    return result;
-  }
+  takeTokens(): Token[] {}
 
   /**
killedBy: Parser push() accepts a string chunk
statusReason: tokens is not iterable

[Killed] ArrayDeclaration
src/lexer/scanner.ts:145:19
    */
   takeTokens(): Token[] {
     const result = this.tokens;
-    this.tokens = [];
+    this.tokens = ["Stryker was here"];
     return result;
   }
killedBy: Scanner incremental feeding handles string split across feeds
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/lexer/scanner.ts:159:33
     return result;
   }
 
-  takeRepairs(): RepairAction[] {
-    const result = this.repairs;
-    this.repairs = [];
-    return result;
-  }
+  takeRepairs(): RepairAction[] {}
 
   /**
killedBy: Parser push() accepts a string chunk
statusReason: scanRepairs is not iterable

[Killed] BlockStatement
src/lexer/scanner.ts:168:44
   /**
    * Set whether the next string to be scanned should be treated as an object key.
    */
-  setNextStringIsKey(isKey: boolean): void {
-    this.nextStringIsKey = isKey;
-  }
+  setNextStringIsKey(isKey: boolean): void {}
 
   /**
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] ConditionalExpression
src/lexer/scanner.ts:183:7
   } {
     switch (this.state) {
       case ScannerState.InString:
-      case ScannerState.Escape:
-        return {
-          type: this.stringIsKey ? "object_key" as "string" : "string",
-          buffer: this.stringBuffer,
-          byteStart: this.stringByteStart,
-          isKey: this.stringIsKey,
-        };
+      case ScannerState.Escape:
       case ScannerState.UnicodeEscape:
         return {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'unicode_escape', …(3) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] StringLiteral
src/lexer/scanner.ts:185:63
       case ScannerState.InString:
       case ScannerState.Escape:
         return {
-          type: this.stringIsKey ? "object_key" as "string" : "string",
+          type: this.stringIsKey ? "object_key" as "string" : "",
           buffer: this.stringBuffer,
           byteStart: this.stringByteStart,
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string value with byteOffset of opening quote
statusReason: expected { type: '', path: '/key', …(2) } to deeply equal { type: 'string', path: '/key', …(2) }

[Killed] ConditionalExpression
src/lexer/scanner.ts:190:7
           byteStart: this.stringByteStart,
           isKey: this.stringIsKey,
         };
-      case ScannerState.UnicodeEscape:
-        return {
-          type: "unicode_escape",
-          buffer: this.unicodeHexBuffer,
-          byteStart: this.stringByteStart,
-          isKey: this.stringIsKey,
-        };
+      case ScannerState.UnicodeEscape:
       case ScannerState.UnicodeSurrogatePending:
         return {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unicode escape sequence with string byteOffset
statusReason: expected { type: 'surrogate', …(3) } to deeply equal { type: 'unicode_escape', …(3) }

[Killed] StringLiteral
src/lexer/scanner.ts:192:17
         };
       case ScannerState.UnicodeEscape:
         return {
-          type: "unicode_escape",
+          type: "",
           buffer: this.unicodeHexBuffer,
           byteStart: this.stringByteStart,
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unicode escape sequence with string byteOffset
statusReason: expected { type: '', path: '/key', …(2) } to deeply equal { type: 'unicode_escape', …(3) }

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:197:7
           byteStart: this.stringByteStart,
           isKey: this.stringIsKey,
         };
-      case ScannerState.UnicodeSurrogatePending:
-        return {
-          type: "surrogate",
-          buffer: this.stringBuffer,
-          byteStart: this.stringByteStart,
-          isKey: this.stringIsKey,
-        };
+      case ScannerState.UnicodeSurrogatePending:
       case ScannerState.NumberInteger:
       case ScannerState.NumberFraction:

[NoCoverage] ObjectLiteral
src/lexer/scanner.ts:198:16
           isKey: this.stringIsKey,
         };
       case ScannerState.UnicodeSurrogatePending:
-        return {
-          type: "surrogate",
-          buffer: this.stringBuffer,
-          byteStart: this.stringByteStart,
-          isKey: this.stringIsKey,
-        };
+        return {};
       case ScannerState.NumberInteger:
       case ScannerState.NumberFraction:

[NoCoverage] StringLiteral
src/lexer/scanner.ts:199:17
         };
       case ScannerState.UnicodeSurrogatePending:
         return {
-          type: "surrogate",
+          type: "",
           buffer: this.stringBuffer,
           byteStart: this.stringByteStart,

[Killed] ConditionalExpression
src/lexer/scanner.ts:207:7
       case ScannerState.NumberInteger:
       case ScannerState.NumberFraction:
       case ScannerState.NumberExponentStart:
-      case ScannerState.NumberExponent:
-        return {
-          type: "number",
-          buffer: this.numberBuffer,
-          byteStart: this.numberByteStart,
-          isKey: false,
-        };
+      case ScannerState.NumberExponent:
       case ScannerState.LiteralTrue:
       case ScannerState.LiteralFalse:
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending number at chunk end with byteOffset of number start
statusReason: expected { type: 'literal', path: '/num', …(2) } to deeply equal { type: 'number', path: '/num', …(2) }

[Survived] BooleanLiteral
src/lexer/scanner.ts:212:18
           type: "number",
           buffer: this.numberBuffer,
           byteStart: this.numberByteStart,
-          isKey: false,
+          isKey: true,
         };
       case ScannerState.LiteralTrue:

[Killed] ConditionalExpression
src/lexer/scanner.ts:216:7
         };
       case ScannerState.LiteralTrue:
       case ScannerState.LiteralFalse:
-      case ScannerState.LiteralNull:
-        return {
-          type: "literal",
-          buffer: this.literalTarget.slice(0, this.literalIndex),
-          byteStart: this.literalByteStart,
-          isKey: false,
-        };
+      case ScannerState.LiteralNull:
       default:
         return { type: "none", buffer: "", byteStart: 0, isKey: false };
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending true literal
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/lexer/scanner.ts:219:19
       case ScannerState.LiteralNull:
         return {
           type: "literal",
-          buffer: this.literalTarget.slice(0, this.literalIndex),
+          buffer: this.literalTarget,
           byteStart: this.literalByteStart,
           isKey: false,
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending true literal
statusReason: expected { Object (type, path, ...) } to deeply equal { Object (type, path, ...) }

[Survived] BooleanLiteral
src/lexer/scanner.ts:221:18
           type: "literal",
           buffer: this.literalTarget.slice(0, this.literalIndex),
           byteStart: this.literalByteStart,
-          isKey: false,
+          isKey: true,
         };
       default:

[Killed] ConditionalExpression
src/lexer/scanner.ts:223:7
           byteStart: this.literalByteStart,
           isKey: false,
         };
-      default:
-        return { type: "none", buffer: "", byteStart: 0, isKey: false };
+      default:
     }
   }
killedBy: DefaultToolCallStreamCoordinator — uncovered branches handles name_delta after call ended
statusReason: Cannot read properties of undefined (reading 'type')

[Survived] BooleanLiteral
src/lexer/scanner.ts:224:65
           isKey: false,
         };
       default:
-        return { type: "none", buffer: "", byteStart: 0, isKey: false };
+        return { type: "none", buffer: "", byteStart: 0, isKey: true };
     }
   }

[Killed] BlockStatement
src/lexer/scanner.ts:232:29
    * Attempt to finalize a pending number (at end of input or finish).
    * Returns true if a number token was emitted.
    */
-  finalizeNumber(): boolean {
-    if (
-      this.state === ScannerState.NumberInteger ||
-      this.state === ScannerState.NumberFraction ||
-      this.state === ScannerState.NumberExponent
-    ) {
-      if (this.numberHasDigit) {
-        this.emitToken(
-          TokenType.Number,
-          this.numberBuffer,
-          this.numberByteStart,
-          this.currentByteOffset + 1,
-        );
-        this.state = ScannerState.TrailingWhitespace;
-        return true;
-      }
-    }
-    return false;
-  }
+  finalizeNumber(): boolean {}
 
   /**
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/lexer/scanner.ts:234:7
    */
   finalizeNumber(): boolean {
     if (
-      this.state === ScannerState.NumberInteger ||
+      this.state !== ScannerState.NumberInteger ||
       this.state === ScannerState.NumberFraction ||
       this.state === ScannerState.NumberExponent
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Killed] LogicalOperator
src/lexer/scanner.ts:234:7
    */
   finalizeNumber(): boolean {
     if (
-      this.state === ScannerState.NumberInteger ||
-      this.state === ScannerState.NumberFraction ||
-      this.state === ScannerState.NumberExponent
+      (this.state === ScannerState.NumberInteger || this.state === ScannerState.NumberFraction) && this.state === ScannerState.NumberExponent
     ) {
       if (this.numberHasDigit) {
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Killed] ConditionalExpression
src/lexer/scanner.ts:235:7
   finalizeNumber(): boolean {
     if (
       this.state === ScannerState.NumberInteger ||
-      this.state === ScannerState.NumberFraction ||
+      false ||
       this.state === ScannerState.NumberExponent
     ) {
killedBy: Valid JSON Equivalence matches JSON.parse: -3.14
statusReason: expected undefined to deeply equal -3.14

[Killed] EqualityOperator
src/lexer/scanner.ts:235:7
   finalizeNumber(): boolean {
     if (
       this.state === ScannerState.NumberInteger ||
-      this.state === ScannerState.NumberFraction ||
+      this.state !== ScannerState.NumberFraction ||
       this.state === ScannerState.NumberExponent
     ) {
killedBy: Valid JSON Equivalence matches JSON.parse: -3.14
statusReason: expected undefined to deeply equal -3.14

[Killed] EqualityOperator
src/lexer/scanner.ts:236:7
     if (
       this.state === ScannerState.NumberInteger ||
       this.state === ScannerState.NumberFraction ||
-      this.state === ScannerState.NumberExponent
+      this.state !== ScannerState.NumberExponent
     ) {
       if (this.numberHasDigit) {
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected undefined to deeply equal 10000000000

[Killed] ConditionalExpression
src/lexer/scanner.ts:236:7
     if (
       this.state === ScannerState.NumberInteger ||
       this.state === ScannerState.NumberFraction ||
-      this.state === ScannerState.NumberExponent
+      false
     ) {
       if (this.numberHasDigit) {
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected undefined to deeply equal 10000000000

[Killed] BlockStatement
src/lexer/scanner.ts:237:7
       this.state === ScannerState.NumberInteger ||
       this.state === ScannerState.NumberFraction ||
       this.state === ScannerState.NumberExponent
-    ) {
-      if (this.numberHasDigit) {
-        this.emitToken(
-          TokenType.Number,
-          this.numberBuffer,
-          this.numberByteStart,
-          this.currentByteOffset + 1,
-        );
-        this.state = ScannerState.TrailingWhitespace;
-        return true;
-      }
-    }
+    ) {}
     return false;
   }
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Killed] BlockStatement
src/lexer/scanner.ts:238:32
       this.state === ScannerState.NumberFraction ||
       this.state === ScannerState.NumberExponent
     ) {
-      if (this.numberHasDigit) {
-        this.emitToken(
-          TokenType.Number,
-          this.numberBuffer,
-          this.numberByteStart,
-          this.currentByteOffset + 1,
-        );
-        this.state = ScannerState.TrailingWhitespace;
-        return true;
-      }
+      if (this.numberHasDigit) {}
     }
     return false;
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Killed] ConditionalExpression
src/lexer/scanner.ts:238:11
       this.state === ScannerState.NumberFraction ||
       this.state === ScannerState.NumberExponent
     ) {
-      if (this.numberHasDigit) {
+      if (false) {
         this.emitToken(
           TokenType.Number,
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Survived] ArithmeticOperator
src/lexer/scanner.ts:243:11
           TokenType.Number,
           this.numberBuffer,
           this.numberByteStart,
-          this.currentByteOffset + 1,
+          this.currentByteOffset - 1,
         );
         this.state = ScannerState.TrailingWhitespace;

[Killed] BooleanLiteral
src/lexer/scanner.ts:246:16
           this.currentByteOffset + 1,
         );
         this.state = ScannerState.TrailingWhitespace;
-        return true;
+        return false;
       }
     }
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/lexer/scanner.ts:256:30
    * Attempt to finalize a pending literal (at end of input or finish).
    * Returns true if a literal token was emitted.
    */
-  finalizeLiteral(): boolean {
-    if (
-      this.state === ScannerState.LiteralTrue ||
-      this.state === ScannerState.LiteralFalse ||
-      this.state === ScannerState.LiteralNull
-    ) {
-      if (this.literalIndex === this.literalTarget.length) {
-        const type =
-          this.literalTarget === "true"
-            ? TokenType.True
-            : this.literalTarget === "false"
-              ? TokenType.False
-              : TokenType.Null;
-        this.emitToken(
-          type,
-          this.literalTarget,
-          this.literalByteStart,
-          this.currentByteOffset + 1,
-        );
-        this.state = ScannerState.TrailingWhitespace;
-        return true;
-      }
-    }
-    return false;
-  }
+  finalizeLiteral(): boolean {}
 
   // -----------------------------------------------------------------------
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true

[Killed] LogicalOperator
src/lexer/scanner.ts:258:7
    */
   finalizeLiteral(): boolean {
     if (
-      this.state === ScannerState.LiteralTrue ||
-      this.state === ScannerState.LiteralFalse ||
-      this.state === ScannerState.LiteralNull
+      (this.state === ScannerState.LiteralTrue || this.state === ScannerState.LiteralFalse) && this.state === ScannerState.LiteralNull
     ) {
       if (this.literalIndex === this.literalTarget.length) {
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true

[Killed] LogicalOperator
src/lexer/scanner.ts:258:7
    */
   finalizeLiteral(): boolean {
     if (
-      this.state === ScannerState.LiteralTrue ||
-      this.state === ScannerState.LiteralFalse ||
+      this.state === ScannerState.LiteralTrue && this.state === ScannerState.LiteralFalse ||
       this.state === ScannerState.LiteralNull
     ) {
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true
