[Killed] ConditionalExpression
src/lexer/scanner.ts:259:7
   finalizeLiteral(): boolean {
     if (
       this.state === ScannerState.LiteralTrue ||
-      this.state === ScannerState.LiteralFalse ||
+      false ||
       this.state === ScannerState.LiteralNull
     ) {
killedBy: Parser valid JSON equivalence matches JSON.parse for: false
statusReason: expected undefined to deeply equal false

[Killed] EqualityOperator
src/lexer/scanner.ts:259:7
   finalizeLiteral(): boolean {
     if (
       this.state === ScannerState.LiteralTrue ||
-      this.state === ScannerState.LiteralFalse ||
+      this.state !== ScannerState.LiteralFalse ||
       this.state === ScannerState.LiteralNull
     ) {
killedBy: Valid JSON Equivalence matches JSON.parse: false
statusReason: expected undefined to deeply equal false

[Killed] EqualityOperator
src/lexer/scanner.ts:260:7
     if (
       this.state === ScannerState.LiteralTrue ||
       this.state === ScannerState.LiteralFalse ||
-      this.state === ScannerState.LiteralNull
+      this.state !== ScannerState.LiteralNull
     ) {
       if (this.literalIndex === this.literalTarget.length) {
killedBy: Valid JSON Equivalence matches JSON.parse: null
statusReason: expected undefined to deeply equal null

[Killed] ConditionalExpression
src/lexer/scanner.ts:260:7
     if (
       this.state === ScannerState.LiteralTrue ||
       this.state === ScannerState.LiteralFalse ||
-      this.state === ScannerState.LiteralNull
+      false
     ) {
       if (this.literalIndex === this.literalTarget.length) {
killedBy: Parser valid JSON equivalence matches JSON.parse for: null
statusReason: expected undefined to deeply equal null

[Killed] BlockStatement
src/lexer/scanner.ts:261:7
       this.state === ScannerState.LiteralTrue ||
       this.state === ScannerState.LiteralFalse ||
       this.state === ScannerState.LiteralNull
-    ) {
-      if (this.literalIndex === this.literalTarget.length) {
-        const type =
-          this.literalTarget === "true"
-            ? TokenType.True
-            : this.literalTarget === "false"
-              ? TokenType.False
-              : TokenType.Null;
-        this.emitToken(
-          type,
-          this.literalTarget,
-          this.literalByteStart,
-          this.currentByteOffset + 1,
-        );
-        this.state = ScannerState.TrailingWhitespace;
-        return true;
-      }
-    }
+    ) {}
     return false;
   }
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true

[Killed] EqualityOperator
src/lexer/scanner.ts:262:11
       this.state === ScannerState.LiteralFalse ||
       this.state === ScannerState.LiteralNull
     ) {
-      if (this.literalIndex === this.literalTarget.length) {
+      if (this.literalIndex !== this.literalTarget.length) {
         const type =
           this.literalTarget === "true"
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true

[Killed] BlockStatement
src/lexer/scanner.ts:262:60
       this.state === ScannerState.LiteralFalse ||
       this.state === ScannerState.LiteralNull
     ) {
-      if (this.literalIndex === this.literalTarget.length) {
-        const type =
-          this.literalTarget === "true"
-            ? TokenType.True
-            : this.literalTarget === "false"
-              ? TokenType.False
-              : TokenType.Null;
-        this.emitToken(
-          type,
-          this.literalTarget,
-          this.literalByteStart,
-          this.currentByteOffset + 1,
-        );
-        this.state = ScannerState.TrailingWhitespace;
-        return true;
-      }
+      if (this.literalIndex === this.literalTarget.length) {}
     }
     return false;
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true

[Killed] ConditionalExpression
src/lexer/scanner.ts:264:11
     ) {
       if (this.literalIndex === this.literalTarget.length) {
         const type =
-          this.literalTarget === "true"
+          false
             ? TokenType.True
             : this.literalTarget === "false"
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected null to deeply equal true

[Killed] ConditionalExpression
src/lexer/scanner.ts:264:11
     ) {
       if (this.literalIndex === this.literalTarget.length) {
         const type =
-          this.literalTarget === "true"
+          true
             ? TokenType.True
             : this.literalTarget === "false"
killedBy: Valid JSON Equivalence matches JSON.parse: false
statusReason: expected true to deeply equal false

[Killed] ConditionalExpression
src/lexer/scanner.ts:266:15
         const type =
           this.literalTarget === "true"
             ? TokenType.True
-            : this.literalTarget === "false"
+            : true
               ? TokenType.False
               : TokenType.Null;
killedBy: Parser valid JSON equivalence matches JSON.parse for: null
statusReason: expected false to deeply equal null

[Killed] EqualityOperator
src/lexer/scanner.ts:266:15
         const type =
           this.literalTarget === "true"
             ? TokenType.True
-            : this.literalTarget === "false"
+            : this.literalTarget !== "false"
               ? TokenType.False
               : TokenType.Null;
killedBy: Parser valid JSON equivalence matches JSON.parse for: false
statusReason: expected null to deeply equal false

[Survived] ArithmeticOperator
src/lexer/scanner.ts:273:11
           type,
           this.literalTarget,
           this.literalByteStart,
-          this.currentByteOffset + 1,
+          this.currentByteOffset - 1,
         );
         this.state = ScannerState.TrailingWhitespace;

[Killed] ConditionalExpression
src/lexer/scanner.ts:287:9
   // -----------------------------------------------------------------------
 
   private processStructural(ch: string, byteOffset: number, charByteLen: number): void {
-    if (isWhitespace(ch)) return;
+    if (true) return;
 
     if (ch === "{") {
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected undefined to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/lexer/scanner.ts:287:9
   // -----------------------------------------------------------------------
 
   private processStructural(ch: string, byteOffset: number, charByteLen: number): void {
-    if (isWhitespace(ch)) return;
+    if (false) return;
 
     if (ch === "{") {
killedBy: Scanner whitespace handling skips whitespace between tokens
statusReason: expected 0 to be greater than or equal to 4

[Killed] BlockStatement
src/lexer/scanner.ts:289:21
   private processStructural(ch: string, byteOffset: number, charByteLen: number): void {
     if (isWhitespace(ch)) return;
 
-    if (ch === "{") {
-      this.emitToken(TokenType.ObjectStart, "{", byteOffset, byteOffset + charByteLen);
-      this.state = ScannerState.Structural;
-    } else if (ch === "[") {
+    if (ch === "{") {} else if (ch === "[") {
       this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected 'a' to deeply equal { a: 1 }

[Survived] ArithmeticOperator
src/lexer/scanner.ts:290:62
     if (isWhitespace(ch)) return;
 
     if (ch === "{") {
-      this.emitToken(TokenType.ObjectStart, "{", byteOffset, byteOffset + charByteLen);
+      this.emitToken(TokenType.ObjectStart, "{", byteOffset, byteOffset - charByteLen);
       this.state = ScannerState.Structural;
     } else if (ch === "[") {

[Killed] ConditionalExpression
src/lexer/scanner.ts:292:16
     if (ch === "{") {
       this.emitToken(TokenType.ObjectStart, "{", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
-    } else if (ch === "[") {
+    } else if (false) {
       this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
killedBy: Valid JSON Equivalence matches JSON.parse: [1,2,3]
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
src/lexer/scanner.ts:292:16
     if (ch === "{") {
       this.emitToken(TokenType.ObjectStart, "{", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
-    } else if (ch === "[") {
+    } else if (ch !== "[") {
       this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
killedBy: Scanner structural tokens scans empty object
statusReason: expected 3 to be 2 // Object.is equality

[Survived] ArithmeticOperator
src/lexer/scanner.ts:293:61
       this.emitToken(TokenType.ObjectStart, "{", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
     } else if (ch === "[") {
-      this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset + charByteLen);
+      this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset - charByteLen);
       this.state = ScannerState.Structural;
     } else if (ch === "}") {

[Killed] ConditionalExpression
src/lexer/scanner.ts:295:16
     } else if (ch === "[") {
       this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
-    } else if (ch === "}") {
+    } else if (true) {
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
     } else if (ch === "]") {
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] EqualityOperator
src/lexer/scanner.ts:295:16
     } else if (ch === "[") {
       this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
-    } else if (ch === "}") {
+    } else if (ch !== "}") {
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
     } else if (ch === "]") {
killedBy: Scanner structural tokens scans empty object
statusReason: expected [ { type: 1, value: '{', …(2) } ] to have a length of 2 but got 1

[Survived] ArithmeticOperator
src/lexer/scanner.ts:296:60
       this.emitToken(TokenType.ArrayStart, "[", byteOffset, byteOffset + charByteLen);
       this.state = ScannerState.Structural;
     } else if (ch === "}") {
-      this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
+      this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset - charByteLen);
     } else if (ch === "]") {
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);

[Killed] ConditionalExpression
src/lexer/scanner.ts:297:16
       this.state = ScannerState.Structural;
     } else if (ch === "}") {
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
-    } else if (ch === "]") {
+    } else if (false) {
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
     } else if (ch === ",") {
killedBy: Scanner structural tokens scans empty array
statusReason: expected [ { type: 3, value: '[', …(2) } ] to have a length of 2 but got 1

[Killed] EqualityOperator
src/lexer/scanner.ts:297:16
       this.state = ScannerState.Structural;
     } else if (ch === "}") {
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
-    } else if (ch === "]") {
+    } else if (ch !== "]") {
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
     } else if (ch === ",") {
killedBy: Scanner structural tokens scans empty array
statusReason: expected [ { type: 3, value: '[', …(2) } ] to have a length of 2 but got 1

[Survived] ArithmeticOperator
src/lexer/scanner.ts:298:59
     } else if (ch === "}") {
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
     } else if (ch === "]") {
-      this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
+      this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset - charByteLen);
     } else if (ch === ",") {
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);

[Killed] ConditionalExpression
src/lexer/scanner.ts:299:16
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
     } else if (ch === "]") {
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
-    } else if (ch === ",") {
+    } else if (false) {
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
     } else if (ch === ":") {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:299:16
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + charByteLen);
     } else if (ch === "]") {
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
-    } else if (ch === ",") {
+    } else if (ch !== ",") {
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
     } else if (ch === ":") {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Survived] ArithmeticOperator
src/lexer/scanner.ts:300:56
     } else if (ch === "]") {
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
     } else if (ch === ",") {
-      this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
+      this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset - charByteLen);
     } else if (ch === ":") {
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);

[Survived] StringLiteral
src/lexer/scanner.ts:300:39
     } else if (ch === "]") {
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
     } else if (ch === ",") {
-      this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
+      this.emitToken(TokenType.Comma, "", byteOffset, byteOffset + charByteLen);
     } else if (ch === ":") {
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);

[Killed] ConditionalExpression
src/lexer/scanner.ts:301:16
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
     } else if (ch === ",") {
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
-    } else if (ch === ":") {
+    } else if (false) {
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);
     } else if (ch === '"') {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/lexer/scanner.ts:301:16
       this.emitToken(TokenType.ArrayEnd, "]", byteOffset, byteOffset + charByteLen);
     } else if (ch === ",") {
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
-    } else if (ch === ":") {
+    } else if (ch !== ":") {
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);
     } else if (ch === '"') {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Survived] ArithmeticOperator
src/lexer/scanner.ts:302:56
     } else if (ch === ",") {
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
     } else if (ch === ":") {
-      this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);
+      this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset - charByteLen);
     } else if (ch === '"') {
       this.beginString(byteOffset);

[Killed] EqualityOperator
src/lexer/scanner.ts:303:16
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
     } else if (ch === ":") {
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);
-    } else if (ch === '"') {
+    } else if (ch !== '"') {
       this.beginString(byteOffset);
     } else if (ch === "-" || isDigit(ch)) {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/lexer/scanner.ts:303:16
       this.emitToken(TokenType.Comma, ",", byteOffset, byteOffset + charByteLen);
     } else if (ch === ":") {
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);
-    } else if (ch === '"') {
+    } else if (false) {
       this.beginString(byteOffset);
     } else if (ch === "-" || isDigit(ch)) {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] LogicalOperator
src/lexer/scanner.ts:305:16
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);
     } else if (ch === '"') {
       this.beginString(byteOffset);
-    } else if (ch === "-" || isDigit(ch)) {
+    } else if (ch === "-" && isDigit(ch)) {
       this.beginNumber(ch, byteOffset);
     } else if (ch === "t") {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:305:16
       this.emitToken(TokenType.Colon, ":", byteOffset, byteOffset + charByteLen);
     } else if (ch === '"') {
       this.beginString(byteOffset);
-    } else if (ch === "-" || isDigit(ch)) {
+    } else if (ch !== "-" || isDigit(ch)) {
       this.beginNumber(ch, byteOffset);
     } else if (ch === "t") {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:307:16
       this.beginString(byteOffset);
     } else if (ch === "-" || isDigit(ch)) {
       this.beginNumber(ch, byteOffset);
-    } else if (ch === "t") {
+    } else if (ch !== "t") {
       this.beginLiteral("true", byteOffset);
     } else if (ch === "f") {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] BlockStatement
src/lexer/scanner.ts:307:28
       this.beginString(byteOffset);
     } else if (ch === "-" || isDigit(ch)) {
       this.beginNumber(ch, byteOffset);
-    } else if (ch === "t") {
-      this.beginLiteral("true", byteOffset);
-    } else if (ch === "f") {
+    } else if (ch === "t") {} else if (ch === "f") {
       this.beginLiteral("false", byteOffset);
     } else if (ch === "n") {
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected { nested: {} } to deeply equal { nested: { x: true, y: false } }

[Killed] BlockStatement
src/lexer/scanner.ts:309:28
       this.beginNumber(ch, byteOffset);
     } else if (ch === "t") {
       this.beginLiteral("true", byteOffset);
-    } else if (ch === "f") {
-      this.beginLiteral("false", byteOffset);
-    } else if (ch === "n") {
+    } else if (ch === "f") {} else if (ch === "n") {
       this.beginLiteral("null", byteOffset);
     } else {
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected { nested: { x: true } } to deeply equal { nested: { x: true, y: false } }

[Killed] ConditionalExpression
src/lexer/scanner.ts:309:16
       this.beginNumber(ch, byteOffset);
     } else if (ch === "t") {
       this.beginLiteral("true", byteOffset);
-    } else if (ch === "f") {
+    } else if (false) {
       this.beginLiteral("false", byteOffset);
     } else if (ch === "n") {
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1, 'two', null ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[Killed] BlockStatement
src/lexer/scanner.ts:311:28
       this.beginLiteral("true", byteOffset);
     } else if (ch === "f") {
       this.beginLiteral("false", byteOffset);
-    } else if (ch === "n") {
-      this.beginLiteral("null", byteOffset);
-    } else {
+    } else if (ch === "n") {} else {
       this.emitDiagnostic(
         DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1, 'two' ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[Killed] ConditionalExpression
src/lexer/scanner.ts:311:16
       this.beginLiteral("true", byteOffset);
     } else if (ch === "f") {
       this.beginLiteral("false", byteOffset);
-    } else if (ch === "n") {
+    } else if (false) {
       this.beginLiteral("null", byteOffset);
     } else {
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1, 'two' ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[Killed] StringLiteral
src/lexer/scanner.ts:312:25
     } else if (ch === "f") {
       this.beginLiteral("false", byteOffset);
     } else if (ch === "n") {
-      this.beginLiteral("null", byteOffset);
+      this.beginLiteral("", byteOffset);
     } else {
       this.emitDiagnostic(
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1, 'two' ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[NoCoverage] BlockStatement
src/lexer/scanner.ts:313:12
       this.beginLiteral("false", byteOffset);
     } else if (ch === "n") {
       this.beginLiteral("null", byteOffset);
-    } else {
-      this.emitDiagnostic(
-        DiagnosticCode.E_UNEXPECTED_TOKEN,
-        "error",
-        byteOffset,
-        `Unexpected character: ${JSON.stringify(ch)}`,
-        false,
-      );
-      this.state = ScannerState.Invalid;
-    }
+    } else {}
   }
 

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:319:9
         "error",
         byteOffset,
         `Unexpected character: ${JSON.stringify(ch)}`,
-        false,
+        true,
       );
       this.state = ScannerState.Invalid;

[NoCoverage] BlockStatement
src/lexer/scanner.ts:325:66
     }
   }
 
-  private processObjectKey(ch: string, byteOffset: number): void {
-    if (isWhitespace(ch)) return;
-
-    if (ch === '"') {
-      this.nextStringIsKey = true;
-      this.beginString(byteOffset);
-    } else if (ch === "}") {
-      // Empty object or trailing comma -> close
-      this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + 1);
-    } else {
-      this.emitDiagnostic(
-        DiagnosticCode.E_UNEXPECTED_TOKEN,
-        "error",
-        byteOffset,
-        `Expected object key (string) or '}', got: ${JSON.stringify(ch)}`,
-        false,
-      );
-      this.state = ScannerState.Invalid;
-    }
-  }
+  private processObjectKey(ch: string, byteOffset: number): void {}
 
   private processString(ch: string, byteOffset: number, charByteLen: number): void {

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:326:9
   }
 
   private processObjectKey(ch: string, byteOffset: number): void {
-    if (isWhitespace(ch)) return;
+    if (true) return;
 
     if (ch === '"') {

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:326:9
   }
 
   private processObjectKey(ch: string, byteOffset: number): void {
-    if (isWhitespace(ch)) return;
+    if (false) return;
 
     if (ch === '"') {

[NoCoverage] BlockStatement
src/lexer/scanner.ts:328:21
   private processObjectKey(ch: string, byteOffset: number): void {
     if (isWhitespace(ch)) return;
 
-    if (ch === '"') {
-      this.nextStringIsKey = true;
-      this.beginString(byteOffset);
-    } else if (ch === "}") {
+    if (ch === '"') {} else if (ch === "}") {
       // Empty object or trailing comma -> close
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + 1);

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:328:9
   private processObjectKey(ch: string, byteOffset: number): void {
     if (isWhitespace(ch)) return;
 
-    if (ch === '"') {
+    if (false) {
       this.nextStringIsKey = true;
       this.beginString(byteOffset);

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:329:30
     if (isWhitespace(ch)) return;
 
     if (ch === '"') {
-      this.nextStringIsKey = true;
+      this.nextStringIsKey = false;
       this.beginString(byteOffset);
     } else if (ch === "}") {

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:331:16
     if (ch === '"') {
       this.nextStringIsKey = true;
       this.beginString(byteOffset);
-    } else if (ch === "}") {
+    } else if (ch !== "}") {
       // Empty object or trailing comma -> close
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + 1);

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:331:16
     if (ch === '"') {
       this.nextStringIsKey = true;
       this.beginString(byteOffset);
-    } else if (ch === "}") {
+    } else if (true) {
       // Empty object or trailing comma -> close
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + 1);

[NoCoverage] ArithmeticOperator
src/lexer/scanner.ts:333:60
       this.beginString(byteOffset);
     } else if (ch === "}") {
       // Empty object or trailing comma -> close
-      this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + 1);
+      this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset - 1);
     } else {
       this.emitDiagnostic(

[NoCoverage] BlockStatement
src/lexer/scanner.ts:334:12
     } else if (ch === "}") {
       // Empty object or trailing comma -> close
       this.emitToken(TokenType.ObjectEnd, "}", byteOffset, byteOffset + 1);
-    } else {
-      this.emitDiagnostic(
-        DiagnosticCode.E_UNEXPECTED_TOKEN,
-        "error",
-        byteOffset,
-        `Expected object key (string) or '}', got: ${JSON.stringify(ch)}`,
-        false,
-      );
-      this.state = ScannerState.Invalid;
-    }
+    } else {}
   }
 

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:340:9
         "error",
         byteOffset,
         `Expected object key (string) or '}', got: ${JSON.stringify(ch)}`,
-        false,
+        true,
       );
       this.state = ScannerState.Invalid;

[Killed] ConditionalExpression
src/lexer/scanner.ts:347:9
   }
 
   private processString(ch: string, byteOffset: number, charByteLen: number): void {
-    if (ch === "\\") {
+    if (true) {
       this.state = ScannerState.Escape;
     } else if (ch === '"') {
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/lexer/scanner.ts:347:22
   }
 
   private processString(ch: string, byteOffset: number, charByteLen: number): void {
-    if (ch === "\\") {
-      this.state = ScannerState.Escape;
-    } else if (ch === '"') {
+    if (ch === "\\") {} else if (ch === '"') {
       // String complete
       this.emitToken(
killedBy: Valid JSON Equivalence matches JSON.parse: {"msg":"line1\nline2"}
statusReason: expected { msg: 'line1nline2' } to deeply equal { msg: 'line1\nline2' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:349:16
   private processString(ch: string, byteOffset: number, charByteLen: number): void {
     if (ch === "\\") {
       this.state = ScannerState.Escape;
-    } else if (ch === '"') {
+    } else if (false) {
       // String complete
       this.emitToken(
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/lexer/scanner.ts:349:16
   private processString(ch: string, byteOffset: number, charByteLen: number): void {
     if (ch === "\\") {
       this.state = ScannerState.Escape;
-    } else if (ch === '"') {
+    } else if (true) {
       // String complete
       this.emitToken(
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Survived] ArithmeticOperator
src/lexer/scanner.ts:355:9
         TokenType.String,
         this.stringBuffer,
         this.stringByteStart,
-        byteOffset + charByteLen,
+        byteOffset - charByteLen,
       );
       this.stringBuffer = "";

[Survived] StringLiteral
src/lexer/scanner.ts:357:27
         this.stringByteStart,
         byteOffset + charByteLen,
       );
-      this.stringBuffer = "";
+      this.stringBuffer = "Stryker was here!";
       this.state = ScannerState.Structural;
     } else {

[Killed] LogicalOperator
src/lexer/scanner.ts:361:20
       this.state = ScannerState.Structural;
     } else {
       // Check for raw control characters
-      const code = ch.codePointAt(0) ?? 0;
+      const code = ch.codePointAt(0) && 0;
       if (code < 0x20) {
         if (this.options.repairs?.rawControlCharacters === "escape") {
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/lexer/scanner.ts:362:11
     } else {
       // Check for raw control characters
       const code = ch.codePointAt(0) ?? 0;
-      if (code < 0x20) {
+      if (false) {
         if (this.options.repairs?.rawControlCharacters === "escape") {
 
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'root_complete' to be 'invalid' // Object.is equality
