[Killed] ConditionalExpression
src/lexer/scanner.ts:362:11
     } else {
       // Check for raw control characters
       const code = ch.codePointAt(0) ?? 0;
-      if (code < 0x20) {
+      if (true) {
         if (this.options.repairs?.rawControlCharacters === "escape") {
 
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] OptionalChaining
src/lexer/scanner.ts:363:13
       // Check for raw control characters
       const code = ch.codePointAt(0) ?? 0;
       if (code < 0x20) {
-        if (this.options.repairs?.rawControlCharacters === "escape") {
+        if (this.options.repairs.rawControlCharacters === "escape") {
 
           this.stringBuffer += ch; // Note: semantic character value preserved!
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: Cannot read properties of undefined (reading 'rawControlCharacters')

[Killed] ConditionalExpression
src/lexer/scanner.ts:363:13
       // Check for raw control characters
       const code = ch.codePointAt(0) ?? 0;
       if (code < 0x20) {
-        if (this.options.repairs?.rawControlCharacters === "escape") {
+        if (true) {
 
           this.stringBuffer += ch; // Note: semantic character value preserved!
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'root_complete' to be 'invalid' // Object.is equality

[NoCoverage] AssignmentOperator
src/lexer/scanner.ts:365:11
       if (code < 0x20) {
         if (this.options.repairs?.rawControlCharacters === "escape") {
 
-          this.stringBuffer += ch; // Note: semantic character value preserved!
+          this.stringBuffer -= ch; // Note: semantic character value preserved!
           this.repairs.push({
              code: "R_ESCAPE_RAW_CONTROL",

[NoCoverage] ArithmeticOperator
src/lexer/scanner.ts:368:38
           this.stringBuffer += ch; // Note: semantic character value preserved!
           this.repairs.push({
              code: "R_ESCAPE_RAW_CONTROL",
-             byteRange: [byteOffset, byteOffset + charByteLen],
+             byteRange: [byteOffset, byteOffset - charByteLen],
              impact: "representation_preserving",
              description: `Escaped raw control character U+${code.toString(16).padStart(4, "0")}`,

[Killed] BlockStatement
src/lexer/scanner.ts:372:16
              impact: "representation_preserving",
              description: `Escaped raw control character U+${code.toString(16).padStart(4, "0")}`,
           });
-        } else {
-          this.emitDiagnostic(
-            DiagnosticCode.W_RAW_CONTROL_CHARACTER,
-            "error", // Reject mode makes this an error
-            byteOffset,
-            `Raw control character U+${code.toString(16).padStart(4, "0")} in string`,
-            false,
-          );
-          this.state = ScannerState.Invalid;
-          return;
-        }
+        } else {}
       } else {
         this.stringBuffer += ch;
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'root_complete' to be 'invalid' // Object.is equality

[Survived] StringLiteral
src/lexer/scanner.ts:377:70
             DiagnosticCode.W_RAW_CONTROL_CHARACTER,
             "error", // Reject mode makes this an error
             byteOffset,
-            `Raw control character U+${code.toString(16).padStart(4, "0")} in string`,
+            `Raw control character U+${code.toString(16).padStart(4, "")} in string`,
             false,
           );

[Killed] BooleanLiteral
src/lexer/scanner.ts:378:13
             "error", // Reject mode makes this an error
             byteOffset,
             `Raw control character U+${code.toString(16).padStart(4, "0")} in string`,
-            false,
+            true,
           );
           this.state = ScannerState.Invalid;
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Killed] BlockStatement
src/lexer/scanner.ts:383:14
           this.state = ScannerState.Invalid;
           return;
         }
-      } else {
-        this.stringBuffer += ch;
-      }
+      } else {}
     }
   }
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] AssignmentOperator
src/lexer/scanner.ts:384:9
           return;
         }
       } else {
-        this.stringBuffer += ch;
+        this.stringBuffer -= ch;
       }
     }
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected { NaN: 1 } to deeply equal { a: 1 }

[Survived] StringLiteral
src/lexer/scanner.ts:391:12
 
   private processEscape(ch: string, byteOffset: number, _charByteLen: number): void {
     switch (ch) {
-      case '"':
+      case "":
       case "\\":
       case "/":

[Killed] ConditionalExpression
src/lexer/scanner.ts:393:7
     switch (ch) {
       case '"':
       case "\\":
-      case "/":
-        this.stringBuffer += ch;
-        this.state = ScannerState.InString;
-        break;
+      case "/":
       case "b":
         this.stringBuffer += "\b";
killedBy: Valid JSON Equivalence matches JSON.parse: {"path":"c:\\dir\\file"}
statusReason: expected { path: 'c:\bdir\bfile' } to deeply equal { path: 'c:\dir\file' }

[Killed] AssignmentOperator
src/lexer/scanner.ts:394:9
       case '"':
       case "\\":
       case "/":
-        this.stringBuffer += ch;
+        this.stringBuffer -= ch;
         this.state = ScannerState.InString;
         break;
killedBy: Valid JSON Equivalence matches JSON.parse: {"path":"c:\\dir\\file"}
statusReason: expected { path: 'NaNfile' } to deeply equal { path: 'c:\dir\file' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:397:7
         this.stringBuffer += ch;
         this.state = ScannerState.InString;
         break;
-      case "b":
-        this.stringBuffer += "\b";
-        this.state = ScannerState.InString;
-        break;
+      case "b":
       case "f":
         this.stringBuffer += "\f";
killedBy: Parser string escapes handles all standard escape sequences
statusReason: expected { v: 'a\nb\tc\d/e\ff\fg' } to deeply equal { v: 'a\nb\tc\d/e\bf\fg' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:401:7
         this.stringBuffer += "\b";
         this.state = ScannerState.InString;
         break;
-      case "f":
-        this.stringBuffer += "\f";
-        this.state = ScannerState.InString;
-        break;
+      case "f":
       case "n":
         this.stringBuffer += "\n";
killedBy: Parser string escapes handles all standard escape sequences
statusReason: expected { v: 'a\nb\tc\d/e\bf\ng' } to deeply equal { v: 'a\nb\tc\d/e\bf\fg' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:405:7
         this.stringBuffer += "\f";
         this.state = ScannerState.InString;
         break;
-      case "n":
-        this.stringBuffer += "\n";
-        this.state = ScannerState.InString;
-        break;
+      case "n":
       case "r":
         this.stringBuffer += "\r";
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"msg":"hello\nworld"}
statusReason: expected { msg: 'hello\rworld' } to deeply equal { msg: 'hello\nworld' }

[Killed] StringLiteral
src/lexer/scanner.ts:406:30
         this.state = ScannerState.InString;
         break;
       case "n":
-        this.stringBuffer += "\n";
+        this.stringBuffer += "";
         this.state = ScannerState.InString;
         break;
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"msg":"hello\nworld"}
statusReason: expected { msg: 'helloworld' } to deeply equal { msg: 'hello\nworld' }

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:409:7
         this.stringBuffer += "\n";
         this.state = ScannerState.InString;
         break;
-      case "r":
-        this.stringBuffer += "\r";
-        this.state = ScannerState.InString;
-        break;
+      case "r":
       case "t":
         this.stringBuffer += "\t";

[NoCoverage] StringLiteral
src/lexer/scanner.ts:410:30
         this.state = ScannerState.InString;
         break;
       case "r":
-        this.stringBuffer += "\r";
+        this.stringBuffer += "";
         this.state = ScannerState.InString;
         break;

[Killed] ConditionalExpression
src/lexer/scanner.ts:413:7
         this.stringBuffer += "\r";
         this.state = ScannerState.InString;
         break;
-      case "t":
-        this.stringBuffer += "\t";
-        this.state = ScannerState.InString;
-        break;
+      case "t":
       case "u":
         this.unicodeHexBuffer = "";
killedBy: Parser string escapes handles all standard escape sequences
statusReason: expected {} to deeply equal { v: 'a\nb\tc\d/e\bf\fg' }

[Killed] StringLiteral
src/lexer/scanner.ts:413:12
         this.stringBuffer += "\r";
         this.state = ScannerState.InString;
         break;
-      case "t":
+      case "":
         this.stringBuffer += "\t";
         this.state = ScannerState.InString;
killedBy: Parser string escapes handles all standard escape sequences
statusReason: expected {} to deeply equal { v: 'a\nb\tc\d/e\bf\fg' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:417:7
         this.stringBuffer += "\t";
         this.state = ScannerState.InString;
         break;
-      case "u":
-        this.unicodeHexBuffer = "";
-        this.state = ScannerState.UnicodeEscape;
-        break;
+      case "u":
       default:
         this.emitDiagnostic(
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:421:7
         this.unicodeHexBuffer = "";
         this.state = ScannerState.UnicodeEscape;
         break;
-      default:
-        this.emitDiagnostic(
-          DiagnosticCode.E_UNEXPECTED_TOKEN,
-          "error",
-          byteOffset,
-          `Invalid escape sequence: \\${ch}`,
-          false,
-        );
-        this.state = ScannerState.Invalid;
-        break;
+      default:
     }
   }

[NoCoverage] StringLiteral
src/lexer/scanner.ts:426:11
           DiagnosticCode.E_UNEXPECTED_TOKEN,
           "error",
           byteOffset,
-          `Invalid escape sequence: \\${ch}`,
+          ``,
           false,
         );

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:427:11
           "error",
           byteOffset,
           `Invalid escape sequence: \\${ch}`,
-          false,
+          true,
         );
         this.state = ScannerState.Invalid;

[Killed] ConditionalExpression
src/lexer/scanner.ts:435:9
   }
 
   private processUnicodeEscape(ch: string, _byteOffset: number, _charByteLen: number): void {
-    if (isHexDigit(ch)) {
+    if (false) {
       this.unicodeHexBuffer += ch;
       if (this.unicodeHexBuffer.length === 4) {
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[Survived] ConditionalExpression
src/lexer/scanner.ts:435:9
   }
 
   private processUnicodeEscape(ch: string, _byteOffset: number, _charByteLen: number): void {
-    if (isHexDigit(ch)) {
+    if (true) {
       this.unicodeHexBuffer += ch;
       if (this.unicodeHexBuffer.length === 4) {

[Killed] AssignmentOperator
src/lexer/scanner.ts:436:7
 
   private processUnicodeEscape(ch: string, _byteOffset: number, _charByteLen: number): void {
     if (isHexDigit(ch)) {
-      this.unicodeHexBuffer += ch;
+      this.unicodeHexBuffer -= ch;
       if (this.unicodeHexBuffer.length === 4) {
         const codeUnit = parseInt(this.unicodeHexBuffer, 16);
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:437:11
   private processUnicodeEscape(ch: string, _byteOffset: number, _charByteLen: number): void {
     if (isHexDigit(ch)) {
       this.unicodeHexBuffer += ch;
-      if (this.unicodeHexBuffer.length === 4) {
+      if (false) {
         const codeUnit = parseInt(this.unicodeHexBuffer, 16);
 
killedBy: Valid JSON Equivalence matches JSON.parse: {"unicode":"\u0041"}
statusReason: expected {} to deeply equal { unicode: 'A' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:437:11
   private processUnicodeEscape(ch: string, _byteOffset: number, _charByteLen: number): void {
     if (isHexDigit(ch)) {
       this.unicodeHexBuffer += ch;
-      if (this.unicodeHexBuffer.length === 4) {
+      if (true) {
         const codeUnit = parseInt(this.unicodeHexBuffer, 16);
 
killedBy: Parser string escapes handles unicode escapes
statusReason: expected { v: '\u0000041\u0000042' } to deeply equal { v: 'AB' }

[Killed] EqualityOperator
src/lexer/scanner.ts:440:13
       if (this.unicodeHexBuffer.length === 4) {
         const codeUnit = parseInt(this.unicodeHexBuffer, 16);
 
-        if (this.highSurrogate !== 0) {
+        if (this.highSurrogate === 0) {
           // We expect a low surrogate
           if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:440:13
       if (this.unicodeHexBuffer.length === 4) {
         const codeUnit = parseInt(this.unicodeHexBuffer, 16);
 
-        if (this.highSurrogate !== 0) {
+        if (true) {
           // We expect a low surrogate
           if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:442:15
 
         if (this.highSurrogate !== 0) {
           // We expect a low surrogate
-          if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
+          if (false) {
             // Valid surrogate pair
             const fullCodePoint =

[NoCoverage] LogicalOperator
src/lexer/scanner.ts:442:15
 
         if (this.highSurrogate !== 0) {
           // We expect a low surrogate
-          if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
+          if (codeUnit >= 0xdc00 || codeUnit <= 0xdfff) {
             // Valid surrogate pair
             const fullCodePoint =

[NoCoverage] ArithmeticOperator
src/lexer/scanner.ts:445:15
           if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
             // Valid surrogate pair
             const fullCodePoint =
-              0x10000 +
-              ((this.highSurrogate - 0xd800) << 10) +
+              0x10000 - (this.highSurrogate - 0xd800 << 10) +
               (codeUnit - 0xdc00);
             this.stringBuffer += String.fromCodePoint(fullCodePoint);

[NoCoverage] ArithmeticOperator
src/lexer/scanner.ts:445:15
           if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
             // Valid surrogate pair
             const fullCodePoint =
-              0x10000 +
-              ((this.highSurrogate - 0xd800) << 10) +
-              (codeUnit - 0xdc00);
+              0x10000 + (this.highSurrogate - 0xd800 << 10) - (codeUnit - 0xdc00);
             this.stringBuffer += String.fromCodePoint(fullCodePoint);
             this.highSurrogate = 0;

[NoCoverage] ArithmeticOperator
src/lexer/scanner.ts:446:17
             // Valid surrogate pair
             const fullCodePoint =
               0x10000 +
-              ((this.highSurrogate - 0xd800) << 10) +
+              ((this.highSurrogate + 0xd800) << 10) +
               (codeUnit - 0xdc00);
             this.stringBuffer += String.fromCodePoint(fullCodePoint);

[NoCoverage] ArithmeticOperator
src/lexer/scanner.ts:447:16
             const fullCodePoint =
               0x10000 +
               ((this.highSurrogate - 0xd800) << 10) +
-              (codeUnit - 0xdc00);
+              (codeUnit + 0xdc00);
             this.stringBuffer += String.fromCodePoint(fullCodePoint);
             this.highSurrogate = 0;

[NoCoverage] AssignmentOperator
src/lexer/scanner.ts:448:13
               0x10000 +
               ((this.highSurrogate - 0xd800) << 10) +
               (codeUnit - 0xdc00);
-            this.stringBuffer += String.fromCodePoint(fullCodePoint);
+            this.stringBuffer -= String.fromCodePoint(fullCodePoint);
             this.highSurrogate = 0;
             this.state = ScannerState.InString;

[NoCoverage] BlockStatement
src/lexer/scanner.ts:451:18
             this.stringBuffer += String.fromCodePoint(fullCodePoint);
             this.highSurrogate = 0;
             this.state = ScannerState.InString;
-          } else {
-            // Expected low surrogate, got something else
-            this.emitDiagnostic(
-              DiagnosticCode.E_UNPAIRED_SURROGATE,
-              "error",
-              this.currentByteOffset,
-              `Expected low surrogate after \\u${this.highSurrogate.toString(16).padStart(4, "0")}, got \\u${this.unicodeHexBuffer}`,
-              false,
-            );
-            this.highSurrogate = 0;
-            this.state = ScannerState.Invalid;
-          }
+          } else {}
         } else if (codeUnit >= 0xd800 && codeUnit <= 0xdbff) {
           // High surrogate — need to see \uDC00-\uDFFF next

[NoCoverage] StringLiteral
src/lexer/scanner.ts:455:15
             // Expected low surrogate, got something else
             this.emitDiagnostic(
               DiagnosticCode.E_UNPAIRED_SURROGATE,
-              "error",
+              "",
               this.currentByteOffset,
               `Expected low surrogate after \\u${this.highSurrogate.toString(16).padStart(4, "0")}, got \\u${this.unicodeHexBuffer}`,

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:458:15
               "error",
               this.currentByteOffset,
               `Expected low surrogate after \\u${this.highSurrogate.toString(16).padStart(4, "0")}, got \\u${this.unicodeHexBuffer}`,
-              false,
+              true,
             );
             this.highSurrogate = 0;

[Killed] ConditionalExpression
src/lexer/scanner.ts:463:20
             this.highSurrogate = 0;
             this.state = ScannerState.Invalid;
           }
-        } else if (codeUnit >= 0xd800 && codeUnit <= 0xdbff) {
+        } else if (true) {
           // High surrogate — need to see \uDC00-\uDFFF next
           this.highSurrogate = codeUnit;
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:463:20
             this.highSurrogate = 0;
             this.state = ScannerState.Invalid;
           }
-        } else if (codeUnit >= 0xd800 && codeUnit <= 0xdbff) {
+        } else if (true && codeUnit <= 0xdbff) {
           // High surrogate — need to see \uDC00-\uDFFF next
           this.highSurrogate = codeUnit;
killedBy: Valid JSON Equivalence matches JSON.parse: {"unicode":"\u0041"}
statusReason: expected {} to deeply equal { unicode: 'A' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:468:20
           this.highSurrogate = codeUnit;
           this.surrogatePhase = 0;
           this.state = ScannerState.UnicodeSurrogatePending;
-        } else if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
+        } else if (true) {
           // Unexpected low surrogate without high
           this.emitDiagnostic(
killedBy: Valid JSON Equivalence matches JSON.parse: {"unicode":"\u0041"}
statusReason: expected {} to deeply equal { unicode: 'A' }

[Killed] ConditionalExpression
src/lexer/scanner.ts:468:20
           this.highSurrogate = codeUnit;
           this.surrogatePhase = 0;
           this.state = ScannerState.UnicodeSurrogatePending;
-        } else if (codeUnit >= 0xdc00 && codeUnit <= 0xdfff) {
+        } else if (true && codeUnit <= 0xdfff) {
           // Unexpected low surrogate without high
           this.emitDiagnostic(
killedBy: Parser string escapes handles unicode escapes
statusReason: expected {} to deeply equal { v: 'AB' }

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:475:13
             "error",
             this.currentByteOffset,
             `Unexpected low surrogate: \\u${this.unicodeHexBuffer}`,
-            false,
+            true,
           );
           this.state = ScannerState.Invalid;

[Killed] BlockStatement
src/lexer/scanner.ts:478:16
             false,
           );
           this.state = ScannerState.Invalid;
-        } else {
-          this.stringBuffer += String.fromCharCode(codeUnit);
-          this.state = ScannerState.InString;
-        }
+        } else {}
         this.unicodeHexBuffer = "";
       }
killedBy: Valid JSON Equivalence matches JSON.parse: {"unicode":"\u0041"}
statusReason: expected {} to deeply equal { unicode: 'A' }

[Killed] AssignmentOperator
src/lexer/scanner.ts:479:11
           );
           this.state = ScannerState.Invalid;
         } else {
-          this.stringBuffer += String.fromCharCode(codeUnit);
+          this.stringBuffer -= String.fromCharCode(codeUnit);
           this.state = ScannerState.InString;
         }
killedBy: Parser string escapes handles unicode escapes
statusReason: expected { v: NaN } to deeply equal { v: 'AB' }

[NoCoverage] BlockStatement
src/lexer/scanner.ts:484:12
         }
         this.unicodeHexBuffer = "";
       }
-    } else {
-      this.emitDiagnostic(
-        DiagnosticCode.E_INVALID_UNICODE_ESCAPE,
-        "error",
-        this.currentByteOffset,
-        `Invalid hex digit in unicode escape: ${ch}`,
-        false,
-      );
-      this.state = ScannerState.Invalid;
-    }
+    } else {}
   }
 

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:490:9
         "error",
         this.currentByteOffset,
         `Invalid hex digit in unicode escape: ${ch}`,
-        false,
+        true,
       );
       this.state = ScannerState.Invalid;

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:499:9
   private processSurrogatePending(ch: string, byteOffset: number, _charByteLen: number): void {
     // Expecting \uDCxx sequence
     // surrogatePhase: 0 = expecting \, 1 = expecting u
-    if (this.surrogatePhase === 0) {
+    if (this.surrogatePhase !== 0) {
       if (ch === "\\") {
         this.surrogatePhase = 1;

[NoCoverage] BlockStatement
src/lexer/scanner.ts:499:36
   private processSurrogatePending(ch: string, byteOffset: number, _charByteLen: number): void {
     // Expecting \uDCxx sequence
     // surrogatePhase: 0 = expecting \, 1 = expecting u
-    if (this.surrogatePhase === 0) {
-      if (ch === "\\") {
-        this.surrogatePhase = 1;
-      } else {
-        // Not a surrogate pair continuation — unpaired high surrogate
-        this.emitDiagnostic(
-          DiagnosticCode.E_UNPAIRED_SURROGATE,
-          "error",
-          byteOffset,
-          `Expected \\u for low surrogate, got: ${JSON.stringify(ch)}`,
-          false,
-        );
-        this.highSurrogate = 0;
-        this.state = ScannerState.Invalid;
-      }
-    } else if (this.surrogatePhase === 1) {
+    if (this.surrogatePhase === 0) {} else if (this.surrogatePhase === 1) {
       if (ch === "u") {
         this.unicodeHexBuffer = "";

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:500:11
     // Expecting \uDCxx sequence
     // surrogatePhase: 0 = expecting \, 1 = expecting u
     if (this.surrogatePhase === 0) {
-      if (ch === "\\") {
+      if (ch !== "\\") {
         this.surrogatePhase = 1;
       } else {

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:500:11
     // Expecting \uDCxx sequence
     // surrogatePhase: 0 = expecting \, 1 = expecting u
     if (this.surrogatePhase === 0) {
-      if (ch === "\\") {
+      if (false) {
         this.surrogatePhase = 1;
       } else {

[NoCoverage] BlockStatement
src/lexer/scanner.ts:502:14
     if (this.surrogatePhase === 0) {
       if (ch === "\\") {
         this.surrogatePhase = 1;
-      } else {
-        // Not a surrogate pair continuation — unpaired high surrogate
-        this.emitDiagnostic(
-          DiagnosticCode.E_UNPAIRED_SURROGATE,
-          "error",
-          byteOffset,
-          `Expected \\u for low surrogate, got: ${JSON.stringify(ch)}`,
-          false,
-        );
-        this.highSurrogate = 0;
-        this.state = ScannerState.Invalid;
-      }
+      } else {}
     } else if (this.surrogatePhase === 1) {
       if (ch === "u") {

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:509:11
           "error",
           byteOffset,
           `Expected \\u for low surrogate, got: ${JSON.stringify(ch)}`,
-          false,
+          true,
         );
         this.highSurrogate = 0;

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:514:16
         this.highSurrogate = 0;
         this.state = ScannerState.Invalid;
       }
-    } else if (this.surrogatePhase === 1) {
+    } else if (this.surrogatePhase !== 1) {
       if (ch === "u") {
         this.unicodeHexBuffer = "";

[NoCoverage] BlockStatement
src/lexer/scanner.ts:514:43
         this.highSurrogate = 0;
         this.state = ScannerState.Invalid;
       }
-    } else if (this.surrogatePhase === 1) {
-      if (ch === "u") {
-        this.unicodeHexBuffer = "";
-        this.surrogatePhase = 0;
-        this.state = ScannerState.UnicodeEscape;
-      } else {
-        this.emitDiagnostic(
-          DiagnosticCode.E_UNPAIRED_SURROGATE,
-          "error",
-          byteOffset,
-          `Expected 'u' after '\\' for low surrogate, got: ${JSON.stringify(ch)}`,
-          false,
-        );
-        this.highSurrogate = 0;
-        this.state = ScannerState.Invalid;
-      }
-    }
+    } else if (this.surrogatePhase === 1) {}
   }
 

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:515:11
         this.state = ScannerState.Invalid;
       }
     } else if (this.surrogatePhase === 1) {
-      if (ch === "u") {
+      if (true) {
         this.unicodeHexBuffer = "";
         this.surrogatePhase = 0;

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:515:11
         this.state = ScannerState.Invalid;
       }
     } else if (this.surrogatePhase === 1) {
-      if (ch === "u") {
+      if (ch !== "u") {
         this.unicodeHexBuffer = "";
         this.surrogatePhase = 0;

[NoCoverage] BlockStatement
src/lexer/scanner.ts:519:14
         this.unicodeHexBuffer = "";
         this.surrogatePhase = 0;
         this.state = ScannerState.UnicodeEscape;
-      } else {
-        this.emitDiagnostic(
-          DiagnosticCode.E_UNPAIRED_SURROGATE,
-          "error",
-          byteOffset,
-          `Expected 'u' after '\\' for low surrogate, got: ${JSON.stringify(ch)}`,
-          false,
-        );
-        this.highSurrogate = 0;
-        this.state = ScannerState.Invalid;
-      }
+      } else {}
     }
   }

[NoCoverage] StringLiteral
src/lexer/scanner.ts:524:11
           DiagnosticCode.E_UNPAIRED_SURROGATE,
           "error",
           byteOffset,
-          `Expected 'u' after '\\' for low surrogate, got: ${JSON.stringify(ch)}`,
+          ``,
           false,
         );

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:525:11
           "error",
           byteOffset,
           `Expected 'u' after '\\' for low surrogate, got: ${JSON.stringify(ch)}`,
-          false,
+          true,
         );
         this.highSurrogate = 0;

[Killed] ConditionalExpression
src/lexer/scanner.ts:535:7
 
   private processNumber(ch: string, byteOffset: number, charByteLen: number): void {
     switch (this.state) {
-      case ScannerState.NumberInteger:
-        if (isDigit(ch)) {
-          this.numberBuffer += ch;
-          this.numberHasDigit = true;
-        } else if (ch === "." && this.numberHasDigit) {
-          this.numberBuffer += ch;
-          this.state = ScannerState.NumberFraction;
-        } else if ((ch === "e" || ch === "E") && this.numberHasDigit) {
-          this.numberBuffer += ch;
-          this.state = ScannerState.NumberExponentStart;
-        } else if (this.numberHasDigit && this.isValueTerminator(ch)) {
-          this.commitNumber(byteOffset);
-          this.reprocessChar(ch, byteOffset, charByteLen);
-        } else {
-          this.emitDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            byteOffset,
-            `Invalid character in number: ${JSON.stringify(ch)}`,
-            false,
-          );
-          this.state = ScannerState.Invalid;
-        }
-        break;
+      case ScannerState.NumberInteger:
 
       case ScannerState.NumberFraction:
killedBy: Valid JSON Equivalence matches JSON.parse: -3.14
statusReason: expected undefined to deeply equal -3.14

[Killed] BlockStatement
src/lexer/scanner.ts:536:26
   private processNumber(ch: string, byteOffset: number, charByteLen: number): void {
     switch (this.state) {
       case ScannerState.NumberInteger:
-        if (isDigit(ch)) {
-          this.numberBuffer += ch;
-          this.numberHasDigit = true;
-        } else if (ch === "." && this.numberHasDigit) {
+        if (isDigit(ch)) {} else if (ch === "." && this.numberHasDigit) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberFraction;
killedBy: Valid JSON Equivalence matches JSON.parse: {"name":"Alice","age":30}
statusReason: expected { name: 'Alice', age: 3 } to deeply equal { name: 'Alice', age: 30 }

[Killed] ConditionalExpression
src/lexer/scanner.ts:536:13
   private processNumber(ch: string, byteOffset: number, charByteLen: number): void {
     switch (this.state) {
       case ScannerState.NumberInteger:
-        if (isDigit(ch)) {
+        if (true) {
           this.numberBuffer += ch;
           this.numberHasDigit = true;
killedBy: Parser push() accepts a string chunk
statusReason: expected 'incomplete' to be 'root_complete' // Object.is equality
