[Killed] AssignmentOperator
src/lexer/scanner.ts:537:11
     switch (this.state) {
       case ScannerState.NumberInteger:
         if (isDigit(ch)) {
-          this.numberBuffer += ch;
+          this.numberBuffer -= ch;
           this.numberHasDigit = true;
         } else if (ch === "." && this.numberHasDigit) {
killedBy: Parser valid JSON equivalence matches JSON.parse for: 42
statusReason: expected 2 to deeply equal 42

[Killed] BooleanLiteral
src/lexer/scanner.ts:538:33
       case ScannerState.NumberInteger:
         if (isDigit(ch)) {
           this.numberBuffer += ch;
-          this.numberHasDigit = true;
+          this.numberHasDigit = false;
         } else if (ch === "." && this.numberHasDigit) {
           this.numberBuffer += ch;
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] LogicalOperator
src/lexer/scanner.ts:539:20
         if (isDigit(ch)) {
           this.numberBuffer += ch;
           this.numberHasDigit = true;
-        } else if (ch === "." && this.numberHasDigit) {
+        } else if (ch === "." || this.numberHasDigit) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberFraction;
killedBy: Parser push() accepts a string chunk
statusReason: expected 'incomplete' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/lexer/scanner.ts:539:20
         if (isDigit(ch)) {
           this.numberBuffer += ch;
           this.numberHasDigit = true;
-        } else if (ch === "." && this.numberHasDigit) {
+        } else if (true) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberFraction;
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected { a: NaN } to deeply equal { a: 1 }

[Killed] AssignmentOperator
src/lexer/scanner.ts:540:11
           this.numberBuffer += ch;
           this.numberHasDigit = true;
         } else if (ch === "." && this.numberHasDigit) {
-          this.numberBuffer += ch;
+          this.numberBuffer -= ch;
           this.state = ScannerState.NumberFraction;
         } else if ((ch === "e" || ch === "E") && this.numberHasDigit) {
killedBy: Valid JSON Equivalence matches JSON.parse: -3.14
statusReason: expected NaN to deeply equal -3.14

[Killed] ConditionalExpression
src/lexer/scanner.ts:542:20
         } else if (ch === "." && this.numberHasDigit) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberFraction;
-        } else if ((ch === "e" || ch === "E") && this.numberHasDigit) {
+        } else if (true) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/lexer/scanner.ts:542:20
         } else if (ch === "." && this.numberHasDigit) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberFraction;
-        } else if ((ch === "e" || ch === "E") && this.numberHasDigit) {
+        } else if (false) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected undefined to deeply equal 10000000000

[Killed] AssignmentOperator
src/lexer/scanner.ts:543:11
           this.numberBuffer += ch;
           this.state = ScannerState.NumberFraction;
         } else if ((ch === "e" || ch === "E") && this.numberHasDigit) {
-          this.numberBuffer += ch;
+          this.numberBuffer -= ch;
           this.state = ScannerState.NumberExponentStart;
         } else if (this.numberHasDigit && this.isValueTerminator(ch)) {
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected NaN to deeply equal 10000000000

[Killed] BlockStatement
src/lexer/scanner.ts:545:71
         } else if ((ch === "e" || ch === "E") && this.numberHasDigit) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
-        } else if (this.numberHasDigit && this.isValueTerminator(ch)) {
-          this.commitNumber(byteOffset);
-          this.reprocessChar(ch, byteOffset, charByteLen);
-        } else {
+        } else if (this.numberHasDigit && this.isValueTerminator(ch)) {} else {
           this.emitDiagnostic(
             DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/lexer/scanner.ts:545:20
         } else if ((ch === "e" || ch === "E") && this.numberHasDigit) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
-        } else if (this.numberHasDigit && this.isValueTerminator(ch)) {
+        } else if (false) {
           this.commitNumber(byteOffset);
           this.reprocessChar(ch, byteOffset, charByteLen);
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[NoCoverage] BlockStatement
src/lexer/scanner.ts:548:16
         } else if (this.numberHasDigit && this.isValueTerminator(ch)) {
           this.commitNumber(byteOffset);
           this.reprocessChar(ch, byteOffset, charByteLen);
-        } else {
-          this.emitDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            byteOffset,
-            `Invalid character in number: ${JSON.stringify(ch)}`,
-            false,
-          );
-          this.state = ScannerState.Invalid;
-        }
+        } else {}
         break;
 

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:554:13
             "error",
             byteOffset,
             `Invalid character in number: ${JSON.stringify(ch)}`,
-            false,
+            true,
           );
           this.state = ScannerState.Invalid;

[Killed] ConditionalExpression
src/lexer/scanner.ts:561:13
         break;
 
       case ScannerState.NumberFraction:
-        if (isDigit(ch)) {
+        if (true) {
           this.numberBuffer += ch;
         } else if (ch === "e" || ch === "E") {
killedBy: Scanner numbers scans decimal number
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/lexer/scanner.ts:561:26
         break;
 
       case ScannerState.NumberFraction:
-        if (isDigit(ch)) {
-          this.numberBuffer += ch;
-        } else if (ch === "e" || ch === "E") {
+        if (isDigit(ch)) {} else if (ch === "e" || ch === "E") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
killedBy: Valid JSON Equivalence matches JSON.parse: -3.14
statusReason: expected -3 to deeply equal -3.14

[Killed] ConditionalExpression
src/lexer/scanner.ts:563:20
       case ScannerState.NumberFraction:
         if (isDigit(ch)) {
           this.numberBuffer += ch;
-        } else if (ch === "e" || ch === "E") {
+        } else if (true) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
killedBy: Fuzz Corpus fuzz: fuzz-trunc-026 - Fuzz Truncation len=80
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:563:20
       case ScannerState.NumberFraction:
         if (isDigit(ch)) {
           this.numberBuffer += ch;
-        } else if (ch === "e" || ch === "E") {
+        } else if (ch !== "e" || ch === "E") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
killedBy: Fuzz Corpus fuzz: fuzz-trunc-026 - Fuzz Truncation len=80
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Survived] AssignmentOperator
src/lexer/scanner.ts:564:11
         if (isDigit(ch)) {
           this.numberBuffer += ch;
         } else if (ch === "e" || ch === "E") {
-          this.numberBuffer += ch;
+          this.numberBuffer -= ch;
           this.state = ScannerState.NumberExponentStart;
         } else if (this.isValueTerminator(ch)) {

[Killed] BlockStatement
src/lexer/scanner.ts:566:48
         } else if (ch === "e" || ch === "E") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
-        } else if (this.isValueTerminator(ch)) {
-          // Validate that we have at least one fraction digit
-          const lastChar = this.numberBuffer[this.numberBuffer.length - 1];
-          if (lastChar === ".") {
-            this.emitDiagnostic(
-              DiagnosticCode.E_UNEXPECTED_TOKEN,
-              "error",
-              byteOffset,
-              "Number has trailing decimal point with no digits",
-              false,
-            );
-            this.state = ScannerState.Invalid;
-          } else {
-            this.commitNumber(byteOffset);
-            this.reprocessChar(ch, byteOffset, charByteLen);
-          }
-        } else {
+        } else if (this.isValueTerminator(ch)) {} else {
           this.emitDiagnostic(
             DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Fuzz Corpus fuzz: fuzz-trunc-037 - Fuzz Truncation len=88
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/lexer/scanner.ts:566:20
         } else if (ch === "e" || ch === "E") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponentStart;
-        } else if (this.isValueTerminator(ch)) {
+        } else if (false) {
           // Validate that we have at least one fraction digit
           const lastChar = this.numberBuffer[this.numberBuffer.length - 1];
killedBy: Fuzz Corpus fuzz: fuzz-trunc-026 - Fuzz Truncation len=80
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Survived] ArithmeticOperator
src/lexer/scanner.ts:568:46
           this.state = ScannerState.NumberExponentStart;
         } else if (this.isValueTerminator(ch)) {
           // Validate that we have at least one fraction digit
-          const lastChar = this.numberBuffer[this.numberBuffer.length - 1];
+          const lastChar = this.numberBuffer[this.numberBuffer.length + 1];
           if (lastChar === ".") {
             this.emitDiagnostic(

[Killed] ConditionalExpression
src/lexer/scanner.ts:569:15
         } else if (this.isValueTerminator(ch)) {
           // Validate that we have at least one fraction digit
           const lastChar = this.numberBuffer[this.numberBuffer.length - 1];
-          if (lastChar === ".") {
+          if (true) {
             this.emitDiagnostic(
               DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Fuzz Corpus fuzz: fuzz-trunc-026 - Fuzz Truncation len=80
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:569:15
         } else if (this.isValueTerminator(ch)) {
           // Validate that we have at least one fraction digit
           const lastChar = this.numberBuffer[this.numberBuffer.length - 1];
-          if (lastChar === ".") {
+          if (lastChar !== ".") {
             this.emitDiagnostic(
               DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Fuzz Corpus fuzz: fuzz-trunc-026 - Fuzz Truncation len=80
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[NoCoverage] StringLiteral
src/lexer/scanner.ts:572:15
           if (lastChar === ".") {
             this.emitDiagnostic(
               DiagnosticCode.E_UNEXPECTED_TOKEN,
-              "error",
+              "",
               byteOffset,
               "Number has trailing decimal point with no digits",

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:575:15
               "error",
               byteOffset,
               "Number has trailing decimal point with no digits",
-              false,
+              true,
             );
             this.state = ScannerState.Invalid;

[Killed] BlockStatement
src/lexer/scanner.ts:578:18
               false,
             );
             this.state = ScannerState.Invalid;
-          } else {
-            this.commitNumber(byteOffset);
-            this.reprocessChar(ch, byteOffset, charByteLen);
-          }
+          } else {}
         } else {
           this.emitDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-037 - Fuzz Truncation len=88
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[NoCoverage] BlockStatement
src/lexer/scanner.ts:582:16
             this.commitNumber(byteOffset);
             this.reprocessChar(ch, byteOffset, charByteLen);
           }
-        } else {
-          this.emitDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            byteOffset,
-            `Invalid character in number fraction: ${JSON.stringify(ch)}`,
-            false,
-          );
-          this.state = ScannerState.Invalid;
-        }
+        } else {}
         break;
 

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:588:13
             "error",
             byteOffset,
             `Invalid character in number fraction: ${JSON.stringify(ch)}`,
-            false,
+            true,
           );
           this.state = ScannerState.Invalid;

[Killed] ConditionalExpression
src/lexer/scanner.ts:594:7
         }
         break;
 
-      case ScannerState.NumberExponentStart:
-        if (isDigit(ch)) {
-          this.numberBuffer += ch;
-          this.state = ScannerState.NumberExponent;
-        } else if (ch === "+" || ch === "-") {
-          this.numberBuffer += ch;
-          this.state = ScannerState.NumberExponent;
-        } else {
-          this.emitDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            byteOffset,
-            `Expected digit or sign after exponent, got: ${JSON.stringify(ch)}`,
-            false,
-          );
-          this.state = ScannerState.Invalid;
-        }
-        break;
+      case ScannerState.NumberExponentStart:
 
       case ScannerState.NumberExponent:
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected undefined to deeply equal 10000000000

[Killed] ConditionalExpression
src/lexer/scanner.ts:595:13
         break;
 
       case ScannerState.NumberExponentStart:
-        if (isDigit(ch)) {
+        if (false) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected undefined to deeply equal 10000000000

[Killed] BlockStatement
src/lexer/scanner.ts:595:26
         break;
 
       case ScannerState.NumberExponentStart:
-        if (isDigit(ch)) {
-          this.numberBuffer += ch;
-          this.state = ScannerState.NumberExponent;
-        } else if (ch === "+" || ch === "-") {
+        if (isDigit(ch)) {} else if (ch === "+" || ch === "-") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected undefined to deeply equal 10000000000

[Survived] EqualityOperator
src/lexer/scanner.ts:598:34
         if (isDigit(ch)) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;
-        } else if (ch === "+" || ch === "-") {
+        } else if (ch === "+" || ch !== "-") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;

[Survived] EqualityOperator
src/lexer/scanner.ts:598:20
         if (isDigit(ch)) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;
-        } else if (ch === "+" || ch === "-") {
+        } else if (ch !== "+" || ch === "-") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;

[Survived] AssignmentOperator
src/lexer/scanner.ts:599:11
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;
         } else if (ch === "+" || ch === "-") {
-          this.numberBuffer += ch;
+          this.numberBuffer -= ch;
           this.state = ScannerState.NumberExponent;
         } else {

[NoCoverage] BlockStatement
src/lexer/scanner.ts:601:16
         } else if (ch === "+" || ch === "-") {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberExponent;
-        } else {
-          this.emitDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            byteOffset,
-            `Expected digit or sign after exponent, got: ${JSON.stringify(ch)}`,
-            false,
-          );
-          this.state = ScannerState.Invalid;
-        }
+        } else {}
         break;
 

[NoCoverage] StringLiteral
src/lexer/scanner.ts:606:13
             DiagnosticCode.E_UNEXPECTED_TOKEN,
             "error",
             byteOffset,
-            `Expected digit or sign after exponent, got: ${JSON.stringify(ch)}`,
+            ``,
             false,
           );

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:607:13
             "error",
             byteOffset,
             `Expected digit or sign after exponent, got: ${JSON.stringify(ch)}`,
-            false,
+            true,
           );
           this.state = ScannerState.Invalid;

[Killed] BlockStatement
src/lexer/scanner.ts:614:26
         break;
 
       case ScannerState.NumberExponent:
-        if (isDigit(ch)) {
-          this.numberBuffer += ch;
-        } else if (this.isValueTerminator(ch)) {
+        if (isDigit(ch)) {} else if (this.isValueTerminator(ch)) {
           // Validate we have at least one exponent digit
           const last = this.numberBuffer[this.numberBuffer.length - 1];
killedBy: Valid JSON Equivalence matches JSON.parse: 1e10
statusReason: expected 10 to deeply equal 10000000000

[Killed] ConditionalExpression
src/lexer/scanner.ts:614:13
         break;
 
       case ScannerState.NumberExponent:
-        if (isDigit(ch)) {
+        if (true) {
           this.numberBuffer += ch;
         } else if (this.isValueTerminator(ch)) {
killedBy: Scanner numbers scans exponent number
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/lexer/scanner.ts:616:20
       case ScannerState.NumberExponent:
         if (isDigit(ch)) {
           this.numberBuffer += ch;
-        } else if (this.isValueTerminator(ch)) {
+        } else if (false) {
           // Validate we have at least one exponent digit
           const last = this.numberBuffer[this.numberBuffer.length - 1];
killedBy: Scanner numbers scans exponent number
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/lexer/scanner.ts:616:48
       case ScannerState.NumberExponent:
         if (isDigit(ch)) {
           this.numberBuffer += ch;
-        } else if (this.isValueTerminator(ch)) {
-          // Validate we have at least one exponent digit
-          const last = this.numberBuffer[this.numberBuffer.length - 1];
-          if (last === "+" || last === "-" || last === "e" || last === "E") {
-            this.emitDiagnostic(
-              DiagnosticCode.E_UNEXPECTED_TOKEN,
-              "error",
-              byteOffset,
-              "Number has exponent with no digits",
-              false,
-            );
-            this.state = ScannerState.Invalid;
-          } else {
-            this.commitNumber(byteOffset);
-            this.reprocessChar(ch, byteOffset, charByteLen);
-          }
-        } else {
+        } else if (this.isValueTerminator(ch)) {} else {
           this.emitDiagnostic(
             DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Scanner numbers scans exponent number
statusReason: expected [] to have a length of 2 but got +0

[Survived] ArithmeticOperator
src/lexer/scanner.ts:618:42
           this.numberBuffer += ch;
         } else if (this.isValueTerminator(ch)) {
           // Validate we have at least one exponent digit
-          const last = this.numberBuffer[this.numberBuffer.length - 1];
+          const last = this.numberBuffer[this.numberBuffer.length + 1];
           if (last === "+" || last === "-" || last === "e" || last === "E") {
             this.emitDiagnostic(

[Killed] EqualityOperator
src/lexer/scanner.ts:619:15
         } else if (this.isValueTerminator(ch)) {
           // Validate we have at least one exponent digit
           const last = this.numberBuffer[this.numberBuffer.length - 1];
-          if (last === "+" || last === "-" || last === "e" || last === "E") {
+          if (last !== "+" || last === "-" || last === "e" || last === "E") {
             this.emitDiagnostic(
               DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Scanner numbers scans exponent number
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/lexer/scanner.ts:619:31
         } else if (this.isValueTerminator(ch)) {
           // Validate we have at least one exponent digit
           const last = this.numberBuffer[this.numberBuffer.length - 1];
-          if (last === "+" || last === "-" || last === "e" || last === "E") {
+          if (last === "+" || last !== "-" || last === "e" || last === "E") {
             this.emitDiagnostic(
               DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Scanner numbers scans exponent number
statusReason: expected [] to have a length of 2 but got +0

[NoCoverage] StringLiteral
src/lexer/scanner.ts:624:15
               DiagnosticCode.E_UNEXPECTED_TOKEN,
               "error",
               byteOffset,
-              "Number has exponent with no digits",
+              "",
               false,
             );

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:625:15
               "error",
               byteOffset,
               "Number has exponent with no digits",
-              false,
+              true,
             );
             this.state = ScannerState.Invalid;

[NoCoverage] BlockStatement
src/lexer/scanner.ts:632:16
             this.commitNumber(byteOffset);
             this.reprocessChar(ch, byteOffset, charByteLen);
           }
-        } else {
-          this.emitDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            byteOffset,
-            `Invalid character in number exponent: ${JSON.stringify(ch)}`,
-            false,
-          );
-          this.state = ScannerState.Invalid;
-        }
+        } else {}
         break;
     }

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:638:13
             "error",
             byteOffset,
             `Invalid character in number exponent: ${JSON.stringify(ch)}`,
-            false,
+            true,
           );
           this.state = ScannerState.Invalid;

[Killed] EqualityOperator
src/lexer/scanner.ts:648:9
 
   private processLiteral(ch: string, byteOffset: number, charByteLen: number): void {
     const expected = this.literalTarget[this.literalIndex];
-    if (ch === expected) {
+    if (ch !== expected) {
       this.literalIndex++;
       if (this.literalIndex === this.literalTarget.length) {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/lexer/scanner.ts:648:9
 
   private processLiteral(ch: string, byteOffset: number, charByteLen: number): void {
     const expected = this.literalTarget[this.literalIndex];
-    if (ch === expected) {
+    if (false) {
       this.literalIndex++;
       if (this.literalIndex === this.literalTarget.length) {
killedBy: Scanner literals scans true
statusReason: expected [] to have a length of 2 but got +0

[Killed] UpdateOperator
src/lexer/scanner.ts:649:7
   private processLiteral(ch: string, byteOffset: number, charByteLen: number): void {
     const expected = this.literalTarget[this.literalIndex];
     if (ch === expected) {
-      this.literalIndex++;
+      this.literalIndex--;
       if (this.literalIndex === this.literalTarget.length) {
         // Literal is fully matched, but we can't emit until we see a terminator.
killedBy: Scanner literals scans true
statusReason: expected [] to have a length of 2 but got +0

[Survived] ConditionalExpression
src/lexer/scanner.ts:650:11
     const expected = this.literalTarget[this.literalIndex];
     if (ch === expected) {
       this.literalIndex++;
-      if (this.literalIndex === this.literalTarget.length) {
+      if (true) {
         // Literal is fully matched, but we can't emit until we see a terminator.
         // Stay in the literal state — the next character will either be a terminator

[Survived] ConditionalExpression
src/lexer/scanner.ts:650:11
     const expected = this.literalTarget[this.literalIndex];
     if (ch === expected) {
       this.literalIndex++;
-      if (this.literalIndex === this.literalTarget.length) {
+      if (false) {
         // Literal is fully matched, but we can't emit until we see a terminator.
         // Stay in the literal state — the next character will either be a terminator

[Killed] ConditionalExpression
src/lexer/scanner.ts:659:16
         // similar to numbers. Let's transition to a "literal complete, awaiting terminator" state.
         // For simplicity, we'll check on the next character.
       }
-    } else if (this.literalIndex === this.literalTarget.length) {
+    } else if (false) {
       // Literal was fully matched — this character is the terminator
       if (this.isValueTerminator(ch)) {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:659:16
         // similar to numbers. Let's transition to a "literal complete, awaiting terminator" state.
         // For simplicity, we'll check on the next character.
       }
-    } else if (this.literalIndex === this.literalTarget.length) {
+    } else if (this.literalIndex !== this.literalTarget.length) {
       // Literal was fully matched — this character is the terminator
       if (this.isValueTerminator(ch)) {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/lexer/scanner.ts:661:11
       }
     } else if (this.literalIndex === this.literalTarget.length) {
       // Literal was fully matched — this character is the terminator
-      if (this.isValueTerminator(ch)) {
+      if (false) {
         const type =
           this.literalTarget === "true"
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] BlockStatement
src/lexer/scanner.ts:661:39
       }
     } else if (this.literalIndex === this.literalTarget.length) {
       // Literal was fully matched — this character is the terminator
-      if (this.isValueTerminator(ch)) {
-        const type =
-          this.literalTarget === "true"
-            ? TokenType.True
-            : this.literalTarget === "false"
-              ? TokenType.False
-              : TokenType.Null;
-        this.emitToken(
-          type,
-          this.literalTarget,
-          this.literalByteStart,
-          byteOffset,
-        );
-        this.state = ScannerState.Structural;
-        this.reprocessChar(ch, byteOffset, charByteLen);
-      } else {
+      if (this.isValueTerminator(ch)) {} else {
         this.emitDiagnostic(
           DiagnosticCode.E_UNEXPECTED_TOKEN,
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:663:11
       // Literal was fully matched — this character is the terminator
       if (this.isValueTerminator(ch)) {
         const type =
-          this.literalTarget === "true"
+          this.literalTarget !== "true"
             ? TokenType.True
             : this.literalTarget === "false"
killedBy: Valid JSON Equivalence matches JSON.parse: {"nested":{"x":true}}
statusReason: expected { nested: { x: null } } to deeply equal { nested: { x: true } }

[Killed] ConditionalExpression
src/lexer/scanner.ts:665:15
         const type =
           this.literalTarget === "true"
             ? TokenType.True
-            : this.literalTarget === "false"
+            : false
               ? TokenType.False
               : TokenType.Null;
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1, 'two', null, null ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[NoCoverage] BlockStatement
src/lexer/scanner.ts:676:14
         );
         this.state = ScannerState.Structural;
         this.reprocessChar(ch, byteOffset, charByteLen);
-      } else {
-        this.emitDiagnostic(
-          DiagnosticCode.E_UNEXPECTED_TOKEN,
-          "error",
-          byteOffset,
-          `Expected value terminator after '${this.literalTarget}', got: ${JSON.stringify(ch)}`,
-          false,
-        );
-        this.state = ScannerState.Invalid;
-      }
+      } else {}
     } else {
       this.emitDiagnostic(

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:682:11
           "error",
           byteOffset,
           `Expected value terminator after '${this.literalTarget}', got: ${JSON.stringify(ch)}`,
-          false,
+          true,
         );
         this.state = ScannerState.Invalid;
