[Killed] BlockStatement
src/lexer/scanner.ts:686:12
         );
         this.state = ScannerState.Invalid;
       }
-    } else {
-      this.emitDiagnostic(
-        DiagnosticCode.E_UNEXPECTED_TOKEN,
-        "error",
-        byteOffset,
-        `Invalid literal: expected '${this.literalTarget[this.literalIndex]}' but got '${ch}' (parsing '${this.literalTarget}')`,
-        false,
-      );
-      this.state = ScannerState.Invalid;
-    }
+    } else {}
   }
 
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases rejects invalid literal sequence
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Survived] StringLiteral
src/lexer/scanner.ts:691:9
         DiagnosticCode.E_UNEXPECTED_TOKEN,
         "error",
         byteOffset,
-        `Invalid literal: expected '${this.literalTarget[this.literalIndex]}' but got '${ch}' (parsing '${this.literalTarget}')`,
+        ``,
         false,
       );

[Killed] BooleanLiteral
src/lexer/scanner.ts:692:9
         "error",
         byteOffset,
         `Invalid literal: expected '${this.literalTarget[this.literalIndex]}' but got '${ch}' (parsing '${this.literalTarget}')`,
-        false,
+        true,
       );
       this.state = ScannerState.Invalid;
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases rejects invalid literal sequence
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[NoCoverage] BlockStatement
src/lexer/scanner.ts:698:75
     }
   }
 
-  private processTrailingWhitespace(ch: string, byteOffset: number): void {
-    if (isWhitespace(ch)) return;
-
-    // Non-whitespace after root value
-    this.emitDiagnostic(
-      DiagnosticCode.E_TRAILING_DATA,
-      "error",
-      byteOffset,
-      `Unexpected data after root JSON value: ${JSON.stringify(ch)}`,
-      false,
-    );
-    this.state = ScannerState.TrailingData;
-  }
+  private processTrailingWhitespace(ch: string, byteOffset: number): void {}
 
   // -----------------------------------------------------------------------

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:699:9
   }
 
   private processTrailingWhitespace(ch: string, byteOffset: number): void {
-    if (isWhitespace(ch)) return;
+    if (true) return;
 
     // Non-whitespace after root value

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:699:9
   }
 
   private processTrailingWhitespace(ch: string, byteOffset: number): void {
-    if (isWhitespace(ch)) return;
+    if (false) return;
 
     // Non-whitespace after root value

[NoCoverage] BooleanLiteral
src/lexer/scanner.ts:707:7
       "error",
       byteOffset,
       `Unexpected data after root JSON value: ${JSON.stringify(ch)}`,
-      false,
+      true,
     );
     this.state = ScannerState.TrailingData;

[Killed] BlockStatement
src/lexer/scanner.ts:716:49
   // Helpers
   // -----------------------------------------------------------------------
 
-  private beginString(byteOffset: number): void {
-    this.stringBuffer = "";
-    this.stringByteStart = byteOffset;
-    this.stringIsKey = this.nextStringIsKey;
-    this.nextStringIsKey = false;
-    this.highSurrogate = 0;
-    this.state = ScannerState.InString;
-  }
+  private beginString(byteOffset: number): void {}
 
   private beginNumber(firstChar: string, byteOffset: number): void {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/lexer/scanner.ts:720:28
     this.stringBuffer = "";
     this.stringByteStart = byteOffset;
     this.stringIsKey = this.nextStringIsKey;
-    this.nextStringIsKey = false;
+    this.nextStringIsKey = true;
     this.highSurrogate = 0;
     this.state = ScannerState.InString;
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string value with byteOffset of opening quote
statusReason: expected { type: 'object_key', …(3) } to deeply equal { type: 'string', path: '/key', …(2) }

[Killed] BlockStatement
src/lexer/scanner.ts:725:68
     this.state = ScannerState.InString;
   }
 
-  private beginNumber(firstChar: string, byteOffset: number): void {
-    this.numberBuffer = firstChar;
-    this.numberByteStart = byteOffset;
-    this.numberHasDigit = firstChar !== "-";
-    this.state = ScannerState.NumberInteger;
-  }
+  private beginNumber(firstChar: string, byteOffset: number): void {}
 
   private beginLiteral(target: string, byteOffset: number): void {
killedBy: Event Monotonicity array element events use sequential indices
statusReason: Expected value to be defined

[Killed] ConditionalExpression
src/lexer/scanner.ts:728:27
   private beginNumber(firstChar: string, byteOffset: number): void {
     this.numberBuffer = firstChar;
     this.numberByteStart = byteOffset;
-    this.numberHasDigit = firstChar !== "-";
+    this.numberHasDigit = false;
     this.state = ScannerState.NumberInteger;
   }
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/lexer/scanner.ts:728:27
   private beginNumber(firstChar: string, byteOffset: number): void {
     this.numberBuffer = firstChar;
     this.numberByteStart = byteOffset;
-    this.numberHasDigit = firstChar !== "-";
+    this.numberHasDigit = firstChar === "-";
     this.state = ScannerState.NumberInteger;
   }
killedBy: Mutation Killer — Byte Range Accuracy accurately reports byteRange for ObjectStart, ObjectEnd, Comma, Colon and Numbers
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/lexer/scanner.ts:732:66
     this.state = ScannerState.NumberInteger;
   }
 
-  private beginLiteral(target: string, byteOffset: number): void {
-    this.literalTarget = target;
-    this.literalIndex = 1; // first char already matched
-    this.literalByteStart = byteOffset;
-    if (target === "true") {
-      this.state = ScannerState.LiteralTrue;
-    } else if (target === "false") {
-      this.state = ScannerState.LiteralFalse;
-    } else {
-      this.state = ScannerState.LiteralNull;
-    }
-  }
+  private beginLiteral(target: string, byteOffset: number): void {}
 
   private commitNumber(endByteOffset: number): void {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending true literal
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/lexer/scanner.ts:736:28
     this.literalTarget = target;
     this.literalIndex = 1; // first char already matched
     this.literalByteStart = byteOffset;
-    if (target === "true") {
-      this.state = ScannerState.LiteralTrue;
-    } else if (target === "false") {
+    if (target === "true") {} else if (target === "false") {
       this.state = ScannerState.LiteralFalse;
     } else {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending true literal
statusReason: expected [] to have a length of 1 but got +0

[Survived] EqualityOperator
src/lexer/scanner.ts:736:9
     this.literalTarget = target;
     this.literalIndex = 1; // first char already matched
     this.literalByteStart = byteOffset;
-    if (target === "true") {
+    if (target !== "true") {
       this.state = ScannerState.LiteralTrue;
     } else if (target === "false") {

[Killed] BlockStatement
src/lexer/scanner.ts:738:36
     this.literalByteStart = byteOffset;
     if (target === "true") {
       this.state = ScannerState.LiteralTrue;
-    } else if (target === "false") {
-      this.state = ScannerState.LiteralFalse;
-    } else {
+    } else if (target === "false") {} else {
       this.state = ScannerState.LiteralNull;
     }
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1, 'two', null ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[Survived] ConditionalExpression
src/lexer/scanner.ts:738:16
     this.literalByteStart = byteOffset;
     if (target === "true") {
       this.state = ScannerState.LiteralTrue;
-    } else if (target === "false") {
+    } else if (true) {
       this.state = ScannerState.LiteralFalse;
     } else {

[Killed] BlockStatement
src/lexer/scanner.ts:740:12
       this.state = ScannerState.LiteralTrue;
     } else if (target === "false") {
       this.state = ScannerState.LiteralFalse;
-    } else {
-      this.state = ScannerState.LiteralNull;
-    }
+    } else {}
   }
 
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] BlockStatement
src/lexer/scanner.ts:745:53
     }
   }
 
-  private commitNumber(endByteOffset: number): void {
-    this.emitToken(
-      TokenType.Number,
-      this.numberBuffer,
-      this.numberByteStart,
-      endByteOffset,
-    );
-    this.numberBuffer = "";
-    this.state = ScannerState.Structural;
-  }
+  private commitNumber(endByteOffset: number): void {}
 
   private isValueTerminator(ch: string): boolean {
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 1 tests
{ seed: -280319606, path: "0:1:0:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"":0},[1]]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/lexer/scanner.ts:756:50
     this.state = ScannerState.Structural;
   }
 
-  private isValueTerminator(ch: string): boolean {
-    return (
-      isWhitespace(ch) ||
-      ch === "," ||
-      ch === "}" ||
-      ch === "]" ||
-      ch === ":"
-    );
-  }
+  private isValueTerminator(ch: string): boolean {}
 
   private reprocessChar(ch: string, byteOffset: number, charByteLen: number): void {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/lexer/scanner.ts:758:7
 
   private isValueTerminator(ch: string): boolean {
     return (
-      isWhitespace(ch) ||
-      ch === "," ||
-      ch === "}" ||
-      ch === "]" ||
-      ch === ":"
+      false
     );
   }
killedBy: Event Monotonicity array element events use sequential indices
statusReason: Expected value to be defined

[Killed] ConditionalExpression
src/lexer/scanner.ts:758:7
 
   private isValueTerminator(ch: string): boolean {
     return (
-      isWhitespace(ch) ||
-      ch === "," ||
-      ch === "}" ||
-      ch === "]" ||
+      false ||
       ch === ":"
     );
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] EqualityOperator
src/lexer/scanner.ts:759:7
   private isValueTerminator(ch: string): boolean {
     return (
       isWhitespace(ch) ||
-      ch === "," ||
+      ch !== "," ||
       ch === "}" ||
       ch === "]" ||
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/lexer/scanner.ts:759:7
   private isValueTerminator(ch: string): boolean {
     return (
       isWhitespace(ch) ||
-      ch === "," ||
+      false ||
       ch === "}" ||
       ch === "]" ||
killedBy: Valid JSON Equivalence matches JSON.parse: [1,2,3]
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
src/lexer/scanner.ts:760:7
     return (
       isWhitespace(ch) ||
       ch === "," ||
-      ch === "}" ||
+      ch !== "}" ||
       ch === "]" ||
       ch === ":"
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/lexer/scanner.ts:760:7
     return (
       isWhitespace(ch) ||
       ch === "," ||
-      ch === "}" ||
+      false ||
       ch === "]" ||
       ch === ":"
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] EqualityOperator
src/lexer/scanner.ts:761:7
       isWhitespace(ch) ||
       ch === "," ||
       ch === "}" ||
-      ch === "]" ||
+      ch !== "]" ||
       ch === ":"
     );
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/lexer/scanner.ts:761:7
       isWhitespace(ch) ||
       ch === "," ||
       ch === "}" ||
-      ch === "]" ||
+      false ||
       ch === ":"
     );
killedBy: Valid JSON Equivalence matches JSON.parse: [1,2,3]
statusReason: expected [ 1, 2 ] to deeply equal [ 1, 2, 3 ]

[NoCoverage] ConditionalExpression
src/lexer/scanner.ts:762:7
       ch === "," ||
       ch === "}" ||
       ch === "]" ||
-      ch === ":"
+      false
     );
   }

[NoCoverage] EqualityOperator
src/lexer/scanner.ts:762:7
       ch === "," ||
       ch === "}" ||
       ch === "]" ||
-      ch === ":"
+      ch !== ":"
     );
   }

[Killed] BlockStatement
src/lexer/scanner.ts:766:84
     );
   }
 
-  private reprocessChar(ch: string, byteOffset: number, charByteLen: number): void {
-    // After committing a number/literal, state has been set to Structural.
-    // Reprocess the terminating character in the new state.
-    this.feedChar(ch, byteOffset, charByteLen);
-  }
+  private reprocessChar(ch: string, byteOffset: number, charByteLen: number): void {}
 
   private emitToken(
killedBy: Event Monotonicity array element events use sequential indices
statusReason: Expected value to be defined

[Killed] BlockStatement
src/lexer/scanner.ts:777:11
     value: string,
     byteStart: number,
     byteEnd: number,
-  ): void {
-    this.tokens.push({ type, value, byteStart, byteEnd });
-  }
+  ): void {}
 
   private emitDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/lexer/scanner.ts:787:11
     byteOffset: number,
     message: string,
     recoverable: boolean,
-  ): void {
-    this.diagnostics.push(
-      createDiagnostic(code, severity, byteOffset, message, recoverable),
-    );
-  }
+  ): void {}
 }
 
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality
