[Killed] BlockStatement
src/parser.ts:41:78
 /**
  * Create a new IncrementalJsonParser.
  */
-export function createParser(options?: ParserOptions): IncrementalJsonParser {
-  return new Parser(options);
-}
+export function createParser(options?: ParserOptions): IncrementalJsonParser {}
 
 class Parser implements IncrementalJsonParser {
killedBy: Event Monotonicity committed events are never retracted across pushes
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
src/parser.ts:58:26
   private phase: "collecting" | "finished" = "collecting";
   private receivedBytes = 0;
   private consumedBytes = 0;
-  private rootComplete = false;
+  private rootComplete = true;
   private terminal = false;
   private hasSeenValue = false;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:59:22
   private receivedBytes = 0;
   private consumedBytes = 0;
   private rootComplete = false;
-  private terminal = false;
+  private terminal = true;
   private hasSeenValue = false;
   private syntax_: SyntaxStatus = "empty";
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Survived] BooleanLiteral
src/parser.ts:60:26
   private consumedBytes = 0;
   private rootComplete = false;
   private terminal = false;
-  private hasSeenValue = false;
+  private hasSeenValue = true;
   private syntax_: SyntaxStatus = "empty";
   private trailingDataSeen = false;

[Killed] BooleanLiteral
src/parser.ts:62:30
   private terminal = false;
   private hasSeenValue = false;
   private syntax_: SyntaxStatus = "empty";
-  private trailingDataSeen = false;
+  private trailingDataSeen = true;
   private trailingDataBytes = 0;
   private rootScalarValue: JsonValue | undefined = undefined;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:70:29
 
   // Track if we're in a duplicate-key value (to skip it)
   private skipValueDepth = 0;
-  private isSkippingValue = false;
+  private isSkippingValue = true;
 
   // For finish
killedBy: Parser push() accepts a string chunk
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/parser.ts:75:40
   // For finish
   private finishMeta: { reason?: StreamEndReason; providerReason?: string } | undefined;
 
-  constructor(options?: ParserOptions) {
-    const userLimits = options?.limits ?? {};
-    this.limits = {
-      maxInputBytes: userLimits.maxInputBytes ?? DEFAULT_LIMITS.maxInputBytes,
-      maxDepth: userLimits.maxDepth ?? DEFAULT_LIMITS.maxDepth,
-      maxStringBytes:
-        userLimits.maxStringBytes ?? DEFAULT_LIMITS.maxStringBytes,
-      maxQueuedEvents:
-        userLimits.maxQueuedEvents ?? DEFAULT_LIMITS.maxQueuedEvents,
-      maxTrailingDataBytes:
-        userLimits.maxTrailingDataBytes ?? DEFAULT_LIMITS.maxTrailingDataBytes,
-    };
-    
-    this.repairs = {
-      rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
-      trailingData: options?.repairs?.trailingData ?? "isolate",
-      closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
-    };
-
-    this.utf8 = new Utf8Decoder();
-    this.scanner = new Scanner(options);
-    this.grammar = new GrammarStack(this.limits.maxDepth);
-    this.events = new EventBuilder(this.limits.maxQueuedEvents);
-    this.snapshot_ = new SnapshotBuilder();
-  }
+  constructor(options?: ParserOptions) {}
 
   push(chunk: string | Uint8Array): PushResult {
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: Cannot read properties of undefined (reading 'maxInputBytes')

[Killed] OptionalChaining
src/parser.ts:76:24
   private finishMeta: { reason?: StreamEndReason; providerReason?: string } | undefined;
 
   constructor(options?: ParserOptions) {
-    const userLimits = options?.limits ?? {};
+    const userLimits = options.limits ?? {};
     this.limits = {
       maxInputBytes: userLimits.maxInputBytes ?? DEFAULT_LIMITS.maxInputBytes,
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: Cannot read properties of undefined (reading 'limits')

[Killed] LogicalOperator
src/parser.ts:76:24
   private finishMeta: { reason?: StreamEndReason; providerReason?: string } | undefined;
 
   constructor(options?: ParserOptions) {
-    const userLimits = options?.limits ?? {};
+    const userLimits = options?.limits && {};
     this.limits = {
       maxInputBytes: userLimits.maxInputBytes ?? DEFAULT_LIMITS.maxInputBytes,
killedBy: Parser push() accepts a string chunk
statusReason: Cannot read properties of undefined (reading 'maxInputBytes')

[Survived] LogicalOperator
src/parser.ts:78:22
   constructor(options?: ParserOptions) {
     const userLimits = options?.limits ?? {};
     this.limits = {
-      maxInputBytes: userLimits.maxInputBytes ?? DEFAULT_LIMITS.maxInputBytes,
+      maxInputBytes: userLimits.maxInputBytes && DEFAULT_LIMITS.maxInputBytes,
       maxDepth: userLimits.maxDepth ?? DEFAULT_LIMITS.maxDepth,
       maxStringBytes:

[Killed] LogicalOperator
src/parser.ts:79:17
     const userLimits = options?.limits ?? {};
     this.limits = {
       maxInputBytes: userLimits.maxInputBytes ?? DEFAULT_LIMITS.maxInputBytes,
-      maxDepth: userLimits.maxDepth ?? DEFAULT_LIMITS.maxDepth,
+      maxDepth: userLimits.maxDepth && DEFAULT_LIMITS.maxDepth,
       maxStringBytes:
         userLimits.maxStringBytes ?? DEFAULT_LIMITS.maxStringBytes,
killedBy: Parser resource limits rejects depth exceeding maxDepth
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/parser.ts:81:9
       maxInputBytes: userLimits.maxInputBytes ?? DEFAULT_LIMITS.maxInputBytes,
       maxDepth: userLimits.maxDepth ?? DEFAULT_LIMITS.maxDepth,
       maxStringBytes:
-        userLimits.maxStringBytes ?? DEFAULT_LIMITS.maxStringBytes,
+        userLimits.maxStringBytes && DEFAULT_LIMITS.maxStringBytes,
       maxQueuedEvents:
         userLimits.maxQueuedEvents ?? DEFAULT_LIMITS.maxQueuedEvents,

[Survived] LogicalOperator
src/parser.ts:83:9
       maxStringBytes:
         userLimits.maxStringBytes ?? DEFAULT_LIMITS.maxStringBytes,
       maxQueuedEvents:
-        userLimits.maxQueuedEvents ?? DEFAULT_LIMITS.maxQueuedEvents,
+        userLimits.maxQueuedEvents && DEFAULT_LIMITS.maxQueuedEvents,
       maxTrailingDataBytes:
         userLimits.maxTrailingDataBytes ?? DEFAULT_LIMITS.maxTrailingDataBytes,

[Survived] LogicalOperator
src/parser.ts:85:9
       maxQueuedEvents:
         userLimits.maxQueuedEvents ?? DEFAULT_LIMITS.maxQueuedEvents,
       maxTrailingDataBytes:
-        userLimits.maxTrailingDataBytes ?? DEFAULT_LIMITS.maxTrailingDataBytes,
+        userLimits.maxTrailingDataBytes && DEFAULT_LIMITS.maxTrailingDataBytes,
     };
     

[Killed] ObjectLiteral
src/parser.ts:88:20
         userLimits.maxTrailingDataBytes ?? DEFAULT_LIMITS.maxTrailingDataBytes,
     };
     
-    this.repairs = {
-      rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
-      trailingData: options?.repairs?.trailingData ?? "isolate",
-      closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
-    };
+    this.repairs = {};
 
     this.utf8 = new Utf8Decoder();
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Killed] OptionalChaining
src/parser.ts:89:29
     };
     
     this.repairs = {
-      rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
+      rawControlCharacters: options?.repairs.rawControlCharacters ?? "reject",
       trailingData: options?.repairs?.trailingData ?? "isolate",
       closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
killedBy: Parser resource limits rejects input exceeding maxInputBytes
statusReason: Cannot read properties of undefined (reading 'rawControlCharacters')

[Killed] OptionalChaining
src/parser.ts:89:29
     };
     
     this.repairs = {
-      rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
+      rawControlCharacters: options.repairs?.rawControlCharacters ?? "reject",
       trailingData: options?.repairs?.trailingData ?? "isolate",
       closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: Cannot read properties of undefined (reading 'repairs')

[Killed] OptionalChaining
src/parser.ts:90:21
     
     this.repairs = {
       rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
-      trailingData: options?.repairs?.trailingData ?? "isolate",
+      trailingData: options.repairs?.trailingData ?? "isolate",
       closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
     };
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 1 tests
{ seed: 182938548, path: "0:0:0", endOnFailure: true }
Counterexample: [[],[1]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] OptionalChaining
src/parser.ts:90:21
     
     this.repairs = {
       rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
-      trailingData: options?.repairs?.trailingData ?? "isolate",
+      trailingData: options?.repairs.trailingData ?? "isolate",
       closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
     };
killedBy: Parser resource limits rejects input exceeding maxInputBytes
statusReason: Cannot read properties of undefined (reading 'trailingData')

[Killed] LogicalOperator
src/parser.ts:91:32
     this.repairs = {
       rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
       trailingData: options?.repairs?.trailingData ?? "isolate",
-      closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
+      closeContainersAtFinish: options?.repairs?.closeContainersAtFinish && "disabled",
     };
 
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Killed] OptionalChaining
src/parser.ts:91:32
     this.repairs = {
       rawControlCharacters: options?.repairs?.rawControlCharacters ?? "reject",
       trailingData: options?.repairs?.trailingData ?? "isolate",
-      closeContainersAtFinish: options?.repairs?.closeContainersAtFinish ?? "disabled",
+      closeContainersAtFinish: options.repairs?.closeContainersAtFinish ?? "disabled",
     };
 
killedBy: Parser push() accepts a string chunk
statusReason: Cannot read properties of undefined (reading 'repairs')

[Killed] BlockStatement
src/parser.ts:102:36
   }
 
   push(chunk: string | Uint8Array): PushResult {
-    if (this.phase === "finished") {
-      throw new Error("E_PUSH_AFTER_FINISH: push() called after finish()");
-    }
+    if (this.phase === "finished") {}
 
     if (this.terminal) {
killedBy: Parser push() throws after finish()
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/parser.ts:102:9
   }
 
   push(chunk: string | Uint8Array): PushResult {
-    if (this.phase === "finished") {
+    if (false) {
       throw new Error("E_PUSH_AFTER_FINISH: push() called after finish()");
     }
killedBy: Parser push() throws after finish()
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/parser.ts:103:23
 
   push(chunk: string | Uint8Array): PushResult {
     if (this.phase === "finished") {
-      throw new Error("E_PUSH_AFTER_FINISH: push() called after finish()");
+      throw new Error("");
     }
 
killedBy: Parser push() throws after finish()
statusReason: expected [Function] to throw error including 'E_PUSH_AFTER_FINISH' but got ''

[Killed] ConditionalExpression
src/parser.ts:106:9
       throw new Error("E_PUSH_AFTER_FINISH: push() called after finish()");
     }
 
-    if (this.terminal) {
+    if (true) {
       return {
         acceptedBytes: 0,
killedBy: Parser push() accepts a string chunk
statusReason: expected 0 to be greater than 0

[NoCoverage] BlockStatement
src/parser.ts:106:24
       throw new Error("E_PUSH_AFTER_FINISH: push() called after finish()");
     }
 
-    if (this.terminal) {
-      return {
-        acceptedBytes: 0,
-        emittedEvents: 0,
-        syntax: this.syntax_,
-        terminal: true,
-      };
-    }
+    if (this.terminal) {}
 
     // Convert string to bytes

[NoCoverage] BooleanLiteral
src/parser.ts:111:19
         acceptedBytes: 0,
         emittedEvents: 0,
         syntax: this.syntax_,
-        terminal: true,
+        terminal: false,
       };
     }

[Killed] ConditionalExpression
src/parser.ts:117:7
 
     // Convert string to bytes
     const bytes =
-      typeof chunk === "string" ? stringToUtf8(chunk) : chunk;
+      true ? stringToUtf8(chunk) : chunk;
 
     // Check input limit
killedBy: Parser push() accepts a Uint8Array chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:117:7
 
     // Convert string to bytes
     const bytes =
-      typeof chunk === "string" ? stringToUtf8(chunk) : chunk;
+      false ? stringToUtf8(chunk) : chunk;
 
     // Check input limit
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:120:9
       typeof chunk === "string" ? stringToUtf8(chunk) : chunk;
 
     // Check input limit
-    if (this.receivedBytes + bytes.length > this.limits.maxInputBytes) {
+    if (this.receivedBytes + bytes.length <= this.limits.maxInputBytes) {
       const diag = createDiagnostic(
         DiagnosticCode.E_LIMIT_INPUT_BYTES,
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:120:9
       typeof chunk === "string" ? stringToUtf8(chunk) : chunk;
 
     // Check input limit
-    if (this.receivedBytes + bytes.length > this.limits.maxInputBytes) {
+    if (true) {
       const diag = createDiagnostic(
         DiagnosticCode.E_LIMIT_INPUT_BYTES,
killedBy: Parser push() accepts a string chunk
statusReason: expected 0 to be greater than 0

[Survived] BooleanLiteral
src/parser.ts:126:9
         "fatal",
         this.receivedBytes,
         `Input exceeds maximum of ${this.limits.maxInputBytes} bytes`,
-        false,
+        true,
       );
       this.addDiagnostic(diag);

[Survived] BooleanLiteral
src/parser.ts:129:23
         false,
       );
       this.addDiagnostic(diag);
-      this.terminal = true;
+      this.terminal = false;
       this.syntax_ = "invalid";
       return {

[Killed] StringLiteral
src/parser.ts:130:22
       );
       this.addDiagnostic(diag);
       this.terminal = true;
-      this.syntax_ = "invalid";
+      this.syntax_ = "";
       return {
         acceptedBytes: 0,
killedBy: Parser resource limits rejects input exceeding maxInputBytes
statusReason: expected '' to be 'invalid' // Object.is equality

[Killed] ObjectLiteral
src/parser.ts:131:14
       this.addDiagnostic(diag);
       this.terminal = true;
       this.syntax_ = "invalid";
-      return {
-        acceptedBytes: 0,
-        emittedEvents: 0,
-        syntax: this.syntax_,
-        terminal: true,
-      };
+      return {};
     }
 
killedBy: Parser resource limits rejects input exceeding maxInputBytes
statusReason: expected undefined to be true // Object.is equality

[Survived] AssignmentOperator
src/parser.ts:139:5
       };
     }
 
-    this.receivedBytes += bytes.length;
+    this.receivedBytes -= bytes.length;
     this.events.resetPushCount();
 

[Killed] ConditionalExpression
src/parser.ts:145:9
     // Decode UTF-8
     const decoded = this.utf8.decode(bytes);
     
-    if (decoded.strippedBom) {
+    if (true) {
        const repair: RepairAction = {
          code: "R_STRIP_UTF8_BOM",
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected [ { code: 'R_STRIP_UTF8_BOM', …(3) } ] to have a length of +0 but got 1

[Survived] ConditionalExpression
src/parser.ts:145:9
     // Decode UTF-8
     const decoded = this.utf8.decode(bytes);
     
-    if (decoded.strippedBom) {
+    if (false) {
        const repair: RepairAction = {
          code: "R_STRIP_UTF8_BOM",

[NoCoverage] ConditionalExpression
src/parser.ts:159:9
     // Handle UTF-8 errors
     for (const err of decoded.errors) {
       const code =
-        err.kind === "overlong"
+        true
           ? DiagnosticCode.E_INVALID_UTF8
           : err.kind === "out_of_range"

[NoCoverage] ConditionalExpression
src/parser.ts:159:9
     // Handle UTF-8 errors
     for (const err of decoded.errors) {
       const code =
-        err.kind === "overlong"
+        false
           ? DiagnosticCode.E_INVALID_UTF8
           : err.kind === "out_of_range"

[NoCoverage] EqualityOperator
src/parser.ts:161:13
       const code =
         err.kind === "overlong"
           ? DiagnosticCode.E_INVALID_UTF8
-          : err.kind === "out_of_range"
+          : err.kind !== "out_of_range"
             ? DiagnosticCode.E_INVALID_UTF8
             : err.kind === "invalid_start_byte"

[NoCoverage] ConditionalExpression
src/parser.ts:161:13
       const code =
         err.kind === "overlong"
           ? DiagnosticCode.E_INVALID_UTF8
-          : err.kind === "out_of_range"
+          : false
             ? DiagnosticCode.E_INVALID_UTF8
             : err.kind === "invalid_start_byte"

[NoCoverage] ConditionalExpression
src/parser.ts:163:15
           ? DiagnosticCode.E_INVALID_UTF8
           : err.kind === "out_of_range"
             ? DiagnosticCode.E_INVALID_UTF8
-            : err.kind === "invalid_start_byte"
+            : false
               ? DiagnosticCode.E_INVALID_UTF8
               : DiagnosticCode.E_INVALID_UTF8;

[NoCoverage] ConditionalExpression
src/parser.ts:163:15
           ? DiagnosticCode.E_INVALID_UTF8
           : err.kind === "out_of_range"
             ? DiagnosticCode.E_INVALID_UTF8
-            : err.kind === "invalid_start_byte"
+            : true
               ? DiagnosticCode.E_INVALID_UTF8
               : DiagnosticCode.E_INVALID_UTF8;

[NoCoverage] StringLiteral
src/parser.ts:168:9
               : DiagnosticCode.E_INVALID_UTF8;
       const diag = createDiagnostic(
         code,
-        "error",
+        "",
         err.byteOffset,
         `Invalid UTF-8: ${err.kind} at byte ${err.byteOffset}`,

[NoCoverage] BooleanLiteral
src/parser.ts:171:9
         "error",
         err.byteOffset,
         `Invalid UTF-8: ${err.kind} at byte ${err.byteOffset}`,
-        false,
+        true,
       );
       this.addDiagnostic(diag);

[NoCoverage] BooleanLiteral
src/parser.ts:175:23
       );
       this.addDiagnostic(diag);
       this.syntax_ = "invalid";
-      this.terminal = true;
+      this.terminal = false;
       return {
         acceptedBytes: decoded.consumed,

[Killed] ConditionalExpression
src/parser.ts:190:11
     let bytePos = this.consumedBytes;
 
     for (const ch of text) {
-      if (this.terminal) break;
+      if (true) break;
 
       const charBytes = getUtf8ByteLength(ch);
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:190:11
     let bytePos = this.consumedBytes;
 
     for (const ch of text) {
-      if (this.terminal) break;
+      if (false) break;
 
       const charBytes = getUtf8ByteLength(ch);

[Killed] ConditionalExpression
src/parser.ts:195:11
       const charBytes = getUtf8ByteLength(ch);
 
       // If root is already complete, handle trailing content at parser level
-      if (this.rootComplete) {
+      if (false) {
         const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
         if (!isWs) {
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:195:11
       const charBytes = getUtf8ByteLength(ch);
 
       // If root is already complete, handle trailing content at parser level
-      if (this.rootComplete) {
+      if (true) {
         const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
         if (!isWs) {
killedBy: Parser push() accepts a string chunk
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:196:22
 
       // If root is already complete, handle trailing content at parser level
       if (this.rootComplete) {
-        const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
+        const isWs = true;
         if (!isWs) {
           if (!this.trailingDataSeen) {
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/parser.ts:196:22
 
       // If root is already complete, handle trailing content at parser level
       if (this.rootComplete) {
-        const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
+        const isWs = ch !== " " || ch === "\t" || ch === "\n" || ch === "\r";
         if (!isWs) {
           if (!this.trailingDataSeen) {
killedBy: Parser trailing data accepts trailing whitespace
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:197:13
       // If root is already complete, handle trailing content at parser level
       if (this.rootComplete) {
         const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
-        if (!isWs) {
+        if (false) {
           if (!this.trailingDataSeen) {
             this.trailingDataSeen = true;
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:197:13
       // If root is already complete, handle trailing content at parser level
       if (this.rootComplete) {
         const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
-        if (!isWs) {
+        if (isWs) {
           if (!this.trailingDataSeen) {
             this.trailingDataSeen = true;
killedBy: Parser trailing data accepts trailing whitespace
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:198:15
       if (this.rootComplete) {
         const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
         if (!isWs) {
-          if (!this.trailingDataSeen) {
+          if (false) {
             this.trailingDataSeen = true;
             if (this.repairs.trailingData === "reject") {
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:198:15
       if (this.rootComplete) {
         const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
         if (!isWs) {
-          if (!this.trailingDataSeen) {
+          if (this.trailingDataSeen) {
             this.trailingDataSeen = true;
             if (this.repairs.trailingData === "reject") {
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:199:37
         const isWs = ch === " " || ch === "\t" || ch === "\n" || ch === "\r";
         if (!isWs) {
           if (!this.trailingDataSeen) {
-            this.trailingDataSeen = true;
+            this.trailingDataSeen = false;
             if (this.repairs.trailingData === "reject") {
               this.addDiagnostic(createDiagnostic(DiagnosticCode.E_TRAILING_DATA, "error", bytePos, `Trailing data rejected`, false));
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:200:17
         if (!isWs) {
           if (!this.trailingDataSeen) {
             this.trailingDataSeen = true;
-            if (this.repairs.trailingData === "reject") {
+            if (true) {
               this.addDiagnostic(createDiagnostic(DiagnosticCode.E_TRAILING_DATA, "error", bytePos, `Trailing data rejected`, false));
               this.syntax_ = "invalid";
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:200:17
         if (!isWs) {
           if (!this.trailingDataSeen) {
             this.trailingDataSeen = true;
-            if (this.repairs.trailingData === "reject") {
+            if (this.repairs.trailingData !== "reject") {
               this.addDiagnostic(createDiagnostic(DiagnosticCode.E_TRAILING_DATA, "error", bytePos, `Trailing data rejected`, false));
               this.syntax_ = "invalid";
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[NoCoverage] BooleanLiteral
src/parser.ts:201:127
           if (!this.trailingDataSeen) {
             this.trailingDataSeen = true;
             if (this.repairs.trailingData === "reject") {
-              this.addDiagnostic(createDiagnostic(DiagnosticCode.E_TRAILING_DATA, "error", bytePos, `Trailing data rejected`, false));
+              this.addDiagnostic(createDiagnostic(DiagnosticCode.E_TRAILING_DATA, "error", bytePos, `Trailing data rejected`, true));
               this.syntax_ = "invalid";
               this.terminal = true;

[NoCoverage] StringLiteral
src/parser.ts:202:30
             this.trailingDataSeen = true;
             if (this.repairs.trailingData === "reject") {
               this.addDiagnostic(createDiagnostic(DiagnosticCode.E_TRAILING_DATA, "error", bytePos, `Trailing data rejected`, false));
-              this.syntax_ = "invalid";
+              this.syntax_ = "";
               this.terminal = true;
               return {

[Survived] StringLiteral
src/parser.ts:217:17
                 DiagnosticCode.E_TRAILING_DATA,
                 "warning",
                 bytePos,
-                `Unexpected data after root JSON value`,
+                ``,
                 true,
               ),

[Survived] BooleanLiteral
src/parser.ts:218:17
                 "warning",
                 bytePos,
                 `Unexpected data after root JSON value`,
-                true,
+                false,
               ),
             );

[Survived] ObjectLiteral
src/parser.ts:221:42
                 true,
               ),
             );
-            const repair: RepairAction = {
-              code: "R_ISOLATE_TRAILING_DATA",
-              byteRange: [bytePos, bytePos + charBytes],
-              impact: "root_preserving",
-              description: "Isolated trailing data after complete JSON root",
-            };
+            const repair: RepairAction = {};
             this.allRepairs.push(repair);
             this.events.emitRepairApplied(repair);

[Survived] ArithmeticOperator
src/parser.ts:223:36
             );
             const repair: RepairAction = {
               code: "R_ISOLATE_TRAILING_DATA",
-              byteRange: [bytePos, bytePos + charBytes],
+              byteRange: [bytePos, bytePos - charBytes],
               impact: "root_preserving",
               description: "Isolated trailing data after complete JSON root",

[Survived] StringLiteral
src/parser.ts:224:23
             const repair: RepairAction = {
               code: "R_ISOLATE_TRAILING_DATA",
               byteRange: [bytePos, bytePos + charBytes],
-              impact: "root_preserving",
+              impact: "",
               description: "Isolated trailing data after complete JSON root",
             };

[Survived] AssignmentOperator
src/parser.ts:231:11
             this.events.emitRepairApplied(repair);
           }
           
-          this.trailingDataBytes += charBytes;
+          this.trailingDataBytes -= charBytes;
           if (this.trailingDataBytes > this.limits.maxTrailingDataBytes) {
              this.addDiagnostic(

[Killed] EqualityOperator
src/parser.ts:232:15
           }
           
           this.trailingDataBytes += charBytes;
-          if (this.trailingDataBytes > this.limits.maxTrailingDataBytes) {
+          if (this.trailingDataBytes <= this.limits.maxTrailingDataBytes) {
              this.addDiagnostic(
                 createDiagnostic(
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:232:15
           }
           
           this.trailingDataBytes += charBytes;
-          if (this.trailingDataBytes > this.limits.maxTrailingDataBytes) {
+          if (true) {
              this.addDiagnostic(
                 createDiagnostic(
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected 'invalid' to be 'valid' // Object.is equality
