[NoCoverage] StringLiteral
src/parser.ts:236:19
              this.addDiagnostic(
                 createDiagnostic(
                   DiagnosticCode.E_LIMIT_INPUT_BYTES,
-                  "error",
+                  "",
                   bytePos,
                   `Maximum trailing data bytes exceeded`,

[NoCoverage] BooleanLiteral
src/parser.ts:239:19
                   "error",
                   bytePos,
                   `Maximum trailing data bytes exceeded`,
-                  false,
+                  true,
                 ),
               );

[NoCoverage] StringLiteral
src/parser.ts:242:30
                   false,
                 ),
               );
-              this.syntax_ = "invalid";
+              this.syntax_ = "";
               this.terminal = true;
           }

[Survived] AssignmentOperator
src/parser.ts:246:9
               this.terminal = true;
           }
         }
-        bytePos += charBytes;
+        bytePos -= charBytes;
         continue;
       }

[Killed] ConditionalExpression
src/parser.ts:253:9
       // Set up scanner for object key context
       const frame = this.grammar.current;
       if (
-        frame &&
-        frame.containerType === "object" &&
+        true &&
         (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
         this.scanner.currentState === ScannerState.Structural
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 1 tests
{ seed: -1206052737, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{},[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/parser.ts:253:9
       // Set up scanner for object key context
       const frame = this.grammar.current;
       if (
-        frame &&
-        frame.containerType === "object" &&
-        (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
+        true &&
         this.scanner.currentState === ScannerState.Structural
       ) {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string value with byteOffset of opening quote
statusReason: expected { type: 'object_key', …(3) } to deeply equal { type: 'string', path: '/key', …(2) }

[Killed] EqualityOperator
src/parser.ts:254:9
       const frame = this.grammar.current;
       if (
         frame &&
-        frame.containerType === "object" &&
+        frame.containerType !== "object" &&
         (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
         this.scanner.currentState === ScannerState.Structural
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Survived] ConditionalExpression
src/parser.ts:254:9
       const frame = this.grammar.current;
       if (
         frame &&
-        frame.containerType === "object" &&
+        true &&
         (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
         this.scanner.currentState === ScannerState.Structural

[Killed] LogicalOperator
src/parser.ts:255:10
       if (
         frame &&
         frame.containerType === "object" &&
-        (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
+        (frame.objectExpectation === "first_key_or_end" && frame.objectExpectation === "key_after_comma") &&
         this.scanner.currentState === ScannerState.Structural
       ) {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] EqualityOperator
src/parser.ts:255:60
       if (
         frame &&
         frame.containerType === "object" &&
-        (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
+        (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation !== "key_after_comma") &&
         this.scanner.currentState === ScannerState.Structural
       ) {
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string value with byteOffset of opening quote
statusReason: expected { type: 'object_key', …(3) } to deeply equal { type: 'string', path: '/key', …(2) }

[Killed] EqualityOperator
src/parser.ts:256:9
         frame &&
         frame.containerType === "object" &&
         (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
-        this.scanner.currentState === ScannerState.Structural
+        this.scanner.currentState !== ScannerState.Structural
       ) {
         this.scanner.setNextStringIsKey(true);
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] ConditionalExpression
src/parser.ts:256:9
         frame &&
         frame.containerType === "object" &&
         (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
-        this.scanner.currentState === ScannerState.Structural
+        true
       ) {
         this.scanner.setNextStringIsKey(true);
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string value with byteOffset of opening quote
statusReason: expected { type: 'object_key', …(3) } to deeply equal { type: 'string', path: '/key', …(2) }

[Killed] BlockStatement
src/parser.ts:257:9
         frame.containerType === "object" &&
         (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
         this.scanner.currentState === ScannerState.Structural
-      ) {
-        this.scanner.setNextStringIsKey(true);
-      }
+      ) {}
 
       this.scanner.feedChar(ch, bytePos, charBytes);
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] BooleanLiteral
src/parser.ts:258:41
         (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
         this.scanner.currentState === ScannerState.Structural
       ) {
-        this.scanner.setNextStringIsKey(true);
+        this.scanner.setNextStringIsKey(false);
       }
 
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] BlockStatement
src/parser.ts:265:35
 
       // Process any emitted tokens
       const tokens = this.scanner.takeTokens();
-      for (const token of tokens) {
-        if (this.terminal) break;
-        this.processToken(token);
-      }
+      for (const token of tokens) {}
 
       // Process any scanner diagnostics and repairs
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] ConditionalExpression
src/parser.ts:266:13
       // Process any emitted tokens
       const tokens = this.scanner.takeTokens();
       for (const token of tokens) {
-        if (this.terminal) break;
+        if (true) break;
         this.processToken(token);
       }
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'string', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] ConditionalExpression
src/parser.ts:266:13
       // Process any emitted tokens
       const tokens = this.scanner.takeTokens();
       for (const token of tokens) {
-        if (this.terminal) break;
+        if (false) break;
         this.processToken(token);
       }
killedBy: Parser Regressions rejects invalid input: [1 2]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[NoCoverage] BlockStatement
src/parser.ts:274:41
       const scanDiags = this.scanner.takeDiagnostics();
       const scanRepairs = this.scanner.takeRepairs();
       
-      for (const repair of scanRepairs) {
-        this.allRepairs.push(repair);
-        this.events.emitRepairApplied(repair);
-      }
+      for (const repair of scanRepairs) {}
       
       for (const diag of scanDiags) {

[Killed] BlockStatement
src/parser.ts:279:37
         this.events.emitRepairApplied(repair);
       }
       
-      for (const diag of scanDiags) {
-        this.addDiagnostic(diag);
-        if (
-          diag.severity === "fatal" ||
-          (diag.severity === "error" && !diag.recoverable)
-        ) {
-          this.syntax_ = "invalid";
-          this.terminal = true;
-        }
-      }
+      for (const diag of scanDiags) {}
 
       // After processing tokens, check if rootComplete was just set
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases rejects invalid literal sequence
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:282:11
       for (const diag of scanDiags) {
         this.addDiagnostic(diag);
         if (
-          diag.severity === "fatal" ||
-          (diag.severity === "error" && !diag.recoverable)
+          false
         ) {
           this.syntax_ = "invalid";
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases rejects invalid literal sequence
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Killed] LogicalOperator
src/parser.ts:282:11
       for (const diag of scanDiags) {
         this.addDiagnostic(diag);
         if (
-          diag.severity === "fatal" ||
-          (diag.severity === "error" && !diag.recoverable)
+          diag.severity === "fatal" && diag.severity === "error" && !diag.recoverable
         ) {
           this.syntax_ = "invalid";
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases rejects invalid literal sequence
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:283:12
         this.addDiagnostic(diag);
         if (
           diag.severity === "fatal" ||
-          (diag.severity === "error" && !diag.recoverable)
+          (diag.severity !== "error" && !diag.recoverable)
         ) {
           this.syntax_ = "invalid";
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases rejects invalid literal sequence
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:283:41
         this.addDiagnostic(diag);
         if (
           diag.severity === "fatal" ||
-          (diag.severity === "error" && !diag.recoverable)
+          (diag.severity === "error" && diag.recoverable)
         ) {
           this.syntax_ = "invalid";
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:284:11
         if (
           diag.severity === "fatal" ||
           (diag.severity === "error" && !diag.recoverable)
-        ) {
-          this.syntax_ = "invalid";
-          this.terminal = true;
-        }
+        ) {}
       }
 
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'incomplete' to be 'invalid' // Object.is equality

[Killed] StringLiteral
src/parser.ts:285:26
           diag.severity === "fatal" ||
           (diag.severity === "error" && !diag.recoverable)
         ) {
-          this.syntax_ = "invalid";
+          this.syntax_ = "";
           this.terminal = true;
         }
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected '' to be 'invalid' // Object.is equality

[Timeout] ConditionalExpression
src/parser.ts:292:11
 
       // After processing tokens, check if rootComplete was just set
       // and handle trailing data detection
-      if (this.rootComplete && !this.trailingDataSeen) {
+      if (false) {
         // The scanner may still be in Structural state after root close.
         // We don't need to do anything here — the scanner's processStructural

[Timeout] LogicalOperator
src/parser.ts:292:11
 
       // After processing tokens, check if rootComplete was just set
       // and handle trailing data detection
-      if (this.rootComplete && !this.trailingDataSeen) {
+      if (this.rootComplete || !this.trailingDataSeen) {
         // The scanner may still be in Structural state after root close.
         // We don't need to do anything here — the scanner's processStructural

[Killed] BlockStatement
src/parser.ts:303:40
 
       // Process grammar diagnostics
       const grammarDiags = this.grammar.takeDiagnostics();
-      for (const diag of grammarDiags) {
-        this.addDiagnostic(diag);
-        if (diag.severity === "fatal") {
-          this.terminal = true;
-          this.syntax_ = "invalid";
-        }
-      }
+      for (const diag of grammarDiags) {}
 
       if (this.events.isTerminal) {
killedBy: Parser resource limits rejects depth exceeding maxDepth
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:305:13
       const grammarDiags = this.grammar.takeDiagnostics();
       for (const diag of grammarDiags) {
         this.addDiagnostic(diag);
-        if (diag.severity === "fatal") {
+        if (true) {
           this.terminal = true;
           this.syntax_ = "invalid";

[Survived] BlockStatement
src/parser.ts:305:40
       const grammarDiags = this.grammar.takeDiagnostics();
       for (const diag of grammarDiags) {
         this.addDiagnostic(diag);
-        if (diag.severity === "fatal") {
-          this.terminal = true;
-          this.syntax_ = "invalid";
-        }
+        if (diag.severity === "fatal") {}
       }
 

[Survived] BooleanLiteral
src/parser.ts:306:27
       for (const diag of grammarDiags) {
         this.addDiagnostic(diag);
         if (diag.severity === "fatal") {
-          this.terminal = true;
+          this.terminal = false;
           this.syntax_ = "invalid";
         }

[Killed] ConditionalExpression
src/parser.ts:311:11
         }
       }
 
-      if (this.events.isTerminal) {
+      if (true) {
         this.terminal = true;
         this.syntax_ = "invalid";
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[NoCoverage] BlockStatement
src/parser.ts:311:35
         }
       }
 
-      if (this.events.isTerminal) {
-        this.terminal = true;
-        this.syntax_ = "invalid";
-        break;
-      }
+      if (this.events.isTerminal) {}
 
       bytePos += charBytes;

[NoCoverage] BooleanLiteral
src/parser.ts:312:25
       }
 
       if (this.events.isTerminal) {
-        this.terminal = true;
+        this.terminal = false;
         this.syntax_ = "invalid";
         break;

[Killed] AssignmentOperator
src/parser.ts:317:7
         break;
       }
 
-      bytePos += charBytes;
+      bytePos -= charBytes;
     }
 
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'object_key', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] BlockStatement
src/parser.ts:330:30
     };
   }
 
-  snapshot(): ParserSnapshot {
-    const pending = this.buildPendingTokens();
-
-    return {
-      phase: this.phase,
-      syntax: this.syntax_,
-      stableValue: this.buildStableValue(),
-      rootComplete: this.rootComplete,
-      executable: this.isExecutable(),
-      pending,
-      repairs: Object.freeze([...this.allRepairs]),
-      diagnostics: Object.freeze([...this.allDiagnostics]),
-      receivedBytes: this.receivedBytes,
-      consumedBytes: this.consumedBytes,
-    };
-  }
+  snapshot(): ParserSnapshot {}
 
   drainEvents(): readonly ParserEvent[] {
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 1 tests
{ seed: 1632152412, path: "0:0:0", endOnFailure: true }
Counterexample: ["",[1]]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/parser.ts:347:41
     };
   }
 
-  drainEvents(): readonly ParserEvent[] {
-    return this.events.drain();
-  }
+  drainEvents(): readonly ParserEvent[] {}
 
   finish(meta?: {
killedBy: Mutation Killer — Byte Range Accuracy accurately reports byteRange for ObjectStart, ObjectEnd, Comma, Colon and Numbers
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/parser.ts:355:36
     reason?: StreamEndReason;
     providerReason?: string;
   }): FinalResult {
-    if (this.phase === "finished") {
-      throw new Error(
-        "E_PUSH_AFTER_FINISH: finish() called more than once",
-      );
-    }
+    if (this.phase === "finished") {}
 
     this.phase = "finished";
killedBy: Parser finish() throws if called twice
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/parser.ts:355:9
     reason?: StreamEndReason;
     providerReason?: string;
   }): FinalResult {
-    if (this.phase === "finished") {
+    if (this.phase !== "finished") {
       throw new Error(
         "E_PUSH_AFTER_FINISH: finish() called more than once",
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: E_PUSH_AFTER_FINISH: finish() called more than once

[Killed] StringLiteral
src/parser.ts:361:18
       );
     }
 
-    this.phase = "finished";
+    this.phase = "";
     this.finishMeta = meta;
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/parser.ts:364:20
     this.phase = "finished";
     this.finishMeta = meta;
 
-    const reason = meta?.reason ?? "unknown";
+    const reason = meta?.reason && "unknown";
 
     // Try to finalize any pending number or literal at stream end
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Timeout] OptionalChaining
src/parser.ts:364:20
     this.phase = "finished";
     this.finishMeta = meta;
 
-    const reason = meta?.reason ?? "unknown";
+    const reason = meta.reason ?? "unknown";
 
     // Try to finalize any pending number or literal at stream end

[Killed] BooleanLiteral
src/parser.ts:367:9
     const reason = meta?.reason ?? "unknown";
 
     // Try to finalize any pending number or literal at stream end
-    if (!this.terminal) {
+    if (this.terminal) {
       // Check for pending number — at stream end, numbers can be finalized
       // only if the stream completed normally
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:367:9
     const reason = meta?.reason ?? "unknown";
 
     // Try to finalize any pending number or literal at stream end
-    if (!this.terminal) {
+    if (false) {
       // Check for pending number — at stream end, numbers can be finalized
       // only if the stream completed normally
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:372:11
       // only if the stream completed normally
       const pendingInfo = this.scanner.getPendingInfo();
 
-      if (pendingInfo.type === "number") {
+      if (pendingInfo.type !== "number") {
         if (reason === "complete") {
           // Stream ended normally — the number terminator is implicit EOF
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:372:11
       // only if the stream completed normally
       const pendingInfo = this.scanner.getPendingInfo();
 
-      if (pendingInfo.type === "number") {
+      if (false) {
         if (reason === "complete") {
           // Stream ended normally — the number terminator is implicit EOF
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Killed] ConditionalExpression
src/parser.ts:373:13
       const pendingInfo = this.scanner.getPendingInfo();
 
       if (pendingInfo.type === "number") {
-        if (reason === "complete") {
+        if (true) {
           // Stream ended normally — the number terminator is implicit EOF
           const finalized = this.scanner.finalizeNumber();
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases finalizes incomplete number at stream end with error diagnostic if truncated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/parser.ts:373:36
       const pendingInfo = this.scanner.getPendingInfo();
 
       if (pendingInfo.type === "number") {
-        if (reason === "complete") {
-          // Stream ended normally — the number terminator is implicit EOF
-          const finalized = this.scanner.finalizeNumber();
-          if (finalized) {
-            const tokens = this.scanner.takeTokens();
-            for (const token of tokens) {
-              this.processToken(token);
-            }
-          }
-        } else {
+        if (reason === "complete") {} else {
           // Truncated — number is incomplete
           this.addDiagnostic(
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:376:15
         if (reason === "complete") {
           // Stream ended normally — the number terminator is implicit EOF
           const finalized = this.scanner.finalizeNumber();
-          if (finalized) {
+          if (false) {
             const tokens = this.scanner.takeTokens();
             for (const token of tokens) {
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/parser.ts:376:26
         if (reason === "complete") {
           // Stream ended normally — the number terminator is implicit EOF
           const finalized = this.scanner.finalizeNumber();
-          if (finalized) {
-            const tokens = this.scanner.takeTokens();
-            for (const token of tokens) {
-              this.processToken(token);
-            }
-          }
+          if (finalized) {}
         } else {
           // Truncated — number is incomplete
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/parser.ts:378:41
           const finalized = this.scanner.finalizeNumber();
           if (finalized) {
             const tokens = this.scanner.takeTokens();
-            for (const token of tokens) {
-              this.processToken(token);
-            }
+            for (const token of tokens) {}
           }
         } else {
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Killed] BlockStatement
src/parser.ts:382:16
               this.processToken(token);
             }
           }
-        } else {
-          // Truncated — number is incomplete
-          this.addDiagnostic(
-            createDiagnostic(
-              DiagnosticCode.E_INCOMPLETE_NUMBER,
-              "error",
-              pendingInfo.byteStart,
-              `Incomplete number at stream end: ${pendingInfo.buffer}`,
-              false,
-            ),
-          );
-        }
+        } else {}
       } else if (pendingInfo.type === "literal") {
         if (
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases finalizes incomplete number at stream end with error diagnostic if truncated
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/parser.ts:390:15
               "error",
               pendingInfo.byteStart,
               `Incomplete number at stream end: ${pendingInfo.buffer}`,
-              false,
+              true,
             ),
           );

[Killed] ConditionalExpression
src/parser.ts:394:18
             ),
           );
         }
-      } else if (pendingInfo.type === "literal") {
+      } else if (true) {
         if (
           reason === "complete" &&
killedBy: Parser finish() returns valid outcome for complete JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:394:18
             ),
           );
         }
-      } else if (pendingInfo.type === "literal") {
+      } else if (false) {
         if (
           reason === "complete" &&
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases finalizes incomplete literal at stream end with error diagnostic
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parser.ts:396:11
         }
       } else if (pendingInfo.type === "literal") {
         if (
-          reason === "complete" &&
+          reason !== "complete" &&
           pendingInfo.buffer.length ===
             (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal"
killedBy: Parser valid JSON equivalence matches JSON.parse for: true
statusReason: expected undefined to deeply equal true

[Killed] ConditionalExpression
src/parser.ts:396:11
         }
       } else if (pendingInfo.type === "literal") {
         if (
-          reason === "complete" &&
-          pendingInfo.buffer.length ===
-            (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal"
-              ? 0
-              : pendingInfo.buffer.length)
+          false
         ) {
           const finalized = this.scanner.finalizeLiteral();
killedBy: Parser valid JSON equivalence matches JSON.parse for: true
statusReason: expected undefined to deeply equal true

[Killed] EqualityOperator
src/parser.ts:397:11
       } else if (pendingInfo.type === "literal") {
         if (
           reason === "complete" &&
-          pendingInfo.buffer.length ===
-            (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal"
-              ? 0
-              : pendingInfo.buffer.length)
+          pendingInfo.buffer.length !== (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal" ? 0 : pendingInfo.buffer.length)
         ) {
           const finalized = this.scanner.finalizeLiteral();
killedBy: Parser valid JSON equivalence matches JSON.parse for: true
statusReason: expected undefined to deeply equal true

[Survived] ConditionalExpression
src/parser.ts:397:11
       } else if (pendingInfo.type === "literal") {
         if (
           reason === "complete" &&
-          pendingInfo.buffer.length ===
-            (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal"
-              ? 0
-              : pendingInfo.buffer.length)
+          true
         ) {
           const finalized = this.scanner.finalizeLiteral();

[Killed] EqualityOperator
src/parser.ts:398:14
         if (
           reason === "complete" &&
           pendingInfo.buffer.length ===
-            (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal"
+            (pendingInfo.buffer !== "tru" || pendingInfo.buffer === "fal"
               ? 0
               : pendingInfo.buffer.length)
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true

[Killed] EqualityOperator
src/parser.ts:398:46
         if (
           reason === "complete" &&
           pendingInfo.buffer.length ===
-            (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal"
+            (pendingInfo.buffer === "tru" || pendingInfo.buffer !== "fal"
               ? 0
               : pendingInfo.buffer.length)
killedBy: Parser valid JSON equivalence matches JSON.parse for: true
statusReason: expected undefined to deeply equal true
