[Killed] BlockStatement
src/parser.ts:401:11
             (pendingInfo.buffer === "tru" || pendingInfo.buffer === "fal"
               ? 0
               : pendingInfo.buffer.length)
-        ) {
-          const finalized = this.scanner.finalizeLiteral();
-          if (finalized) {
-            const tokens = this.scanner.takeTokens();
-            for (const token of tokens) {
-              this.processToken(token);
-            }
-          } else {
-            this.addDiagnostic(
-              createDiagnostic(
-                DiagnosticCode.E_INCOMPLETE_LITERAL,
-                "error",
-                pendingInfo.byteStart,
-                `Incomplete literal at stream end: ${pendingInfo.buffer}`,
-                false,
-              ),
-            );
-          }
-        } else {
+        ) {} else {
           this.addDiagnostic(
             createDiagnostic(
killedBy: Parser valid JSON equivalence matches JSON.parse for: true
statusReason: expected undefined to deeply equal true

[Killed] BlockStatement
src/parser.ts:403:26
               : pendingInfo.buffer.length)
         ) {
           const finalized = this.scanner.finalizeLiteral();
-          if (finalized) {
-            const tokens = this.scanner.takeTokens();
-            for (const token of tokens) {
-              this.processToken(token);
-            }
-          } else {
+          if (finalized) {} else {
             this.addDiagnostic(
               createDiagnostic(
killedBy: Parser valid JSON equivalence matches JSON.parse for: true
statusReason: expected undefined to deeply equal true

[Killed] ConditionalExpression
src/parser.ts:403:15
               : pendingInfo.buffer.length)
         ) {
           const finalized = this.scanner.finalizeLiteral();
-          if (finalized) {
+          if (false) {
             const tokens = this.scanner.takeTokens();
             for (const token of tokens) {
killedBy: Valid JSON Equivalence matches JSON.parse: true
statusReason: expected undefined to deeply equal true

[NoCoverage] BlockStatement
src/parser.ts:408:18
             for (const token of tokens) {
               this.processToken(token);
             }
-          } else {
-            this.addDiagnostic(
-              createDiagnostic(
-                DiagnosticCode.E_INCOMPLETE_LITERAL,
-                "error",
-                pendingInfo.byteStart,
-                `Incomplete literal at stream end: ${pendingInfo.buffer}`,
-                false,
-              ),
-            );
-          }
+          } else {}
         } else {
           this.addDiagnostic(

[NoCoverage] BooleanLiteral
src/parser.ts:415:17
                 "error",
                 pendingInfo.byteStart,
                 `Incomplete literal at stream end: ${pendingInfo.buffer}`,
-                false,
+                true,
               ),
             );

[Survived] StringLiteral
src/parser.ts:425:15
               DiagnosticCode.E_INCOMPLETE_LITERAL,
               "error",
               pendingInfo.byteStart,
-              `Incomplete literal at stream end: ${pendingInfo.buffer}`,
+              ``,
               false,
             ),

[Killed] EqualityOperator
src/parser.ts:431:9
           );
         }
       } else if (
-        pendingInfo.type === "string" ||
+        pendingInfo.type !== "string" ||
         pendingInfo.type === "object_key" as string
       ) {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:431:9
           );
         }
       } else if (
-        pendingInfo.type === "string" ||
-        pendingInfo.type === "object_key" as string
+        true
       ) {
         this.addDiagnostic(
killedBy: Parser finish() returns valid outcome for complete JSON
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parser.ts:432:9
         }
       } else if (
         pendingInfo.type === "string" ||
-        pendingInfo.type === "object_key" as string
+        pendingInfo.type !== "object_key" as string
       ) {
         this.addDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:432:9
         }
       } else if (
         pendingInfo.type === "string" ||
-        pendingInfo.type === "object_key" as string
+        false
       ) {
         this.addDiagnostic(

[Survived] BlockStatement
src/parser.ts:433:9
       } else if (
         pendingInfo.type === "string" ||
         pendingInfo.type === "object_key" as string
-      ) {
-        this.addDiagnostic(
-          createDiagnostic(
-            DiagnosticCode.E_UNTERMINATED_STRING,
-            "error",
-            pendingInfo.byteStart,
-            "Unterminated string at stream end",
-            false,
-          ),
-        );
-      } else if (pendingInfo.type === "unicode_escape") {
+      ) {} else if (pendingInfo.type === "unicode_escape") {
         this.addDiagnostic(
           createDiagnostic(

[Survived] BooleanLiteral
src/parser.ts:440:13
             "error",
             pendingInfo.byteStart,
             "Unterminated string at stream end",
-            false,
+            true,
           ),
         );

[Killed] ConditionalExpression
src/parser.ts:443:18
             false,
           ),
         );
-      } else if (pendingInfo.type === "unicode_escape") {
+      } else if (true) {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parser.ts:443:18
             false,
           ),
         );
-      } else if (pendingInfo.type === "unicode_escape") {
+      } else if (pendingInfo.type !== "unicode_escape") {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/parser.ts:450:13
             "error",
             pendingInfo.byteStart,
             "Incomplete unicode escape at stream end",
-            false,
+            true,
           ),
         );

[Killed] EqualityOperator
src/parser.ts:453:18
             false,
           ),
         );
-      } else if (pendingInfo.type === "surrogate") {
+      } else if (pendingInfo.type !== "surrogate") {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:453:18
             false,
           ),
         );
-      } else if (pendingInfo.type === "surrogate") {
+      } else if (true) {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/parser.ts:460:13
             "error",
             pendingInfo.byteStart,
             "Unpaired surrogate at stream end",
-            false,
+            true,
           ),
         );

[Killed] ConditionalExpression
src/parser.ts:466:11
       }
 
       // Check for incomplete UTF-8
-      if (this.utf8.hasIncomplete()) {
+      if (true) {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/parser.ts:466:38
       }
 
       // Check for incomplete UTF-8
-      if (this.utf8.hasIncomplete()) {
-        this.addDiagnostic(
-          createDiagnostic(
-            DiagnosticCode.E_INCOMPLETE_UTF8,
-            "error",
-            this.utf8.incompleteByteOffset(),
-            "Incomplete UTF-8 sequence at stream end",
-            false,
-          ),
-        );
-      }
+      if (this.utf8.hasIncomplete()) {}
     }
 

[NoCoverage] BooleanLiteral
src/parser.ts:473:13
             "error",
             this.utf8.incompleteByteOffset(),
             "Incomplete UTF-8 sequence at stream end",
-            false,
+            true,
           ),
         );

[Killed] ConditionalExpression
src/parser.ts:481:7
 
     // Check for truncation
     if (
-      !this.rootComplete &&
-      reason !== "complete"
+      false
     ) {
       // Attempt structural salvage
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/parser.ts:481:7
 
     // Check for truncation
     if (
-      !this.rootComplete &&
+      this.rootComplete &&
       reason !== "complete"
     ) {
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:482:7
     // Check for truncation
     if (
       !this.rootComplete &&
-      reason !== "complete"
+      reason === "complete"
     ) {
       // Attempt structural salvage
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/parser.ts:482:7
     // Check for truncation
     if (
       !this.rootComplete &&
-      reason !== "complete"
+      true
     ) {
       // Attempt structural salvage

[Survived] BooleanLiteral
src/parser.ts:485:22
       reason !== "complete"
     ) {
       // Attempt structural salvage
-      let salvaged = false;
+      let salvaged = true;
       if (
         this.repairs.closeContainersAtFinish === "safe-only" &&

[Killed] ConditionalExpression
src/parser.ts:487:9
       // Attempt structural salvage
       let salvaged = false;
       if (
-        this.repairs.closeContainersAtFinish === "safe-only" &&
-        this.scanner.currentState === ScannerState.Structural &&
-        this.scanner.getPendingInfo().type === "none" &&
-        this.grammar.canSafelyCloseAll() &&
-        !this.hasFatalDiagnostic() &&
-        (this.syntax_ !== "invalid")
+        false
       ) {
         salvaged = true;
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/parser.ts:487:9
       // Attempt structural salvage
       let salvaged = false;
       if (
-        this.repairs.closeContainersAtFinish === "safe-only" &&
-        this.scanner.currentState === ScannerState.Structural &&
-        this.scanner.getPendingInfo().type === "none" &&
-        this.grammar.canSafelyCloseAll() &&
-        !this.hasFatalDiagnostic() &&
-        (this.syntax_ !== "invalid")
+        true
       ) {
         salvaged = true;
killedBy: Parser finish() returns truncated for incomplete JSON with length reason
statusReason: expected 'salvaged' to be 'truncated' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:488:9
       let salvaged = false;
       if (
         this.repairs.closeContainersAtFinish === "safe-only" &&
-        this.scanner.currentState === ScannerState.Structural &&
+        this.scanner.currentState !== ScannerState.Structural &&
         this.scanner.getPendingInfo().type === "none" &&
         this.grammar.canSafelyCloseAll() &&
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/parser.ts:488:9
       let salvaged = false;
       if (
         this.repairs.closeContainersAtFinish === "safe-only" &&
-        this.scanner.currentState === ScannerState.Structural &&
+        true &&
         this.scanner.getPendingInfo().type === "none" &&
         this.grammar.canSafelyCloseAll() &&

[Killed] EqualityOperator
src/parser.ts:489:9
       if (
         this.repairs.closeContainersAtFinish === "safe-only" &&
         this.scanner.currentState === ScannerState.Structural &&
-        this.scanner.getPendingInfo().type === "none" &&
+        this.scanner.getPendingInfo().type !== "none" &&
         this.grammar.canSafelyCloseAll() &&
         !this.hasFatalDiagnostic() &&
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/parser.ts:489:9
       if (
         this.repairs.closeContainersAtFinish === "safe-only" &&
         this.scanner.currentState === ScannerState.Structural &&
-        this.scanner.getPendingInfo().type === "none" &&
+        true &&
         this.grammar.canSafelyCloseAll() &&
         !this.hasFatalDiagnostic() &&

[Killed] BooleanLiteral
src/parser.ts:491:9
         this.scanner.currentState === ScannerState.Structural &&
         this.scanner.getPendingInfo().type === "none" &&
         this.grammar.canSafelyCloseAll() &&
-        !this.hasFatalDiagnostic() &&
+        this.hasFatalDiagnostic() &&
         (this.syntax_ !== "invalid")
       ) {
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/parser.ts:492:10
         this.scanner.getPendingInfo().type === "none" &&
         this.grammar.canSafelyCloseAll() &&
         !this.hasFatalDiagnostic() &&
-        (this.syntax_ !== "invalid")
+        (this.syntax_ === "invalid")
       ) {
         salvaged = true;
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'truncated' to be 'salvaged' // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:492:10
         this.scanner.getPendingInfo().type === "none" &&
         this.grammar.canSafelyCloseAll() &&
         !this.hasFatalDiagnostic() &&
-        (this.syntax_ !== "invalid")
+        (true)
       ) {
         salvaged = true;

[Killed] BlockStatement
src/parser.ts:493:9
         this.grammar.canSafelyCloseAll() &&
         !this.hasFatalDiagnostic() &&
         (this.syntax_ !== "invalid")
-      ) {
-        salvaged = true;
-        const frames = this.grammar.getFrames();
-        // We know exactly what to close, just close them all
-        for (let i = frames.length - 1; i >= 0; i--) {
-          const frame = frames[i];
-          if (frame) {
-            this.events.emitContainerClosed(frame.path, frame.containerType);
-          }
-        }
-        
-        const repair: RepairAction = {
-           code: "R_CLOSE_CONTAINER",
-           byteRange: [this.consumedBytes, this.consumedBytes],
-           impact: "structural",
-           description: `Safely closed ${frames.length} containers at stream end`,
-        };
-        this.allRepairs.push(repair);
-        this.events.emitRepairApplied(repair);
-        this.rootComplete = true;
-      }
+      ) {}
 
       if (!salvaged) {
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Survived] BooleanLiteral
src/parser.ts:494:20
         !this.hasFatalDiagnostic() &&
         (this.syntax_ !== "invalid")
       ) {
-        salvaged = true;
+        salvaged = false;
         const frames = this.grammar.getFrames();
         // We know exactly what to close, just close them all

[Killed] EqualityOperator
src/parser.ts:497:41
         salvaged = true;
         const frames = this.grammar.getFrames();
         // We know exactly what to close, just close them all
-        for (let i = frames.length - 1; i >= 0; i--) {
+        for (let i = frames.length - 1; i < 0; i--) {
           const frame = frames[i];
           if (frame) {
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/parser.ts:497:54
         salvaged = true;
         const frames = this.grammar.getFrames();
         // We know exactly what to close, just close them all
-        for (let i = frames.length - 1; i >= 0; i--) {
-          const frame = frames[i];
-          if (frame) {
-            this.events.emitContainerClosed(frame.path, frame.containerType);
-          }
-        }
+        for (let i = frames.length - 1; i >= 0; i--) {}
         
         const repair: RepairAction = {
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/parser.ts:499:15
         // We know exactly what to close, just close them all
         for (let i = frames.length - 1; i >= 0; i--) {
           const frame = frames[i];
-          if (frame) {
+          if (false) {
             this.events.emitContainerClosed(frame.path, frame.containerType);
           }
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/parser.ts:499:22
         // We know exactly what to close, just close them all
         for (let i = frames.length - 1; i >= 0; i--) {
           const frame = frames[i];
-          if (frame) {
-            this.events.emitContainerClosed(frame.path, frame.containerType);
-          }
+          if (frame) {}
         }
         
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 0 to be greater than 0

[Survived] ArrayDeclaration
src/parser.ts:506:23
         
         const repair: RepairAction = {
            code: "R_CLOSE_CONTAINER",
-           byteRange: [this.consumedBytes, this.consumedBytes],
+           byteRange: [],
            impact: "structural",
            description: `Safely closed ${frames.length} containers at stream end`,

[Survived] BooleanLiteral
src/parser.ts:512:29
         };
         this.allRepairs.push(repair);
         this.events.emitRepairApplied(repair);
-        this.rootComplete = true;
+        this.rootComplete = false;
       }
 

[Survived] BlockStatement
src/parser.ts:515:22
         this.rootComplete = true;
       }
 
-      if (!salvaged) {
-        this.addDiagnostic(
-          createDiagnostic(
-            DiagnosticCode.E_STREAM_TRUNCATED,
-            "error",
-            this.consumedBytes,
-            `Stream truncated: ${reason}`,
-            false,
-          ),
-        );
-      }
+      if (!salvaged) {}
     } else if (!this.rootComplete && reason === "complete") {
       // Stream said complete but root isn't closed

[Survived] ConditionalExpression
src/parser.ts:515:11
         this.rootComplete = true;
       }
 
-      if (!salvaged) {
+      if (true) {
         this.addDiagnostic(
           createDiagnostic(

[Survived] StringLiteral
src/parser.ts:519:13
         this.addDiagnostic(
           createDiagnostic(
             DiagnosticCode.E_STREAM_TRUNCATED,
-            "error",
+            "",
             this.consumedBytes,
             `Stream truncated: ${reason}`,

[Survived] BooleanLiteral
src/parser.ts:522:13
             "error",
             this.consumedBytes,
             `Stream truncated: ${reason}`,
-            false,
+            true,
           ),
         );

[Killed] BooleanLiteral
src/parser.ts:526:16
           ),
         );
       }
-    } else if (!this.rootComplete && reason === "complete") {
+    } else if (this.rootComplete && reason === "complete") {
       // Stream said complete but root isn't closed
       if (this.hasSeenValue) {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/parser.ts:526:16
           ),
         );
       }
-    } else if (!this.rootComplete && reason === "complete") {
+    } else if (!this.rootComplete || reason === "complete") {
       // Stream said complete but root isn't closed
       if (this.hasSeenValue) {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:528:11
       }
     } else if (!this.rootComplete && reason === "complete") {
       // Stream said complete but root isn't closed
-      if (this.hasSeenValue) {
+      if (true) {
         this.addDiagnostic(
           createDiagnostic(

[Survived] ConditionalExpression
src/parser.ts:528:11
       }
     } else if (!this.rootComplete && reason === "complete") {
       // Stream said complete but root isn't closed
-      if (this.hasSeenValue) {
+      if (false) {
         this.addDiagnostic(
           createDiagnostic(

[Survived] StringLiteral
src/parser.ts:534:13
             DiagnosticCode.E_STREAM_TRUNCATED,
             "error",
             this.consumedBytes,
-            "Stream marked complete but JSON root is not closed",
+            "",
             false,
           ),

[Survived] BooleanLiteral
src/parser.ts:535:13
             "error",
             this.consumedBytes,
             "Stream marked complete but JSON root is not closed",
-            false,
+            true,
           ),
         );

[Timeout] LogicalOperator
src/parser.ts:545:9
     const executable = this.isExecutable();
 
     // Emit finish events
-    if (this.rootComplete && !this.grammar.hasDuplicate && !this.hasFatalDiagnostic()) {
+    if (this.rootComplete && !this.grammar.hasDuplicate || !this.hasFatalDiagnostic()) {
       this.events.emitDocumentComplete(executable);
     }

[Timeout] ConditionalExpression
src/parser.ts:545:9
     const executable = this.isExecutable();
 
     // Emit finish events
-    if (this.rootComplete && !this.grammar.hasDuplicate && !this.hasFatalDiagnostic()) {
+    if (true) {
       this.events.emitDocumentComplete(executable);
     }

[Killed] ObjectLiteral
src/parser.ts:550:12
     }
     this.events.emitStreamFinished(outcome);
 
-    return {
-      syntax: this.syntax_,
-      outcome,
-      stableValue: this.buildStableValue(),
-      executable,
-      repairs: Object.freeze([...this.allRepairs]),
-      diagnostics: Object.freeze([...this.allDiagnostics]),
-      receivedBytes: this.receivedBytes,
-      consumedBytes: this.consumedBytes,
-    };
+    return {};
   }
 
killedBy: Parser finish() returns valid outcome for complete JSON
statusReason: expected undefined to be 'valid' // Object.is equality

[Timeout] ArrayDeclaration
src/parser.ts:555:30
       outcome,
       stableValue: this.buildStableValue(),
       executable,
-      repairs: Object.freeze([...this.allRepairs]),
+      repairs: Object.freeze([]),
       diagnostics: Object.freeze([...this.allDiagnostics]),
       receivedBytes: this.receivedBytes,

[Killed] ArrayDeclaration
src/parser.ts:556:34
       stableValue: this.buildStableValue(),
       executable,
       repairs: Object.freeze([...this.allRepairs]),
-      diagnostics: Object.freeze([...this.allDiagnostics]),
+      diagnostics: Object.freeze([]),
       receivedBytes: this.receivedBytes,
       consumedBytes: this.consumedBytes,
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:568:9
 
   private processToken(token: Token): void {
     // Handle value skipping (duplicate key value)
-    if (this.isSkippingValue) {
+    if (true) {
       if (
         token.type === TokenType.ObjectStart ||
killedBy: Parser push() accepts a string chunk
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:568:9
 
   private processToken(token: Token): void {
     // Handle value skipping (duplicate key value)
-    if (this.isSkippingValue) {
+    if (false) {
       if (
         token.type === TokenType.ObjectStart ||
killedBy: Parser duplicate key detection first value wins for duplicate keys
statusReason: expected { a: 1, b: 3 } to deeply equal { a: 1, b: 2 }

[Survived] LogicalOperator
src/parser.ts:570:9
     // Handle value skipping (duplicate key value)
     if (this.isSkippingValue) {
       if (
-        token.type === TokenType.ObjectStart ||
-        token.type === TokenType.ArrayStart
+        token.type === TokenType.ObjectStart && token.type === TokenType.ArrayStart
       ) {
         this.skipValueDepth++;

[Survived] ConditionalExpression
src/parser.ts:570:9
     // Handle value skipping (duplicate key value)
     if (this.isSkippingValue) {
       if (
-        token.type === TokenType.ObjectStart ||
-        token.type === TokenType.ArrayStart
+        true
       ) {
         this.skipValueDepth++;

[Survived] EqualityOperator
src/parser.ts:571:9
     if (this.isSkippingValue) {
       if (
         token.type === TokenType.ObjectStart ||
-        token.type === TokenType.ArrayStart
+        token.type !== TokenType.ArrayStart
       ) {
         this.skipValueDepth++;

[Survived] ConditionalExpression
src/parser.ts:571:9
     if (this.isSkippingValue) {
       if (
         token.type === TokenType.ObjectStart ||
-        token.type === TokenType.ArrayStart
+        false
       ) {
         this.skipValueDepth++;

[NoCoverage] BlockStatement
src/parser.ts:572:9
       if (
         token.type === TokenType.ObjectStart ||
         token.type === TokenType.ArrayStart
-      ) {
-        this.skipValueDepth++;
-      } else if (
+      ) {} else if (
         token.type === TokenType.ObjectEnd ||
         token.type === TokenType.ArrayEnd

[NoCoverage] UpdateOperator
src/parser.ts:573:9
         token.type === TokenType.ObjectStart ||
         token.type === TokenType.ArrayStart
       ) {
-        this.skipValueDepth++;
+        this.skipValueDepth--;
       } else if (
         token.type === TokenType.ObjectEnd ||

[Survived] EqualityOperator
src/parser.ts:575:9
       ) {
         this.skipValueDepth++;
       } else if (
-        token.type === TokenType.ObjectEnd ||
+        token.type !== TokenType.ObjectEnd ||
         token.type === TokenType.ArrayEnd
       ) {

[Survived] ConditionalExpression
src/parser.ts:575:9
       ) {
         this.skipValueDepth++;
       } else if (
-        token.type === TokenType.ObjectEnd ||
-        token.type === TokenType.ArrayEnd
+        false
       ) {
         this.skipValueDepth--;

[Survived] EqualityOperator
src/parser.ts:576:9
         this.skipValueDepth++;
       } else if (
         token.type === TokenType.ObjectEnd ||
-        token.type === TokenType.ArrayEnd
+        token.type !== TokenType.ArrayEnd
       ) {
         this.skipValueDepth--;

[Survived] ConditionalExpression
src/parser.ts:576:9
         this.skipValueDepth++;
       } else if (
         token.type === TokenType.ObjectEnd ||
-        token.type === TokenType.ArrayEnd
+        false
       ) {
         this.skipValueDepth--;

[NoCoverage] BlockStatement
src/parser.ts:577:9
       } else if (
         token.type === TokenType.ObjectEnd ||
         token.type === TokenType.ArrayEnd
-      ) {
-        this.skipValueDepth--;
-        if (this.skipValueDepth <= 0) {
-          this.isSkippingValue = false;
-          this.skipValueDepth = 0;
-          // Resume normal flow — need to advance the object expectation
-          const frame = this.grammar.current;
-          if (frame && frame.containerType === "object") {
-            frame.objectExpectation = "comma_or_end";
-          }
-        }
-      } else if (this.skipValueDepth === 0) {
+      ) {} else if (this.skipValueDepth === 0) {
         // Scalar value for duplicate key — skip it
         if (

[NoCoverage] UpdateOperator
src/parser.ts:578:9
         token.type === TokenType.ObjectEnd ||
         token.type === TokenType.ArrayEnd
       ) {
-        this.skipValueDepth--;
+        this.skipValueDepth++;
         if (this.skipValueDepth <= 0) {
           this.isSkippingValue = false;

[NoCoverage] EqualityOperator
src/parser.ts:579:13
         token.type === TokenType.ArrayEnd
       ) {
         this.skipValueDepth--;
-        if (this.skipValueDepth <= 0) {
+        if (this.skipValueDepth < 0) {
           this.isSkippingValue = false;
           this.skipValueDepth = 0;

[NoCoverage] EqualityOperator
src/parser.ts:579:13
         token.type === TokenType.ArrayEnd
       ) {
         this.skipValueDepth--;
-        if (this.skipValueDepth <= 0) {
+        if (this.skipValueDepth > 0) {
           this.isSkippingValue = false;
           this.skipValueDepth = 0;

[NoCoverage] BooleanLiteral
src/parser.ts:580:34
       ) {
         this.skipValueDepth--;
         if (this.skipValueDepth <= 0) {
-          this.isSkippingValue = false;
+          this.isSkippingValue = true;
           this.skipValueDepth = 0;
           // Resume normal flow — need to advance the object expectation

[NoCoverage] ConditionalExpression
src/parser.ts:584:24
           this.skipValueDepth = 0;
           // Resume normal flow — need to advance the object expectation
           const frame = this.grammar.current;
-          if (frame && frame.containerType === "object") {
+          if (frame && true) {
             frame.objectExpectation = "comma_or_end";
           }

[NoCoverage] EqualityOperator
src/parser.ts:584:24
           this.skipValueDepth = 0;
           // Resume normal flow — need to advance the object expectation
           const frame = this.grammar.current;
-          if (frame && frame.containerType === "object") {
+          if (frame && frame.containerType !== "object") {
             frame.objectExpectation = "comma_or_end";
           }
