[NoCoverage] StringLiteral
src/parser.ts:585:39
           // Resume normal flow — need to advance the object expectation
           const frame = this.grammar.current;
           if (frame && frame.containerType === "object") {
-            frame.objectExpectation = "comma_or_end";
+            frame.objectExpectation = "";
           }
         }

[Survived] BlockStatement
src/parser.ts:588:45
             frame.objectExpectation = "comma_or_end";
           }
         }
-      } else if (this.skipValueDepth === 0) {
-        // Scalar value for duplicate key — skip it
-        if (
-          token.type === TokenType.String ||
-          token.type === TokenType.Number ||
-          token.type === TokenType.True ||
-          token.type === TokenType.False ||
-          token.type === TokenType.Null
-        ) {
-          this.isSkippingValue = false;
-          const frame = this.grammar.current;
-          if (frame && frame.containerType === "object") {
-            frame.objectExpectation = "comma_or_end";
-          }
-        }
-      }
+      } else if (this.skipValueDepth === 0) {}
       return;
     }

[Survived] ConditionalExpression
src/parser.ts:588:18
             frame.objectExpectation = "comma_or_end";
           }
         }
-      } else if (this.skipValueDepth === 0) {
+      } else if (false) {
         // Scalar value for duplicate key — skip it
         if (

[Survived] LogicalOperator
src/parser.ts:591:11
       } else if (this.skipValueDepth === 0) {
         // Scalar value for duplicate key — skip it
         if (
-          token.type === TokenType.String ||
-          token.type === TokenType.Number ||
-          token.type === TokenType.True ||
-          token.type === TokenType.False ||
+          (token.type === TokenType.String || token.type === TokenType.Number || token.type === TokenType.True) && token.type === TokenType.False ||
           token.type === TokenType.Null
         ) {

[Survived] LogicalOperator
src/parser.ts:591:11
       } else if (this.skipValueDepth === 0) {
         // Scalar value for duplicate key — skip it
         if (
-          token.type === TokenType.String ||
-          token.type === TokenType.Number ||
+          token.type === TokenType.String && token.type === TokenType.Number ||
           token.type === TokenType.True ||
           token.type === TokenType.False ||

[Survived] EqualityOperator
src/parser.ts:592:11
         // Scalar value for duplicate key — skip it
         if (
           token.type === TokenType.String ||
-          token.type === TokenType.Number ||
+          token.type !== TokenType.Number ||
           token.type === TokenType.True ||
           token.type === TokenType.False ||

[Survived] ConditionalExpression
src/parser.ts:592:11
         // Scalar value for duplicate key — skip it
         if (
           token.type === TokenType.String ||
-          token.type === TokenType.Number ||
+          false ||
           token.type === TokenType.True ||
           token.type === TokenType.False ||

[Survived] ConditionalExpression
src/parser.ts:593:11
         if (
           token.type === TokenType.String ||
           token.type === TokenType.Number ||
-          token.type === TokenType.True ||
+          false ||
           token.type === TokenType.False ||
           token.type === TokenType.Null

[Survived] EqualityOperator
src/parser.ts:593:11
         if (
           token.type === TokenType.String ||
           token.type === TokenType.Number ||
-          token.type === TokenType.True ||
+          token.type !== TokenType.True ||
           token.type === TokenType.False ||
           token.type === TokenType.Null

[Survived] EqualityOperator
src/parser.ts:594:11
           token.type === TokenType.String ||
           token.type === TokenType.Number ||
           token.type === TokenType.True ||
-          token.type === TokenType.False ||
+          token.type !== TokenType.False ||
           token.type === TokenType.Null
         ) {

[Survived] ConditionalExpression
src/parser.ts:594:11
           token.type === TokenType.String ||
           token.type === TokenType.Number ||
           token.type === TokenType.True ||
-          token.type === TokenType.False ||
+          false ||
           token.type === TokenType.Null
         ) {

[Survived] ConditionalExpression
src/parser.ts:595:11
           token.type === TokenType.Number ||
           token.type === TokenType.True ||
           token.type === TokenType.False ||
-          token.type === TokenType.Null
+          false
         ) {
           this.isSkippingValue = false;

[Survived] EqualityOperator
src/parser.ts:595:11
           token.type === TokenType.Number ||
           token.type === TokenType.True ||
           token.type === TokenType.False ||
-          token.type === TokenType.Null
+          token.type !== TokenType.Null
         ) {
           this.isSkippingValue = false;

[Survived] BlockStatement
src/parser.ts:596:11
           token.type === TokenType.True ||
           token.type === TokenType.False ||
           token.type === TokenType.Null
-        ) {
-          this.isSkippingValue = false;
-          const frame = this.grammar.current;
-          if (frame && frame.containerType === "object") {
-            frame.objectExpectation = "comma_or_end";
-          }
-        }
+        ) {}
       }
       return;

[Survived] BooleanLiteral
src/parser.ts:597:34
           token.type === TokenType.False ||
           token.type === TokenType.Null
         ) {
-          this.isSkippingValue = false;
+          this.isSkippingValue = true;
           const frame = this.grammar.current;
           if (frame && frame.containerType === "object") {

[Survived] ConditionalExpression
src/parser.ts:599:15
         ) {
           this.isSkippingValue = false;
           const frame = this.grammar.current;
-          if (frame && frame.containerType === "object") {
+          if (false) {
             frame.objectExpectation = "comma_or_end";
           }

[Survived] BlockStatement
src/parser.ts:599:58
         ) {
           this.isSkippingValue = false;
           const frame = this.grammar.current;
-          if (frame && frame.containerType === "object") {
-            frame.objectExpectation = "comma_or_end";
-          }
+          if (frame && frame.containerType === "object") {}
         }
       }

[Killed] ConditionalExpression
src/parser.ts:609:7
 
 
     switch (token.type) {
-      case TokenType.ObjectStart:
-        this.handleObjectStart(token);
-        break;
+      case TokenType.ObjectStart:
       case TokenType.ObjectEnd:
         this.handleObjectEnd(token);
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:612:7
       case TokenType.ObjectStart:
         this.handleObjectStart(token);
         break;
-      case TokenType.ObjectEnd:
-        this.handleObjectEnd(token);
-        break;
+      case TokenType.ObjectEnd:
       case TokenType.ArrayStart:
         this.handleArrayStart(token);
killedBy: Mutation Killer — Byte Range Accuracy accurately handles 2-byte, 3-byte, and 4-byte UTF-8 string pushes for getUtf8ByteLength
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:615:7
       case TokenType.ObjectEnd:
         this.handleObjectEnd(token);
         break;
-      case TokenType.ArrayStart:
-        this.handleArrayStart(token);
-        break;
+      case TokenType.ArrayStart:
       case TokenType.ArrayEnd:
         this.handleArrayEnd(token);
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
src/parser.ts:618:7
       case TokenType.ArrayStart:
         this.handleArrayStart(token);
         break;
-      case TokenType.ArrayEnd:
-        this.handleArrayEnd(token);
-        break;
+      case TokenType.ArrayEnd:
       case TokenType.Colon:
         this.handleColon(token);
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:621:7
       case TokenType.ArrayEnd:
         this.handleArrayEnd(token);
         break;
-      case TokenType.Colon:
-        this.handleColon(token);
-        break;
+      case TokenType.Colon:
       case TokenType.Comma:
         this.handleComma(token);
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:624:7
       case TokenType.Colon:
         this.handleColon(token);
         break;
-      case TokenType.Comma:
-        this.handleComma(token);
-        break;
+      case TokenType.Comma:
       case TokenType.String:
         this.handleString(token);
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"a":1,"b":2}
statusReason: expected { a: 1 } to deeply equal { a: 1, b: 2 }

[Killed] ConditionalExpression
src/parser.ts:627:7
       case TokenType.Comma:
         this.handleComma(token);
         break;
-      case TokenType.String:
-        this.handleString(token);
-        break;
+      case TokenType.String:
       case TokenType.Number:
         this.handleNumber(token);
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:630:7
       case TokenType.String:
         this.handleString(token);
         break;
-      case TokenType.Number:
-        this.handleNumber(token);
-        break;
+      case TokenType.Number:
       case TokenType.True:
       case TokenType.False:
killedBy: Parser snapshot() includes committed number terminated by comma
statusReason: expected { a: null } to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/parser.ts:635:7
         break;
       case TokenType.True:
       case TokenType.False:
-      case TokenType.Null:
-        this.handleLiteral(token);
-        break;
+      case TokenType.Null:
     }
   }
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected { nested: {} } to deeply equal { nested: { x: true, y: false } }

[Killed] ConditionalExpression
src/parser.ts:645:9
     const frame = this.grammar.current;
 
     // Validate context
-    if (frame) {
+    if (true) {
       if (frame.containerType === "object") {
         if (frame.objectExpectation !== "value") {
killedBy: Parser push() accepts a string chunk
statusReason: Cannot read properties of undefined (reading 'containerType')

[Timeout] ConditionalExpression
src/parser.ts:645:9
     const frame = this.grammar.current;
 
     // Validate context
-    if (frame) {
+    if (false) {
       if (frame.containerType === "object") {
         if (frame.objectExpectation !== "value") {

[Killed] ConditionalExpression
src/parser.ts:646:11
 
     // Validate context
     if (frame) {
-      if (frame.containerType === "object") {
+      if (true) {
         if (frame.objectExpectation !== "value") {
           this.addDiagnostic(
killedBy: Parser nested structures parses array of objects
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:646:11
 
     // Validate context
     if (frame) {
-      if (frame.containerType === "object") {
+      if (frame.containerType !== "object") {
         if (frame.objectExpectation !== "value") {
           this.addDiagnostic(
killedBy: Parser nested structures parses array of objects
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:647:13
     // Validate context
     if (frame) {
       if (frame.containerType === "object") {
-        if (frame.objectExpectation !== "value") {
+        if (frame.objectExpectation === "value") {
           this.addDiagnostic(
             createDiagnostic(
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected {} to deeply equal { nested: { x: true, y: false } }

[Killed] ConditionalExpression
src/parser.ts:647:13
     // Validate context
     if (frame) {
       if (frame.containerType === "object") {
-        if (frame.objectExpectation !== "value") {
+        if (true) {
           this.addDiagnostic(
             createDiagnostic(
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected {} to deeply equal { nested: { x: true, y: false } }

[NoCoverage] BooleanLiteral
src/parser.ts:654:15
               "error",
               token.byteStart,
               "Unexpected '{'",
-              false,
+              true,
             ),
           );

[NoCoverage] BooleanLiteral
src/parser.ts:657:27
               false,
             ),
           );
-          this.terminal = true;
+          this.terminal = false;
           this.syntax_ = "invalid";
           return;

[Killed] EqualityOperator
src/parser.ts:661:18
           this.syntax_ = "invalid";
           return;
         }
-      } else if (frame.containerType === "array") {
+      } else if (frame.containerType !== "array") {
         if (
           frame.arrayExpectation !== "first_value_or_end" &&
killedBy: Parser Regressions rejects invalid input: [{} {}]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Killed] BlockStatement
src/parser.ts:661:51
           this.syntax_ = "invalid";
           return;
         }
-      } else if (frame.containerType === "array") {
-        if (
-          frame.arrayExpectation !== "first_value_or_end" &&
-          frame.arrayExpectation !== "value_after_comma"
-        ) {
-          this.addDiagnostic(
-            createDiagnostic(
-              DiagnosticCode.E_UNEXPECTED_TOKEN,
-              "error",
-              token.byteStart,
-              "Unexpected '{' in array",
-              false,
-            ),
-          );
-          this.terminal = true;
-          this.syntax_ = "invalid";
-          return;
-        }
-      }
+      } else if (frame.containerType === "array") {}
     }
 
killedBy: Parser Regressions rejects invalid input: [{} {}]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Killed] ConditionalExpression
src/parser.ts:663:11
         }
       } else if (frame.containerType === "array") {
         if (
-          frame.arrayExpectation !== "first_value_or_end" &&
-          frame.arrayExpectation !== "value_after_comma"
+          true
         ) {
           this.addDiagnostic(
killedBy: Parser nested structures parses array of objects
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:663:11
         }
       } else if (frame.containerType === "array") {
         if (
-          frame.arrayExpectation !== "first_value_or_end" &&
+          true &&
           frame.arrayExpectation !== "value_after_comma"
         ) {
killedBy: Parser nested structures parses array of objects
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:664:11
       } else if (frame.containerType === "array") {
         if (
           frame.arrayExpectation !== "first_value_or_end" &&
-          frame.arrayExpectation !== "value_after_comma"
+          frame.arrayExpectation === "value_after_comma"
         ) {
           this.addDiagnostic(
killedBy: Valid JSON Equivalence matches JSON.parse: [{"x":1},{"y":2}]
statusReason: expected [ { x: 1 } ] to deeply equal [ { x: 1 }, { y: 2 } ]

[Killed] ConditionalExpression
src/parser.ts:664:11
       } else if (frame.containerType === "array") {
         if (
           frame.arrayExpectation !== "first_value_or_end" &&
-          frame.arrayExpectation !== "value_after_comma"
+          true
         ) {
           this.addDiagnostic(
killedBy: Parser nested structures parses array of objects
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:665:11
         if (
           frame.arrayExpectation !== "first_value_or_end" &&
           frame.arrayExpectation !== "value_after_comma"
-        ) {
-          this.addDiagnostic(
-            createDiagnostic(
-              DiagnosticCode.E_UNEXPECTED_TOKEN,
-              "error",
-              token.byteStart,
-              "Unexpected '{' in array",
-              false,
-            ),
-          );
-          this.terminal = true;
-          this.syntax_ = "invalid";
-          return;
-        }
+        ) {}
       }
     }
killedBy: Parser Regressions rejects invalid input: [{} {}]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Survived] BooleanLiteral
src/parser.ts:672:15
               "error",
               token.byteStart,
               "Unexpected '{' in array",
-              false,
+              true,
             ),
           );

[Killed] BooleanLiteral
src/parser.ts:683:9
     }
 
     const newFrame = this.grammar.pushObject(token.byteStart);
-    if (!newFrame) {
+    if (newFrame) {
       this.terminal = true;
       this.syntax_ = "invalid";
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected undefined to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/parser.ts:683:9
     }
 
     const newFrame = this.grammar.pushObject(token.byteStart);
-    if (!newFrame) {
+    if (true) {
       this.terminal = true;
       this.syntax_ = "invalid";
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[NoCoverage] BooleanLiteral
src/parser.ts:684:23
 
     const newFrame = this.grammar.pushObject(token.byteStart);
     if (!newFrame) {
-      this.terminal = true;
+      this.terminal = false;
       this.syntax_ = "invalid";
       return;

[Timeout] BooleanLiteral
src/parser.ts:689:25
       return;
     }
 
-    this.hasSeenValue = true;
+    this.hasSeenValue = false;
     if (this.syntax_ === "empty") {
       this.syntax_ = "incomplete";

[Killed] BlockStatement
src/parser.ts:690:35
     }
 
     this.hasSeenValue = true;
-    if (this.syntax_ === "empty") {
-      this.syntax_ = "incomplete";
-    }
+    if (this.syntax_ === "empty") {}
 
     // Init container in snapshot builder
killedBy: Parser push() returns incomplete for partial input
statusReason: expected 'empty' to be 'incomplete' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:690:9
     }
 
     this.hasSeenValue = true;
-    if (this.syntax_ === "empty") {
+    if (this.syntax_ !== "empty") {
       this.syntax_ = "incomplete";
     }
killedBy: Parser push() returns incomplete for partial input
statusReason: expected 'empty' to be 'incomplete' // Object.is equality

[Killed] StringLiteral
src/parser.ts:691:22
 
     this.hasSeenValue = true;
     if (this.syntax_ === "empty") {
-      this.syntax_ = "incomplete";
+      this.syntax_ = "";
     }
 
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases finalizes incomplete literal at stream end with error diagnostic
statusReason: expected '' to be 'incomplete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:695:9
     }
 
     // Init container in snapshot builder
-    if (!this.grammar.isEmpty()) {
+    if (false) {
       if (this.grammar.depth === 1) {
         this.snapshot_.initRootObject();
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected undefined to deeply equal { path: '/src/app.ts' }

[Killed] BooleanLiteral
src/parser.ts:695:9
     }
 
     // Init container in snapshot builder
-    if (!this.grammar.isEmpty()) {
+    if (this.grammar.isEmpty()) {
       if (this.grammar.depth === 1) {
         this.snapshot_.initRootObject();
killedBy: Mutation Killer — Byte Range Accuracy accurately handles 2-byte, 3-byte, and 4-byte UTF-8 string pushes for getUtf8ByteLength
statusReason: expected undefined to deeply equal { str: '£€𐍈' }

[Killed] BlockStatement
src/parser.ts:696:37
 
     // Init container in snapshot builder
     if (!this.grammar.isEmpty()) {
-      if (this.grammar.depth === 1) {
-        this.snapshot_.initRootObject();
-      } else {
+      if (this.grammar.depth === 1) {} else {
         this.snapshot_.initContainer(newFrame.path, "object");
       }
killedBy: Mutation Killer — Byte Range Accuracy accurately handles 2-byte, 3-byte, and 4-byte UTF-8 string pushes for getUtf8ByteLength
statusReason: expected undefined to deeply equal { str: '£€𐍈' }

[Killed] ConditionalExpression
src/parser.ts:696:11
 
     // Init container in snapshot builder
     if (!this.grammar.isEmpty()) {
-      if (this.grammar.depth === 1) {
+      if (false) {
         this.snapshot_.initRootObject();
       } else {
killedBy: Mutation Killer — Byte Range Accuracy accurately handles 2-byte, 3-byte, and 4-byte UTF-8 string pushes for getUtf8ByteLength
statusReason: expected undefined to deeply equal { str: '£€𐍈' }

[Killed] BlockStatement
src/parser.ts:698:14
     if (!this.grammar.isEmpty()) {
       if (this.grammar.depth === 1) {
         this.snapshot_.initRootObject();
-      } else {
-        this.snapshot_.initContainer(newFrame.path, "object");
-      }
+      } else {}
     }
   }
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected {} to deeply equal { nested: { x: true, y: false } }

[Killed] ConditionalExpression
src/parser.ts:706:9
 
   private handleObjectEnd(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame || frame.containerType !== "object") {
+    if (true) {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:706:9
 
   private handleObjectEnd(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame || frame.containerType !== "object") {
+    if (frame || frame.containerType !== "object") {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[NoCoverage] BooleanLiteral
src/parser.ts:713:11
           "error",
           token.byteStart,
           "Unexpected '}' — no matching open object",
-          false,
+          true,
         ),
       );

[Killed] LogicalOperator
src/parser.ts:722:7
     }
 
     if (
-      frame.objectExpectation !== "first_key_or_end" &&
-      frame.objectExpectation !== "comma_or_end"
+      frame.objectExpectation !== "first_key_or_end" || frame.objectExpectation !== "comma_or_end"
     ) {
       this.addDiagnostic(
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:722:7
     }
 
     if (
-      frame.objectExpectation !== "first_key_or_end" &&
-      frame.objectExpectation !== "comma_or_end"
+      true
     ) {
       this.addDiagnostic(
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:723:7
 
     if (
       frame.objectExpectation !== "first_key_or_end" &&
-      frame.objectExpectation !== "comma_or_end"
+      true
     ) {
       this.addDiagnostic(
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:723:7
 
     if (
       frame.objectExpectation !== "first_key_or_end" &&
-      frame.objectExpectation !== "comma_or_end"
+      frame.objectExpectation === "comma_or_end"
     ) {
       this.addDiagnostic(
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/parser.ts:724:7
     if (
       frame.objectExpectation !== "first_key_or_end" &&
       frame.objectExpectation !== "comma_or_end"
-    ) {
-      this.addDiagnostic(
-        createDiagnostic(
-          DiagnosticCode.E_UNEXPECTED_TOKEN,
-          "error",
-          token.byteStart,
-          `Unexpected '}' while expecting ${frame.objectExpectation}`,
-          false,
-        ),
-      );
-      this.terminal = true;
-      this.syntax_ = "invalid";
-      return;
-    }
+    ) {}
 
     this.grammar.pop();
killedBy: Parser Regressions rejects invalid input: {"a":1,}
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Survived] BooleanLiteral
src/parser.ts:731:11
           "error",
           token.byteStart,
           `Unexpected '}' while expecting ${frame.objectExpectation}`,
-          false,
+          true,
         ),
       );

[Killed] ConditionalExpression
src/parser.ts:743:9
     this.events.emitContainerClosed(frame.path, "object");
 
     // If this closes the root, emit the full object as committed
-    if (this.grammar.isEmpty()) {
+    if (false) {
       this.rootComplete = true;
       this.syntax_ = "root_complete";
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'incomplete' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/parser.ts:743:33
     this.events.emitContainerClosed(frame.path, "object");
 
     // If this closes the root, emit the full object as committed
-    if (this.grammar.isEmpty()) {
-      this.rootComplete = true;
-      this.syntax_ = "root_complete";
-    } else {
+    if (this.grammar.isEmpty()) {} else {
       // Value committed for parent
       this.commitContainerToParent(frame.path, token);
killedBy: Parser push() accepts a string chunk
statusReason: expected 'incomplete' to be 'root_complete' // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:744:27
 
     // If this closes the root, emit the full object as committed
     if (this.grammar.isEmpty()) {
-      this.rootComplete = true;
+      this.rootComplete = false;
       this.syntax_ = "root_complete";
     } else {
killedBy: Parser finish() returns valid outcome for complete JSON
statusReason: expected 'truncated' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:746:12
     if (this.grammar.isEmpty()) {
       this.rootComplete = true;
       this.syntax_ = "root_complete";
-    } else {
-      // Value committed for parent
-      this.commitContainerToParent(frame.path, token);
-    }
+    } else {}
   }
 
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[NoCoverage] BooleanLiteral
src/parser.ts:765:15
               "error",
               token.byteStart,
               "Unexpected '['",
-              false,
+              true,
             ),
           );

[Killed] BlockStatement
src/parser.ts:772:51
           this.syntax_ = "invalid";
           return;
         }
-      } else if (frame.containerType === "array") {
-        if (
-          frame.arrayExpectation !== "first_value_or_end" &&
-          frame.arrayExpectation !== "value_after_comma"
-        ) {
-          this.addDiagnostic(
-            createDiagnostic(
-              DiagnosticCode.E_UNEXPECTED_TOKEN,
-              "error",
-              token.byteStart,
-              "Unexpected '[' in array",
-              false,
-            ),
-          );
-          this.terminal = true;
-          this.syntax_ = "invalid";
-          return;
-        }
-      }
+      } else if (frame.containerType === "array") {}
     }
 
killedBy: Parser Regressions rejects invalid input: [[] []]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Killed] EqualityOperator
src/parser.ts:774:11
         }
       } else if (frame.containerType === "array") {
         if (
-          frame.arrayExpectation !== "first_value_or_end" &&
+          frame.arrayExpectation === "first_value_or_end" &&
           frame.arrayExpectation !== "value_after_comma"
         ) {
killedBy: Parser resource limits rejects depth exceeding maxDepth
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/parser.ts:776:11
         if (
           frame.arrayExpectation !== "first_value_or_end" &&
           frame.arrayExpectation !== "value_after_comma"
-        ) {
-          this.addDiagnostic(
-            createDiagnostic(
-              DiagnosticCode.E_UNEXPECTED_TOKEN,
-              "error",
-              token.byteStart,
-              "Unexpected '[' in array",
-              false,
-            ),
-          );
-          this.terminal = true;
-          this.syntax_ = "invalid";
-          return;
-        }
+        ) {}
       }
     }
killedBy: Parser Regressions rejects invalid input: [[] []]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Survived] StringLiteral
src/parser.ts:782:15
               DiagnosticCode.E_UNEXPECTED_TOKEN,
               "error",
               token.byteStart,
-              "Unexpected '[' in array",
+              "",
               false,
             ),

[Survived] BooleanLiteral
src/parser.ts:783:15
               "error",
               token.byteStart,
               "Unexpected '[' in array",
-              false,
+              true,
             ),
           );
