[Killed] BooleanLiteral
src/parser.ts:794:9
     }
 
     const newFrame = this.grammar.pushArray(token.byteStart);
-    if (!newFrame) {
+    if (newFrame) {
       this.terminal = true;
       this.syntax_ = "invalid";
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
src/parser.ts:794:9
     }
 
     const newFrame = this.grammar.pushArray(token.byteStart);
-    if (!newFrame) {
+    if (true) {
       this.terminal = true;
       this.syntax_ = "invalid";
killedBy: Parser Regressions rejects invalid input: [1 2]
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:801:9
     }
 
     this.hasSeenValue = true;
-    if (this.syntax_ === "empty") {
+    if (true) {
       this.syntax_ = "incomplete";
     }

[Killed] EqualityOperator
src/parser.ts:806:9
     }
 
     // Init container in snapshot builder
-    if (this.grammar.depth === 1) {
+    if (this.grammar.depth !== 1) {
       this.snapshot_.initRootArray();
     } else {
killedBy: Valid JSON Equivalence matches JSON.parse: [1,2,3]
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
src/parser.ts:806:9
     }
 
     // Init container in snapshot builder
-    if (this.grammar.depth === 1) {
+    if (false) {
       this.snapshot_.initRootArray();
     } else {
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] BlockStatement
src/parser.ts:808:12
     // Init container in snapshot builder
     if (this.grammar.depth === 1) {
       this.snapshot_.initRootArray();
-    } else {
-      this.snapshot_.initContainer(newFrame.path, "array");
-    }
+    } else {}
   }
 
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected {} to deeply equal { arr: [ 1, 'two', null, false ] }

[Killed] EqualityOperator
src/parser.ts:815:19
 
   private handleArrayEnd(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame || frame.containerType !== "array") {
+    if (!frame || frame.containerType === "array") {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:815:9
 
   private handleArrayEnd(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame || frame.containerType !== "array") {
+    if (true) {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Valid JSON Equivalence matches JSON.parse: [1,2,3]
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of +0 but got 2

[NoCoverage] StringLiteral
src/parser.ts:821:11
           DiagnosticCode.E_UNEXPECTED_TOKEN,
           "error",
           token.byteStart,
-          "Unexpected ']' — no matching open array",
+          "",
           false,
         ),

[NoCoverage] BooleanLiteral
src/parser.ts:822:11
           "error",
           token.byteStart,
           "Unexpected ']' — no matching open array",
-          false,
+          true,
         ),
       );

[Killed] ConditionalExpression
src/parser.ts:831:7
     }
 
     if (
-      frame.arrayExpectation !== "first_value_or_end" &&
-      frame.arrayExpectation !== "comma_or_end"
+      true
     ) {
       this.addDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/parser.ts:832:7
 
     if (
       frame.arrayExpectation !== "first_value_or_end" &&
-      frame.arrayExpectation !== "comma_or_end"
+      frame.arrayExpectation === "comma_or_end"
     ) {
       this.addDiagnostic(
killedBy: Valid JSON Equivalence matches JSON.parse: [1,2,3]
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of +0 but got 2

[Killed] ConditionalExpression
src/parser.ts:832:7
 
     if (
       frame.arrayExpectation !== "first_value_or_end" &&
-      frame.arrayExpectation !== "comma_or_end"
+      true
     ) {
       this.addDiagnostic(
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:833:7
     if (
       frame.arrayExpectation !== "first_value_or_end" &&
       frame.arrayExpectation !== "comma_or_end"
-    ) {
-      this.addDiagnostic(
-        createDiagnostic(
-          DiagnosticCode.E_UNEXPECTED_TOKEN,
-          "error",
-          token.byteStart,
-          "Unexpected ']'",
-          false,
-        ),
-      );
-      this.terminal = true;
-      this.syntax_ = "invalid";
-      return;
-    }
+    ) {}
 
     this.grammar.pop();
killedBy: Parser Regressions rejects invalid input: [1,]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Survived] BooleanLiteral
src/parser.ts:840:11
           "error",
           token.byteStart,
           "Unexpected ']'",
-          false,
+          true,
         ),
       );

[Killed] ConditionalExpression
src/parser.ts:851:9
     this.grammar.pop();
     this.events.emitContainerClosed(frame.path, "array");
 
-    if (this.grammar.isEmpty()) {
+    if (true) {
       this.rootComplete = true;
       this.syntax_ = "root_complete";
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'valid'

[Killed] BlockStatement
src/parser.ts:851:33
     this.grammar.pop();
     this.events.emitContainerClosed(frame.path, "array");
 
-    if (this.grammar.isEmpty()) {
-      this.rootComplete = true;
-      this.syntax_ = "root_complete";
-    } else {
+    if (this.grammar.isEmpty()) {} else {
       this.commitContainerToParent(frame.path, token);
     }
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected 'truncated' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:854:12
     if (this.grammar.isEmpty()) {
       this.rootComplete = true;
       this.syntax_ = "root_complete";
-    } else {
-      this.commitContainerToParent(frame.path, token);
-    }
+    } else {}
   }
 
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"arr":[1,"two",null]}
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:859:43
     }
   }
 
-  private handleColon(token: Token): void {
-    const frame = this.grammar.current;
-    if (!frame || frame.containerType !== "object" || frame.objectExpectation !== "colon") {
-      this.addDiagnostic(
-        createDiagnostic(
-          DiagnosticCode.E_UNEXPECTED_TOKEN,
-          "error",
-          token.byteStart,
-          "Unexpected ':'",
-          false,
-        ),
-      );
-      this.terminal = true;
-      this.syntax_ = "invalid";
-      return;
-    }
-    frame.objectExpectation = "value";
-  }
+  private handleColon(token: Token): void {}
 
   private handleComma(token: Token): void {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:861:19
 
   private handleColon(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame || frame.containerType !== "object" || frame.objectExpectation !== "colon") {
+    if (!frame || frame.containerType === "object" || frame.objectExpectation !== "colon") {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] EqualityOperator
src/parser.ts:861:55
 
   private handleColon(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame || frame.containerType !== "object" || frame.objectExpectation !== "colon") {
+    if (!frame || frame.containerType !== "object" || frame.objectExpectation === "colon") {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Survived] StringLiteral
src/parser.ts:867:11
           DiagnosticCode.E_UNEXPECTED_TOKEN,
           "error",
           token.byteStart,
-          "Unexpected ':'",
+          "",
           false,
         ),

[Survived] BooleanLiteral
src/parser.ts:868:11
           "error",
           token.byteStart,
           "Unexpected ':'",
-          false,
+          true,
         ),
       );

[Killed] BooleanLiteral
src/parser.ts:880:9
 
   private handleComma(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame) {
+    if (frame) {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/parser.ts:880:9
 
   private handleComma(token: Token): void {
     const frame = this.grammar.current;
-    if (!frame) {
+    if (true) {
       this.addDiagnostic(
         createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[NoCoverage] StringLiteral
src/parser.ts:886:11
           DiagnosticCode.E_UNEXPECTED_TOKEN,
           "error",
           token.byteStart,
-          "Unexpected ','",
+          "",
           false,
         ),

[NoCoverage] BooleanLiteral
src/parser.ts:887:11
           "error",
           token.byteStart,
           "Unexpected ','",
-          false,
+          true,
         ),
       );

[Killed] ConditionalExpression
src/parser.ts:895:9
       return;
     }
 
-    if (frame.containerType === "object") {
+    if (true) {
       if (frame.objectExpectation !== "comma_or_end") {
         this.addDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/parser.ts:896:11
     }
 
     if (frame.containerType === "object") {
-      if (frame.objectExpectation !== "comma_or_end") {
+      if (frame.objectExpectation === "comma_or_end") {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/parser.ts:896:11
     }
 
     if (frame.containerType === "object") {
-      if (frame.objectExpectation !== "comma_or_end") {
+      if (true) {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[NoCoverage] StringLiteral
src/parser.ts:902:13
             DiagnosticCode.E_UNEXPECTED_TOKEN,
             "error",
             token.byteStart,
-            "Unexpected ',' in object",
+            "",
             false,
           ),

[NoCoverage] BooleanLiteral
src/parser.ts:903:13
             "error",
             token.byteStart,
             "Unexpected ',' in object",
-            false,
+            true,
           ),
         );

[Killed] StringLiteral
src/parser.ts:910:33
         this.syntax_ = "invalid";
         return;
       }
-      frame.objectExpectation = "key_after_comma";
+      frame.objectExpectation = "";
     } else {
       if (frame.arrayExpectation !== "comma_or_end") {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] BlockStatement
src/parser.ts:911:12
         return;
       }
       frame.objectExpectation = "key_after_comma";
-    } else {
-      if (frame.arrayExpectation !== "comma_or_end") {
-        this.addDiagnostic(
-          createDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            token.byteStart,
-            "Unexpected ',' in array",
-            false,
-          ),
-        );
-        this.terminal = true;
-        this.syntax_ = "invalid";
-        return;
-      }
-      frame.arrayExpectation = "value_after_comma";
-    }
+    } else {}
   }
 
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/parser.ts:912:11
       }
       frame.objectExpectation = "key_after_comma";
     } else {
-      if (frame.arrayExpectation !== "comma_or_end") {
+      if (true) {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] EqualityOperator
src/parser.ts:912:11
       }
       frame.objectExpectation = "key_after_comma";
     } else {
-      if (frame.arrayExpectation !== "comma_or_end") {
+      if (frame.arrayExpectation === "comma_or_end") {
         this.addDiagnostic(
           createDiagnostic(
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[NoCoverage] BooleanLiteral
src/parser.ts:919:13
             "error",
             token.byteStart,
             "Unexpected ',' in array",
-            false,
+            true,
           ),
         );

[Killed] StringLiteral
src/parser.ts:926:32
         this.syntax_ = "invalid";
         return;
       }
-      frame.arrayExpectation = "value_after_comma";
+      frame.arrayExpectation = "";
     }
   }
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] ConditionalExpression
src/parser.ts:933:9
   private handleString(token: Token): void {
     const frame = this.grammar.current;
 
-    if (!frame) {
+    if (true) {
       // Root-level string value
       this.hasSeenValue = true;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:933:9
   private handleString(token: Token): void {
     const frame = this.grammar.current;
 
-    if (!frame) {
+    if (frame) {
       // Root-level string value
       this.hasSeenValue = true;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/parser.ts:935:27
 
     if (!frame) {
       // Root-level string value
-      this.hasSeenValue = true;
+      this.hasSeenValue = false;
       this.rootComplete = true;
       this.syntax_ = "root_complete";

[Killed] BooleanLiteral
src/parser.ts:936:27
     if (!frame) {
       // Root-level string value
       this.hasSeenValue = true;
-      this.rootComplete = true;
+      this.rootComplete = false;
       this.syntax_ = "root_complete";
       this.events.emitValueCommitted("", token.value, [
killedBy: Parser valid JSON equivalence matches JSON.parse for: "hello"
statusReason: expected 'truncated' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:948:9
 
     if (frame.containerType === "object") {
       if (
-        frame.objectExpectation === "first_key_or_end" ||
-        frame.objectExpectation === "key_after_comma"
+        true
       ) {
         // This is an object key
killedBy: Valid JSON Equivalence matches JSON.parse: {"name":"Alice","age":30}
statusReason: expected {} to deeply equal { name: 'Alice', age: 30 }

[Killed] ConditionalExpression
src/parser.ts:948:9
 
     if (frame.containerType === "object") {
       if (
-        frame.objectExpectation === "first_key_or_end" ||
-        frame.objectExpectation === "key_after_comma"
+        false
       ) {
         // This is an object key
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:949:9
     if (frame.containerType === "object") {
       if (
         frame.objectExpectation === "first_key_or_end" ||
-        frame.objectExpectation === "key_after_comma"
+        false
       ) {
         // This is an object key
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"a":1,"b":2}
statusReason: expected { a: 1 } to deeply equal { a: 1, b: 2 }

[Killed] EqualityOperator
src/parser.ts:949:9
     if (frame.containerType === "object") {
       if (
         frame.objectExpectation === "first_key_or_end" ||
-        frame.objectExpectation === "key_after_comma"
+        frame.objectExpectation !== "key_after_comma"
       ) {
         // This is an object key
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] BlockStatement
src/parser.ts:950:9
       if (
         frame.objectExpectation === "first_key_or_end" ||
         frame.objectExpectation === "key_after_comma"
-      ) {
-        // This is an object key
-        const isNew = this.grammar.registerObjectKey(
-          token.value,
-          token.byteStart,
-        );
-        if (!isNew) {
-          // Duplicate key — skip the upcoming value
-          // The grammar registered the diagnostic already
-          const dupDiags = this.grammar.takeDiagnostics();
-          for (const d of dupDiags) {
-            this.addDiagnostic(d);
-          }
-          frame.objectExpectation = "colon";
-          this.isSkippingValue = true;
-          this.skipValueDepth = 0;
-          return;
-        }
-        frame.objectExpectation = "colon";
-      } else if (frame.objectExpectation === "value") {
+      ) {} else if (frame.objectExpectation === "value") {
         // This is a string value for an object field
         const path = this.grammar.currentValuePath();
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:956:13
           token.value,
           token.byteStart,
         );
-        if (!isNew) {
+        if (false) {
           // Duplicate key — skip the upcoming value
           // The grammar registered the diagnostic already
killedBy: Parser duplicate key detection first value wins for duplicate keys
statusReason: expected { a: 1, b: 3 } to deeply equal { a: 1, b: 2 }

[Killed] BlockStatement
src/parser.ts:956:21
           token.value,
           token.byteStart,
         );
-        if (!isNew) {
-          // Duplicate key — skip the upcoming value
-          // The grammar registered the diagnostic already
-          const dupDiags = this.grammar.takeDiagnostics();
-          for (const d of dupDiags) {
-            this.addDiagnostic(d);
-          }
-          frame.objectExpectation = "colon";
-          this.isSkippingValue = true;
-          this.skipValueDepth = 0;
-          return;
-        }
+        if (!isNew) {}
         frame.objectExpectation = "colon";
       } else if (frame.objectExpectation === "value") {
killedBy: Parser duplicate key detection first value wins for duplicate keys
statusReason: expected { a: 1, b: 3 } to deeply equal { a: 1, b: 2 }

[Killed] BlockStatement
src/parser.ts:960:37
           // Duplicate key — skip the upcoming value
           // The grammar registered the diagnostic already
           const dupDiags = this.grammar.takeDiagnostics();
-          for (const d of dupDiags) {
-            this.addDiagnostic(d);
-          }
+          for (const d of dupDiags) {}
           frame.objectExpectation = "colon";
           this.isSkippingValue = true;
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:964:34
             this.addDiagnostic(d);
           }
           frame.objectExpectation = "colon";
-          this.isSkippingValue = true;
+          this.isSkippingValue = false;
           this.skipValueDepth = 0;
           return;
killedBy: Parser duplicate key detection first value wins for duplicate keys
statusReason: expected { a: 1, b: 3 } to deeply equal { a: 1, b: 2 }

[Killed] BlockStatement
src/parser.ts:969:55
           return;
         }
         frame.objectExpectation = "colon";
-      } else if (frame.objectExpectation === "value") {
-        // This is a string value for an object field
-        const path = this.grammar.currentValuePath();
-        this.events.emitValueCommitted(path, token.value, [
-          token.byteStart,
-          token.byteEnd,
-        ]);
-        this.snapshot_.processEvent({
-          type: "value_committed",
-          sequence: 0,
-          path,
-          operation: "add",
-          value: token.value,
-          byteRange: [token.byteStart, token.byteEnd],
-        });
-        frame.objectExpectation = "comma_or_end";
-      }
+      } else if (frame.objectExpectation === "value") {}
     } else if (frame.containerType === "array") {
       if (
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected {} to deeply equal { path: '/src/app.ts' }

[Killed] EqualityOperator
src/parser.ts:969:18
           return;
         }
         frame.objectExpectation = "colon";
-      } else if (frame.objectExpectation === "value") {
+      } else if (frame.objectExpectation !== "value") {
         // This is a string value for an object field
         const path = this.grammar.currentValuePath();
killedBy: Valid JSON Equivalence matches JSON.parse: {"name":"Alice","age":30}
statusReason: expected {} to deeply equal { name: 'Alice', age: 30 }

[Killed] StringLiteral
src/parser.ts:977:17
           token.byteEnd,
         ]);
         this.snapshot_.processEvent({
-          type: "value_committed",
+          type: "",
           sequence: 0,
           path,
killedBy: Valid JSON Equivalence matches JSON.parse: {"name":"Alice","age":30}
statusReason: expected { age: 30 } to deeply equal { name: 'Alice', age: 30 }

[Killed] ConditionalExpression
src/parser.ts:986:16
         });
         frame.objectExpectation = "comma_or_end";
       }
-    } else if (frame.containerType === "array") {
+    } else if (false) {
       if (
         frame.arrayExpectation !== "first_value_or_end" &&
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1 ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[Killed] LogicalOperator
src/parser.ts:988:9
       }
     } else if (frame.containerType === "array") {
       if (
-        frame.arrayExpectation !== "first_value_or_end" &&
-        frame.arrayExpectation !== "value_after_comma"
+        frame.arrayExpectation !== "first_value_or_end" || frame.arrayExpectation !== "value_after_comma"
       ) {
         this.addDiagnostic(
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1 ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[Killed] BlockStatement
src/parser.ts:990:9
       if (
         frame.arrayExpectation !== "first_value_or_end" &&
         frame.arrayExpectation !== "value_after_comma"
-      ) {
-        this.addDiagnostic(
-          createDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            token.byteStart,
-            "Unexpected string in array",
-            false,
-          ),
-        );
-        this.terminal = true;
-        this.syntax_ = "invalid";
-        return;
-      }
+      ) {}
 
       // Array element
killedBy: Parser Regressions rejects invalid input: ["a" "b"]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Survived] BooleanLiteral
src/parser.ts:997:13
             "error",
             token.byteStart,
             "Unexpected string in array",
-            false,
+            true,
           ),
         );

[Killed] ObjectLiteral
src/parser.ts:1011:35
         token.byteStart,
         token.byteEnd,
       ]);
-      this.snapshot_.processEvent({
-        type: "value_committed",
-        sequence: 0,
-        path,
-        operation: "add",
-        value: token.value,
-        byteRange: [token.byteStart, token.byteEnd],
-      });
+      this.snapshot_.processEvent({});
       this.grammar.advanceArrayIndex();
       frame.arrayExpectation = "comma_or_end";
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"arr":[1,"two",null]}
statusReason: expected { arr: [ 1, undefined, null ] } to deeply equal { arr: [ 1, 'two', null ] }

[Survived] StringLiteral
src/parser.ts:1015:20
         type: "value_committed",
         sequence: 0,
         path,
-        operation: "add",
+        operation: "",
         value: token.value,
         byteRange: [token.byteStart, token.byteEnd],

[Killed] StringLiteral
src/parser.ts:1020:32
         byteRange: [token.byteStart, token.byteEnd],
       });
       this.grammar.advanceArrayIndex();
-      frame.arrayExpectation = "comma_or_end";
+      frame.arrayExpectation = "";
     }
   }
killedBy: Valid JSON Equivalence matches JSON.parse: {"arr":[1,"two",null,false]}
statusReason: expected { arr: [ 1, 'two' ] } to deeply equal { arr: [ 1, 'two', null, false ] }

[Killed] BlockStatement
src/parser.ts:1024:44
     }
   }
 
-  private handleNumber(token: Token): void {
-    const value = Number(token.value);
-    this.commitScalar(value, token);
-  }
+  private handleNumber(token: Token): void {}
 
   private handleLiteral(token: Token): void {
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/parser.ts:1029:45
     this.commitScalar(value, token);
   }
 
-  private handleLiteral(token: Token): void {
-    let value: JsonValue;
-    if (token.type === TokenType.True) value = true;
-    else if (token.type === TokenType.False) value = false;
-    else value = null;
-
-    this.commitScalar(value, token);
-  }
+  private handleLiteral(token: Token): void {}
 
   private commitScalar(value: JsonValue, token: Token): void {
killedBy: Valid JSON Equivalence matches JSON.parse: {"nested":{"x":true}}
statusReason: expected { nested: {} } to deeply equal { nested: { x: true } }

[Killed] BooleanLiteral
src/parser.ts:1031:48
 
   private handleLiteral(token: Token): void {
     let value: JsonValue;
-    if (token.type === TokenType.True) value = true;
+    if (token.type === TokenType.True) value = false;
     else if (token.type === TokenType.False) value = false;
     else value = null;
killedBy: Valid JSON Equivalence matches JSON.parse: {"nested":{"x":true}}
statusReason: expected { nested: { x: false } } to deeply equal { nested: { x: true } }

[Killed] EqualityOperator
src/parser.ts:1031:9
 
   private handleLiteral(token: Token): void {
     let value: JsonValue;
-    if (token.type === TokenType.True) value = true;
+    if (token.type !== TokenType.True) value = true;
     else if (token.type === TokenType.False) value = false;
     else value = null;
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected { nested: { x: null, y: true } } to deeply equal { nested: { x: true, y: false } }

[Killed] BooleanLiteral
src/parser.ts:1032:54
   private handleLiteral(token: Token): void {
     let value: JsonValue;
     if (token.type === TokenType.True) value = true;
-    else if (token.type === TokenType.False) value = false;
+    else if (token.type === TokenType.False) value = true;
     else value = null;
 
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected { nested: { x: true, y: true } } to deeply equal { nested: { x: true, y: false } }

[Killed] ConditionalExpression
src/parser.ts:1032:14
   private handleLiteral(token: Token): void {
     let value: JsonValue;
     if (token.type === TokenType.True) value = true;
-    else if (token.type === TokenType.False) value = false;
+    else if (true) value = false;
     else value = null;
 
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"arr":[1,"two",null]}
statusReason: expected { arr: [ 1, 'two', false ] } to deeply equal { arr: [ 1, 'two', null ] }

[Killed] ConditionalExpression
src/parser.ts:1041:9
   private commitScalar(value: JsonValue, token: Token): void {
     const frame = this.grammar.current;
 
-    if (!frame) {
+    if (false) {
       // Root-level scalar
       this.hasSeenValue = true;
killedBy: Parser finish() finalizes number at complete stream end
statusReason: Cannot read properties of undefined (reading 'containerType')

[Survived] BooleanLiteral
src/parser.ts:1043:27
 
     if (!frame) {
       // Root-level scalar
-      this.hasSeenValue = true;
+      this.hasSeenValue = false;
       this.rootComplete = true;
       this.syntax_ = "root_complete";

[Survived] ArrayDeclaration
src/parser.ts:1046:49
       this.hasSeenValue = true;
       this.rootComplete = true;
       this.syntax_ = "root_complete";
-      this.events.emitValueCommitted("", value, [
-        token.byteStart,
-        token.byteEnd,
-      ]);
+      this.events.emitValueCommitted("", value, []);
       // Store root scalar in snapshot builder
       // For root scalars, we directly set the root value
