[Killed] BlockStatement
src/parser.ts:1056:43
       return;
     }
 
-    if (frame.containerType === "object") {
-      if (frame.objectExpectation === "value") {
-        const path = this.grammar.currentValuePath();
-        this.events.emitValueCommitted(path, value, [
-          token.byteStart,
-          token.byteEnd,
-        ]);
-        this.snapshot_.processEvent({
-          type: "value_committed",
-          sequence: 0,
-          path,
-          operation: "add",
-          value,
-          byteRange: [token.byteStart, token.byteEnd],
-        });
-        frame.objectExpectation = "comma_or_end";
-      }
-    } else if (frame.containerType === "array") {
+    if (frame.containerType === "object") {} else if (frame.containerType === "array") {
       if (
         frame.arrayExpectation !== "first_value_or_end" &&
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] EqualityOperator
src/parser.ts:1057:11
     }
 
     if (frame.containerType === "object") {
-      if (frame.objectExpectation === "value") {
+      if (frame.objectExpectation !== "value") {
         const path = this.grammar.currentValuePath();
         this.events.emitValueCommitted(path, value, [
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected {} to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/parser.ts:1057:11
     }
 
     if (frame.containerType === "object") {
-      if (frame.objectExpectation === "value") {
+      if (false) {
         const path = this.grammar.currentValuePath();
         this.events.emitValueCommitted(path, value, [
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1075:9
       }
     } else if (frame.containerType === "array") {
       if (
-        frame.arrayExpectation !== "first_value_or_end" &&
-        frame.arrayExpectation !== "value_after_comma"
+        false
       ) {
         this.addDiagnostic(
killedBy: Parser Regressions rejects invalid input: [1 2]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Killed] BlockStatement
src/parser.ts:1077:9
       if (
         frame.arrayExpectation !== "first_value_or_end" &&
         frame.arrayExpectation !== "value_after_comma"
-      ) {
-        this.addDiagnostic(
-          createDiagnostic(
-            DiagnosticCode.E_UNEXPECTED_TOKEN,
-            "error",
-            token.byteStart,
-            "Unexpected scalar in array",
-            false,
-          ),
-        );
-        this.terminal = true;
-        this.syntax_ = "invalid";
-        return;
-      }
+      ) {}
 
       const path = this.grammar.currentValuePath();
killedBy: Parser Regressions rejects invalid input: [1 2]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Survived] StringLiteral
src/parser.ts:1083:13
             DiagnosticCode.E_UNEXPECTED_TOKEN,
             "error",
             token.byteStart,
-            "Unexpected scalar in array",
+            "",
             false,
           ),

[Survived] BooleanLiteral
src/parser.ts:1084:13
             "error",
             token.byteStart,
             "Unexpected scalar in array",
-            false,
+            true,
           ),
         );

[Killed] ObjectLiteral
src/parser.ts:1097:35
         token.byteStart,
         token.byteEnd,
       ]);
-      this.snapshot_.processEvent({
-        type: "value_committed",
-        sequence: 0,
-        path,
-        operation: "add",
-        value,
-        byteRange: [token.byteStart, token.byteEnd],
-      });
+      this.snapshot_.processEvent({});
       this.grammar.advanceArrayIndex();
       frame.arrayExpectation = "comma_or_end";
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Survived] ArrayDeclaration
src/parser.ts:1103:20
         path,
         operation: "add",
         value,
-        byteRange: [token.byteStart, token.byteEnd],
+        byteRange: [],
       });
       this.grammar.advanceArrayIndex();

[Killed] BlockStatement
src/parser.ts:1110:80
     }
   }
 
-  private commitContainerToParent(_containerPath: string, _token: Token): void {
-    const parentFrame = this.grammar.current;
-    if (!parentFrame) return;
-
-    if (parentFrame.containerType === "object") {
-      // The closed container was a value in the parent object
-      // The value_committed for the object field is implicitly done
-      // when the container closes
-      parentFrame.objectExpectation = "comma_or_end";
-    } else if (parentFrame.containerType === "array") {
-      this.grammar.advanceArrayIndex();
-      parentFrame.arrayExpectation = "comma_or_end";
-    }
-  }
+  private commitContainerToParent(_containerPath: string, _token: Token): void {}
 
   // -----------------------------------------------------------------------
killedBy: Valid JSON Equivalence matches JSON.parse: {"nested":{"x":true}}
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of +0 but got 2

[Killed] BooleanLiteral
src/parser.ts:1112:9
 
   private commitContainerToParent(_containerPath: string, _token: Token): void {
     const parentFrame = this.grammar.current;
-    if (!parentFrame) return;
+    if (parentFrame) return;
 
     if (parentFrame.containerType === "object") {
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1112:9
 
   private commitContainerToParent(_containerPath: string, _token: Token): void {
     const parentFrame = this.grammar.current;
-    if (!parentFrame) return;
+    if (true) return;
 
     if (parentFrame.containerType === "object") {
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1114:9
     const parentFrame = this.grammar.current;
     if (!parentFrame) return;
 
-    if (parentFrame.containerType === "object") {
+    if (false) {
       // The closed container was a value in the parent object
       // The value_committed for the object field is implicitly done
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/parser.ts:1114:49
     const parentFrame = this.grammar.current;
     if (!parentFrame) return;
 
-    if (parentFrame.containerType === "object") {
-      // The closed container was a value in the parent object
-      // The value_committed for the object field is implicitly done
-      // when the container closes
-      parentFrame.objectExpectation = "comma_or_end";
-    } else if (parentFrame.containerType === "array") {
+    if (parentFrame.containerType === "object") {} else if (parentFrame.containerType === "array") {
       this.grammar.advanceArrayIndex();
       parentFrame.arrayExpectation = "comma_or_end";
killedBy: Parser valid JSON equivalence matches JSON.parse for: {"nested":{"x":true,"y":false}}
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:1119:55
       // The value_committed for the object field is implicitly done
       // when the container closes
       parentFrame.objectExpectation = "comma_or_end";
-    } else if (parentFrame.containerType === "array") {
-      this.grammar.advanceArrayIndex();
-      parentFrame.arrayExpectation = "comma_or_end";
-    }
+    } else if (parentFrame.containerType === "array") {}
   }
 
killedBy: Parser Regressions rejects invalid input: [{} {}]
statusReason: expected [ 'invalid', 'incomplete' ] to include 'root_complete'

[Killed] EqualityOperator
src/parser.ts:1119:16
       // The value_committed for the object field is implicitly done
       // when the container closes
       parentFrame.objectExpectation = "comma_or_end";
-    } else if (parentFrame.containerType === "array") {
+    } else if (parentFrame.containerType !== "array") {
       this.grammar.advanceArrayIndex();
       parentFrame.arrayExpectation = "comma_or_end";
killedBy: Valid JSON Equivalence matches JSON.parse: [{"x":1},{"y":2}]
statusReason: expected [ { x: 1 } ] to deeply equal [ { x: 1 }, { y: 2 } ]

[Killed] BlockStatement
src/parser.ts:1129:49
   // Helpers
   // -----------------------------------------------------------------------
 
-  private addDiagnostic(diag: Diagnostic): void {
-    this.allDiagnostics.push(diag);
-    this.events.emitDiagnostic(diag);
-  }
+  private addDiagnostic(diag: Diagnostic): void {}
 
   private isExecutable(): boolean {
killedBy: Mutation Killer — Scanner Cross-Chunk & Edge Cases finalizes incomplete literal at stream end with error diagnostic
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parser.ts:1135:9
   }
 
   private isExecutable(): boolean {
-    if (this.phase !== "finished") return false;
+    if (this.phase === "finished") return false;
     if (!this.rootComplete) return false;
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1135:9
   }
 
   private isExecutable(): boolean {
-    if (this.phase !== "finished") return false;
+    if (true) return false;
     if (!this.rootComplete) return false;
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:1136:9
 
   private isExecutable(): boolean {
     if (this.phase !== "finished") return false;
-    if (!this.rootComplete) return false;
+    if (this.rootComplete) return false;
 
     const reason = this.finishMeta?.reason ?? "unknown";
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:1136:36
 
   private isExecutable(): boolean {
     if (this.phase !== "finished") return false;
-    if (!this.rootComplete) return false;
+    if (!this.rootComplete) return true;
 
     const reason = this.finishMeta?.reason ?? "unknown";
killedBy: Parser finish() returns truncated for incomplete JSON with length reason
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/parser.ts:1138:20
     if (this.phase !== "finished") return false;
     if (!this.rootComplete) return false;
 
-    const reason = this.finishMeta?.reason ?? "unknown";
+    const reason = this.finishMeta?.reason && "unknown";
     if (
       reason === "length" ||
killedBy: Parser finish() returns valid outcome for complete JSON
statusReason: expected false to be true // Object.is equality

[Survived] OptionalChaining
src/parser.ts:1138:20
     if (this.phase !== "finished") return false;
     if (!this.rootComplete) return false;
 
-    const reason = this.finishMeta?.reason ?? "unknown";
+    const reason = this.finishMeta.reason ?? "unknown";
     if (
       reason === "length" ||

[Killed] ConditionalExpression
src/parser.ts:1140:7
 
     const reason = this.finishMeta?.reason ?? "unknown";
     if (
-      reason === "length" ||
-      reason === "network_error" ||
-      reason === "provider_error" ||
-      reason === "cancelled" ||
-      reason === "unknown"
+      false
     ) {
       return false;
killedBy: Parser finish() returns non-executable for abnormal end reason
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1140:7
 
     const reason = this.finishMeta?.reason ?? "unknown";
     if (
-      reason === "length" ||
-      reason === "network_error" ||
-      reason === "provider_error" ||
+      false ||
       reason === "cancelled" ||
       reason === "unknown"
killedBy: Parser finish() returns non-executable for abnormal end reason
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/parser.ts:1141:7
     const reason = this.finishMeta?.reason ?? "unknown";
     if (
       reason === "length" ||
-      reason === "network_error" ||
+      reason !== "network_error" ||
       reason === "provider_error" ||
       reason === "cancelled" ||
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1141:7
     const reason = this.finishMeta?.reason ?? "unknown";
     if (
       reason === "length" ||
-      reason === "network_error" ||
+      false ||
       reason === "provider_error" ||
       reason === "cancelled" ||
killedBy: Finish Honesty complete vs network_error: different executable
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1142:7
     if (
       reason === "length" ||
       reason === "network_error" ||
-      reason === "provider_error" ||
+      false ||
       reason === "cancelled" ||
       reason === "unknown"
killedBy: Executable Policy is not executable when finish reason is provider_error
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/parser.ts:1142:7
     if (
       reason === "length" ||
       reason === "network_error" ||
-      reason === "provider_error" ||
+      reason !== "provider_error" ||
       reason === "cancelled" ||
       reason === "unknown"
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/parser.ts:1143:7
       reason === "length" ||
       reason === "network_error" ||
       reason === "provider_error" ||
-      reason === "cancelled" ||
+      reason !== "cancelled" ||
       reason === "unknown"
     ) {
killedBy: Finish Honesty complete vs length: different executable for complete root
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1143:7
       reason === "length" ||
       reason === "network_error" ||
       reason === "provider_error" ||
-      reason === "cancelled" ||
+      false ||
       reason === "unknown"
     ) {
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='valid' when root is complete and reason is 'cancelled'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/parser.ts:1144:7
       reason === "network_error" ||
       reason === "provider_error" ||
       reason === "cancelled" ||
-      reason === "unknown"
+      reason !== "unknown"
     ) {
       return false;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1144:7
       reason === "network_error" ||
       reason === "provider_error" ||
       reason === "cancelled" ||
-      reason === "unknown"
+      false
     ) {
       return false;
killedBy: Executable Policy is not executable when finish reason is unknown
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/parser.ts:1145:7
       reason === "provider_error" ||
       reason === "cancelled" ||
       reason === "unknown"
-    ) {
-      return false;
-    }
+    ) {}
 
     if (this.grammar.hasDuplicate) return false;
killedBy: Executable Policy is not executable when finish reason is unknown
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:1149:43
       return false;
     }
 
-    if (this.grammar.hasDuplicate) return false;
+    if (this.grammar.hasDuplicate) return true;
     if (this.hasFatalDiagnostic()) return false;
     if (this.hasNonRecoverableError()) return false;
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1149:9
       return false;
     }
 
-    if (this.grammar.hasDuplicate) return false;
+    if (true) return false;
     if (this.hasFatalDiagnostic()) return false;
     if (this.hasNonRecoverableError()) return false;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1150:9
     }
 
     if (this.grammar.hasDuplicate) return false;
-    if (this.hasFatalDiagnostic()) return false;
+    if (true) return false;
     if (this.hasNonRecoverableError()) return false;
     if (this.allRepairs.some(
killedBy: Executable Policy is executable when finish reason is complete with valid root
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:1150:9
     }
 
     if (this.grammar.hasDuplicate) return false;
-    if (this.hasFatalDiagnostic()) return false;
+    if (false) return false;
     if (this.hasNonRecoverableError()) return false;
     if (this.allRepairs.some(

[Killed] ConditionalExpression
src/parser.ts:1151:9
 
     if (this.grammar.hasDuplicate) return false;
     if (this.hasFatalDiagnostic()) return false;
-    if (this.hasNonRecoverableError()) return false;
+    if (true) return false;
     if (this.allRepairs.some(
       (r) => r.impact === "structural" || r.impact === "lossy",
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:1151:9
 
     if (this.grammar.hasDuplicate) return false;
     if (this.hasFatalDiagnostic()) return false;
-    if (this.hasNonRecoverableError()) return false;
+    if (false) return false;
     if (this.allRepairs.some(
       (r) => r.impact === "structural" || r.impact === "lossy",

[Killed] ConditionalExpression
src/parser.ts:1152:9
     if (this.grammar.hasDuplicate) return false;
     if (this.hasFatalDiagnostic()) return false;
     if (this.hasNonRecoverableError()) return false;
-    if (this.allRepairs.some(
-      (r) => r.impact === "structural" || r.impact === "lossy",
-    )) {
+    if (true) {
       return false;
     }
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/parser.ts:1152:9
     if (this.grammar.hasDuplicate) return false;
     if (this.hasFatalDiagnostic()) return false;
     if (this.hasNonRecoverableError()) return false;
-    if (this.allRepairs.some(
-      (r) => r.impact === "structural" || r.impact === "lossy",
-    )) {
+    if (this.allRepairs.every(r => r.impact === "structural" || r.impact === "lossy")) {
       return false;
     }
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:1153:43
     if (this.hasFatalDiagnostic()) return false;
     if (this.hasNonRecoverableError()) return false;
     if (this.allRepairs.some(
-      (r) => r.impact === "structural" || r.impact === "lossy",
+      (r) => r.impact === "structural" || false,
     )) {
       return false;

[Survived] ArrowFunction
src/parser.ts:1153:7
     if (this.hasFatalDiagnostic()) return false;
     if (this.hasNonRecoverableError()) return false;
     if (this.allRepairs.some(
-      (r) => r.impact === "structural" || r.impact === "lossy",
+      () => undefined,
     )) {
       return false;

[NoCoverage] BlockStatement
src/parser.ts:1154:8
     if (this.hasNonRecoverableError()) return false;
     if (this.allRepairs.some(
       (r) => r.impact === "structural" || r.impact === "lossy",
-    )) {
-      return false;
-    }
+    )) {}
 
     const pendingInfo = this.scanner.getPendingInfo();

[NoCoverage] BooleanLiteral
src/parser.ts:1155:14
     if (this.allRepairs.some(
       (r) => r.impact === "structural" || r.impact === "lossy",
     )) {
-      return false;
+      return true;
     }
 

[Killed] EqualityOperator
src/parser.ts:1159:9
     }
 
     const pendingInfo = this.scanner.getPendingInfo();
-    if (pendingInfo.type !== "none") return false;
+    if (pendingInfo.type === "none") return false;
     
     if (this.trailingDataSeen) return false;
killedBy: Executable Policy is executable when finish reason is complete with valid root
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1159:9
     }
 
     const pendingInfo = this.scanner.getPendingInfo();
-    if (pendingInfo.type !== "none") return false;
+    if (true) return false;
     
     if (this.trailingDataSeen) return false;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1161:9
     const pendingInfo = this.scanner.getPendingInfo();
     if (pendingInfo.type !== "none") return false;
     
-    if (this.trailingDataSeen) return false;
+    if (false) return false;
 
     return true;
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/parser.ts:1161:39
     const pendingInfo = this.scanner.getPendingInfo();
     if (pendingInfo.type !== "none") return false;
     
-    if (this.trailingDataSeen) return false;
+    if (this.trailingDataSeen) return true;
 
     return true;
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
src/parser.ts:1166:41
     return true;
   }
 
-  private hasFatalDiagnostic(): boolean {
-    return this.allDiagnostics.some((d) => d.severity === "fatal");
-  }
+  private hasFatalDiagnostic(): boolean {}
 
   private hasNonRecoverableError(): boolean {

[Killed] ConditionalExpression
src/parser.ts:1167:44
   }
 
   private hasFatalDiagnostic(): boolean {
-    return this.allDiagnostics.some((d) => d.severity === "fatal");
+    return this.allDiagnostics.some((d) => true);
   }
 
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'

[Killed] MethodExpression
src/parser.ts:1167:12
   }
 
   private hasFatalDiagnostic(): boolean {
-    return this.allDiagnostics.some((d) => d.severity === "fatal");
+    return this.allDiagnostics.every(d => d.severity === "fatal");
   }
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Survived] BlockStatement
src/parser.ts:1170:45
     return this.allDiagnostics.some((d) => d.severity === "fatal");
   }
 
-  private hasNonRecoverableError(): boolean {
-    return this.allDiagnostics.some(
-      (d) =>
-        (d.severity === "error" || d.severity === "fatal") && !d.recoverable,
-    );
-  }
+  private hasNonRecoverableError(): boolean {}
 
   private determineOutcome(

[Killed] MethodExpression
src/parser.ts:1171:12
   }
 
   private hasNonRecoverableError(): boolean {
-    return this.allDiagnostics.some(
-      (d) =>
-        (d.severity === "error" || d.severity === "fatal") && !d.recoverable,
-    );
+    return this.allDiagnostics.every(d => (d.severity === "error" || d.severity === "fatal") && !d.recoverable);
   }
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
src/parser.ts:1172:7
 
   private hasNonRecoverableError(): boolean {
     return this.allDiagnostics.some(
-      (d) =>
-        (d.severity === "error" || d.severity === "fatal") && !d.recoverable,
+      () => undefined,
     );
   }

[Survived] ConditionalExpression
src/parser.ts:1173:10
   private hasNonRecoverableError(): boolean {
     return this.allDiagnostics.some(
       (d) =>
-        (d.severity === "error" || d.severity === "fatal") && !d.recoverable,
+        (true) && !d.recoverable,
     );
   }

[Survived] LogicalOperator
src/parser.ts:1173:10
   private hasNonRecoverableError(): boolean {
     return this.allDiagnostics.some(
       (d) =>
-        (d.severity === "error" || d.severity === "fatal") && !d.recoverable,
+        (d.severity === "error" && d.severity === "fatal") && !d.recoverable,
     );
   }

[Killed] BlockStatement
src/parser.ts:1179:29
 
   private determineOutcome(
     reason: StreamEndReason,
-  ): FinalResult["outcome"] {
-    if (this.syntax_ === "invalid") return "invalid";
-    if (this.hasFatalDiagnostic()) return "invalid";
-    if (this.grammar.hasDuplicate) return "invalid";
-    
-    // Check if salvaged
-    const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
-    if (hasSalvage) return "salvaged";
-
-    if (!this.rootComplete) return "truncated";
-
-    if (reason !== "complete" && reason !== "unknown") {
-      // Reason indicates stream was cut off, but root is magically complete?
-      // Since it's complete, the parsed JSON is fully intact.
-      // We consider it valid, but potentially non-executable depending on policy.
-      return "valid";
-    }
-
-    return "valid";
-  }
+  ): FinalResult["outcome"] {}
 
   private buildStableValue(): JsonValue | undefined {
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected undefined to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1180:9
   private determineOutcome(
     reason: StreamEndReason,
   ): FinalResult["outcome"] {
-    if (this.syntax_ === "invalid") return "invalid";
+    if (false) return "invalid";
     if (this.hasFatalDiagnostic()) return "invalid";
     if (this.grammar.hasDuplicate) return "invalid";
killedBy: Fuzz Corpus fuzz: fuzz-string-001 - Fuzz String 0
statusReason: expected 'truncated' to be 'invalid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1180:9
   private determineOutcome(
     reason: StreamEndReason,
   ): FinalResult["outcome"] {
-    if (this.syntax_ === "invalid") return "invalid";
+    if (true) return "invalid";
     if (this.hasFatalDiagnostic()) return "invalid";
     if (this.grammar.hasDuplicate) return "invalid";
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1181:9
     reason: StreamEndReason,
   ): FinalResult["outcome"] {
     if (this.syntax_ === "invalid") return "invalid";
-    if (this.hasFatalDiagnostic()) return "invalid";
+    if (true) return "invalid";
     if (this.grammar.hasDuplicate) return "invalid";
     
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Survived] ConditionalExpression
src/parser.ts:1181:9
     reason: StreamEndReason,
   ): FinalResult["outcome"] {
     if (this.syntax_ === "invalid") return "invalid";
-    if (this.hasFatalDiagnostic()) return "invalid";
+    if (false) return "invalid";
     if (this.grammar.hasDuplicate) return "invalid";
     

[Killed] ConditionalExpression
src/parser.ts:1182:9
   ): FinalResult["outcome"] {
     if (this.syntax_ === "invalid") return "invalid";
     if (this.hasFatalDiagnostic()) return "invalid";
-    if (this.grammar.hasDuplicate) return "invalid";
+    if (false) return "invalid";
     
     // Check if salvaged
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected 'valid' to be 'invalid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1182:9
   ): FinalResult["outcome"] {
     if (this.syntax_ === "invalid") return "invalid";
     if (this.hasFatalDiagnostic()) return "invalid";
-    if (this.grammar.hasDuplicate) return "invalid";
+    if (true) return "invalid";
     
     // Check if salvaged
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected 'invalid' to be 'valid' // Object.is equality

[Killed] ArrowFunction
src/parser.ts:1185:45
     if (this.grammar.hasDuplicate) return "invalid";
     
     // Check if salvaged
-    const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
+    const hasSalvage = this.allRepairs.some(() => undefined);
     if (hasSalvage) return "salvaged";
 
killedBy: Salvage Regressions when safe-only is configured salvages safe cases successfully
statusReason: expected 'valid' to be 'salvaged' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1185:52
     if (this.grammar.hasDuplicate) return "invalid";
     
     // Check if salvaged
-    const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
+    const hasSalvage = this.allRepairs.some((r) => true);
     if (hasSalvage) return "salvaged";
 
killedBy: Parser trailing data detects trailing non-whitespace data
statusReason: expected 'salvaged' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1186:9
     
     // Check if salvaged
     const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
-    if (hasSalvage) return "salvaged";
+    if (false) return "salvaged";
 
     if (!this.rootComplete) return "truncated";
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='salvaged' when containers are safely closed at finish
statusReason: expected 'valid' to be 'salvaged' // Object.is equality
