[Killed] ConditionalExpression
src/parser.ts:1186:9
     
     // Check if salvaged
     const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
-    if (hasSalvage) return "salvaged";
+    if (true) return "salvaged";
 
     if (!this.rootComplete) return "truncated";
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'salvaged' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1188:9
     const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
     if (hasSalvage) return "salvaged";
 
-    if (!this.rootComplete) return "truncated";
+    if (true) return "truncated";
 
     if (reason !== "complete" && reason !== "unknown") {
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'truncated' to be 'valid' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1188:9
     const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
     if (hasSalvage) return "salvaged";
 
-    if (!this.rootComplete) return "truncated";
+    if (false) return "truncated";
 
     if (reason !== "complete" && reason !== "unknown") {
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'valid'

[Survived] EqualityOperator
src/parser.ts:1190:34
 
     if (!this.rootComplete) return "truncated";
 
-    if (reason !== "complete" && reason !== "unknown") {
+    if (reason !== "complete" && reason === "unknown") {
       // Reason indicates stream was cut off, but root is magically complete?
       // Since it's complete, the parsed JSON is fully intact.

[Survived] EqualityOperator
src/parser.ts:1190:9
 
     if (!this.rootComplete) return "truncated";
 
-    if (reason !== "complete" && reason !== "unknown") {
+    if (reason === "complete" && reason !== "unknown") {
       // Reason indicates stream was cut off, but root is magically complete?
       // Since it's complete, the parsed JSON is fully intact.

[Killed] StringLiteral
src/parser.ts:1194:14
       // Reason indicates stream was cut off, but root is magically complete?
       // Since it's complete, the parsed JSON is fully intact.
       // We consider it valid, but potentially non-executable depending on policy.
-      return "valid";
+      return "";
     }
 
killedBy: Mutation Killer — Finish Outcome & Executable Policy returns outcome='valid' when root is complete even if reason is not 'complete'
statusReason: expected '' to be 'valid' // Object.is equality

[Killed] StringLiteral
src/parser.ts:1197:12
       return "valid";
     }
 
-    return "valid";
+    return "";
   }
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected '' to be 'valid' // Object.is equality

[Killed] BlockStatement
src/parser.ts:1200:53
     return "valid";
   }
 
-  private buildStableValue(): JsonValue | undefined {
-    if (this.rootScalarValue !== undefined) return this.rootScalarValue;
-    return this.snapshot_.getStableValue();
-  }
+  private buildStableValue(): JsonValue | undefined {}
 
   private buildPendingTokens(): PendingToken[] {
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected undefined to deeply equal { path: '/src/app.ts' }

[Killed] ConditionalExpression
src/parser.ts:1201:9
   }
 
   private buildStableValue(): JsonValue | undefined {
-    if (this.rootScalarValue !== undefined) return this.rootScalarValue;
+    if (false) return this.rootScalarValue;
     return this.snapshot_.getStableValue();
   }
killedBy: Valid JSON Equivalence matches JSON.parse: "standalone string"
statusReason: expected undefined to deeply equal 'standalone string'

[Killed] EqualityOperator
src/parser.ts:1201:9
   }
 
   private buildStableValue(): JsonValue | undefined {
-    if (this.rootScalarValue !== undefined) return this.rootScalarValue;
+    if (this.rootScalarValue === undefined) return this.rootScalarValue;
     return this.snapshot_.getStableValue();
   }
killedBy: Mutation Killer — Byte Range Accuracy accurately handles 2-byte, 3-byte, and 4-byte UTF-8 string pushes for getUtf8ByteLength
statusReason: expected undefined to deeply equal { str: '£€𐍈' }

[Killed] BlockStatement
src/parser.ts:1205:48
     return this.snapshot_.getStableValue();
   }
 
-  private buildPendingTokens(): PendingToken[] {
-    const pending: PendingToken[] = [];
-    const info = this.scanner.getPendingInfo();
-
-    if (info.type !== "none") {
-      pending.push({
-        type: info.type === "object_key" as string ? "object_key" : info.type,
-        path: this.grammar.currentValuePath(),
-        buffered: info.buffer,
-        byteOffset: info.byteStart,
-      } as PendingToken);
-    }
-
-    return pending;
-  }
+  private buildPendingTokens(): PendingToken[] {}
 }
 
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/parser.ts:1209:9
     const pending: PendingToken[] = [];
     const info = this.scanner.getPendingInfo();
 
-    if (info.type !== "none") {
+    if (false) {
       pending.push({
         type: info.type === "object_key" as string ? "object_key" : info.type,
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/parser.ts:1209:9
     const pending: PendingToken[] = [];
     const info = this.scanner.getPendingInfo();
 
-    if (info.type !== "none") {
+    if (true) {
       pending.push({
         type: info.type === "object_key" as string ? "object_key" : info.type,
killedBy: Mutation Killer — Snapshot Pending Tokens returns empty pending when syntax is structural and no pending token
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Killed] BlockStatement
src/parser.ts:1225:48
 /**
  * Get the UTF-8 byte length of a character.
  */
-function getUtf8ByteLength(ch: string): number {
-  const code = ch.codePointAt(0) ?? 0;
-  if (code <= 0x7f) return 1;
-  if (code <= 0x7ff) return 2;
-  if (code <= 0xffff) return 3;
-  return 4;
-}
+function getUtf8ByteLength(ch: string): number {}
 
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'object_key', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Survived] LogicalOperator
src/parser.ts:1226:16
  * Get the UTF-8 byte length of a character.
  */
 function getUtf8ByteLength(ch: string): number {
-  const code = ch.codePointAt(0) ?? 0;
+  const code = ch.codePointAt(0) && 0;
   if (code <= 0x7f) return 1;
   if (code <= 0x7ff) return 2;

[Killed] EqualityOperator
src/parser.ts:1227:7
  */
 function getUtf8ByteLength(ch: string): number {
   const code = ch.codePointAt(0) ?? 0;
-  if (code <= 0x7f) return 1;
+  if (code > 0x7f) return 1;
   if (code <= 0x7ff) return 2;
   if (code <= 0xffff) return 3;
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'object_key', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Killed] ConditionalExpression
src/parser.ts:1227:7
  */
 function getUtf8ByteLength(ch: string): number {
   const code = ch.codePointAt(0) ?? 0;
-  if (code <= 0x7f) return 1;
+  if (false) return 1;
   if (code <= 0x7ff) return 2;
   if (code <= 0xffff) return 3;
killedBy: Mutation Killer — Snapshot Pending Tokens reports pending unterminated string key with byteOffset of opening quote
statusReason: expected { type: 'object_key', path: '', …(2) } to deeply equal { type: 'object_key', path: '', …(2) }

[Survived] ConditionalExpression
src/parser.ts:1228:7
 function getUtf8ByteLength(ch: string): number {
   const code = ch.codePointAt(0) ?? 0;
   if (code <= 0x7f) return 1;
-  if (code <= 0x7ff) return 2;
+  if (true) return 2;
   if (code <= 0xffff) return 3;
   return 4;

[Survived] ConditionalExpression
src/parser.ts:1228:7
 function getUtf8ByteLength(ch: string): number {
   const code = ch.codePointAt(0) ?? 0;
   if (code <= 0x7f) return 1;
-  if (code <= 0x7ff) return 2;
+  if (false) return 2;
   if (code <= 0xffff) return 3;
   return 4;

[Survived] ConditionalExpression
src/parser.ts:1229:7
   const code = ch.codePointAt(0) ?? 0;
   if (code <= 0x7f) return 1;
   if (code <= 0x7ff) return 2;
-  if (code <= 0xffff) return 3;
+  if (true) return 3;
   return 4;
 }

[Survived] ConditionalExpression
src/parser.ts:1229:7
   const code = ch.codePointAt(0) ?? 0;
   if (code <= 0x7f) return 1;
   if (code <= 0x7ff) return 2;
-  if (code <= 0xffff) return 3;
+  if (false) return 3;
   return 4;
 }
