[Killed] ArrayDeclaration
src/utf8/decoder.ts:49:33
   /** Total bytes processed across all push() calls. */
   private totalOffset = 0;
   
-  private bomBuffer: number[] = [];
+  private bomBuffer: number[] = ["Stryker was here"];
   private checkedForBom = false;
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Survived] BooleanLiteral
src/utf8/decoder.ts:50:27
   private totalOffset = 0;
   
   private bomBuffer: number[] = [];
-  private checkedForBom = false;
+  private checkedForBom = true;
 
   /**

[Killed] ArrayDeclaration
src/utf8/decoder.ts:57:33
    * Incomplete trailing multi-byte sequences are buffered for the next call.
    */
   decode(bytes: Uint8Array): DecodeResult {
-    const errors: Utf8Error[] = [];
+    const errors: Utf8Error[] = ["Stryker was here"];
     const codePoints: number[] = [];
     let strippedBom = false;
killedBy: Utf8Decoder ASCII decodes pure ASCII
statusReason: expected [ 'Stryker was here' ] to have a length of +0 but got 1

[Killed] ArrayDeclaration
src/utf8/decoder.ts:58:34
    */
   decode(bytes: Uint8Array): DecodeResult {
     const errors: Utf8Error[] = [];
-    const codePoints: number[] = [];
+    const codePoints: number[] = ["Stryker was here"];
     let strippedBom = false;
     let i = 0;
killedBy: Utf8Decoder ASCII decodes pure ASCII
statusReason: Invalid code point NaN

[Killed] BooleanLiteral
src/utf8/decoder.ts:59:23
   decode(bytes: Uint8Array): DecodeResult {
     const errors: Utf8Error[] = [];
     const codePoints: number[] = [];
-    let strippedBom = false;
+    let strippedBom = true;
     let i = 0;
 
killedBy: Chunk Invariance simple object: all partitions produce same result
statusReason: repairs count: single vs partition-1 (13 chunks): expected 1 to be 13 // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:63:9
     let i = 0;
 
     // Handle BOM check at the very beginning of the stream
-    if (!this.checkedForBom) {
+    if (true) {
       while (this.bomBuffer.length < 3 && i < bytes.length) {
         this.bomBuffer.push(bytes[i] as number);
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected [ Array(2) ] to have a length of +0 but got 2

[Survived] BooleanLiteral
src/utf8/decoder.ts:63:9
     let i = 0;
 
     // Handle BOM check at the very beginning of the stream
-    if (!this.checkedForBom) {
+    if (this.checkedForBom) {
       while (this.bomBuffer.length < 3 && i < bytes.length) {
         this.bomBuffer.push(bytes[i] as number);

[Killed] EqualityOperator
src/utf8/decoder.ts:64:43
 
     // Handle BOM check at the very beginning of the stream
     if (!this.checkedForBom) {
-      while (this.bomBuffer.length < 3 && i < bytes.length) {
+      while (this.bomBuffer.length < 3 && i <= bytes.length) {
         this.bomBuffer.push(bytes[i] as number);
         i++;
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 2 tests
{ seed: 657474067, path: "1:0", endOnFailure: true }
Counterexample: [[],[1]]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/utf8/decoder.ts:64:43
 
     // Handle BOM check at the very beginning of the stream
     if (!this.checkedForBom) {
-      while (this.bomBuffer.length < 3 && i < bytes.length) {
+      while (this.bomBuffer.length < 3 && i >= bytes.length) {
         this.bomBuffer.push(bytes[i] as number);
         i++;
killedBy: Parser push() returns empty for empty string
statusReason: expected 'invalid' to be 'empty' // Object.is equality

[Killed] UpdateOperator
src/utf8/decoder.ts:66:9
     if (!this.checkedForBom) {
       while (this.bomBuffer.length < 3 && i < bytes.length) {
         this.bomBuffer.push(bytes[i] as number);
-        i++;
+        i--;
       }
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] LogicalOperator
src/utf8/decoder.ts:70:9
       }
 
       const isBomPrefix =
-        (this.bomBuffer[0] === 0xef) &&
-        (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
-        (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
+        this.bomBuffer[0] === 0xef && (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) || this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf;
 
       if (isBomPrefix && this.bomBuffer.length < 3) {
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[Killed] ConditionalExpression
src/utf8/decoder.ts:70:9
       }
 
       const isBomPrefix =
-        (this.bomBuffer[0] === 0xef) &&
-        (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
-        (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
+        true;
 
       if (isBomPrefix && this.bomBuffer.length < 3) {
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[NoCoverage] EqualityOperator
src/utf8/decoder.ts:71:39
 
       const isBomPrefix =
         (this.bomBuffer[0] === 0xef) &&
-        (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
+        (this.bomBuffer.length < 2 || this.bomBuffer[1] !== 0xbb) &&
         (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
 

[NoCoverage] ConditionalExpression
src/utf8/decoder.ts:71:10
 
       const isBomPrefix =
         (this.bomBuffer[0] === 0xef) &&
-        (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
+        (true) &&
         (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
 

[NoCoverage] ConditionalExpression
src/utf8/decoder.ts:72:39
       const isBomPrefix =
         (this.bomBuffer[0] === 0xef) &&
         (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
-        (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
+        (this.bomBuffer.length < 3 || false);
 
       if (isBomPrefix && this.bomBuffer.length < 3) {

[NoCoverage] LogicalOperator
src/utf8/decoder.ts:72:10
       const isBomPrefix =
         (this.bomBuffer[0] === 0xef) &&
         (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
-        (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
+        (this.bomBuffer.length < 3 && this.bomBuffer[2] === 0xbf);
 
       if (isBomPrefix && this.bomBuffer.length < 3) {

[Killed] ConditionalExpression
src/utf8/decoder.ts:74:11
         (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
         (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
 
-      if (isBomPrefix && this.bomBuffer.length < 3) {
+      if (true) {
         // Still possibly a BOM, wait for more data
         return { text: "", consumed: i, errors, strippedBom: false };
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected undefined to deeply equal { a: 1 }

[Killed] LogicalOperator
src/utf8/decoder.ts:74:11
         (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
         (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
 
-      if (isBomPrefix && this.bomBuffer.length < 3) {
+      if (isBomPrefix || this.bomBuffer.length < 3) {
         // Still possibly a BOM, wait for more data
         return { text: "", consumed: i, errors, strippedBom: false };
killedBy: Valid JSON Equivalence matches JSON.parse: 42
statusReason: expected undefined to deeply equal 42

[NoCoverage] BooleanLiteral
src/utf8/decoder.ts:76:62
 
       if (isBomPrefix && this.bomBuffer.length < 3) {
         // Still possibly a BOM, wait for more data
-        return { text: "", consumed: i, errors, strippedBom: false };
+        return { text: "", consumed: i, errors, strippedBom: true };
       }
 

[NoCoverage] StringLiteral
src/utf8/decoder.ts:76:24
 
       if (isBomPrefix && this.bomBuffer.length < 3) {
         // Still possibly a BOM, wait for more data
-        return { text: "", consumed: i, errors, strippedBom: false };
+        return { text: "Stryker was here!", consumed: i, errors, strippedBom: false };
       }
 

[Killed] BooleanLiteral
src/utf8/decoder.ts:79:28
         return { text: "", consumed: i, errors, strippedBom: false };
       }
 
-      this.checkedForBom = true;
+      this.checkedForBom = false;
       let bufferToProcess = new Uint8Array();
 
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 3 tests
{ seed: -497094744, path: "2:1:0:0:2:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:2:1:1:2:3:1:1:1:2:1:3:3:0:0", endOnFailure: true }
Counterexample: [[],[1]]
Shrunk 71 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utf8/decoder.ts:83:9
       let bufferToProcess = new Uint8Array();
 
       if (
-        this.bomBuffer.length >= 3 &&
-        this.bomBuffer[0] === 0xef &&
-        this.bomBuffer[1] === 0xbb &&
-        this.bomBuffer[2] === 0xbf
+        true
       ) {
         strippedBom = true;
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected undefined to deeply equal { a: 1 }

[Survived] LogicalOperator
src/utf8/decoder.ts:83:9
       let bufferToProcess = new Uint8Array();
 
       if (
-        this.bomBuffer.length >= 3 &&
-        this.bomBuffer[0] === 0xef &&
-        this.bomBuffer[1] === 0xbb &&
-        this.bomBuffer[2] === 0xbf
+        this.bomBuffer.length >= 3 && this.bomBuffer[0] === 0xef && this.bomBuffer[1] === 0xbb || this.bomBuffer[2] === 0xbf
       ) {
         strippedBom = true;

[Survived] EqualityOperator
src/utf8/decoder.ts:84:9
 
       if (
         this.bomBuffer.length >= 3 &&
-        this.bomBuffer[0] === 0xef &&
+        this.bomBuffer[0] !== 0xef &&
         this.bomBuffer[1] === 0xbb &&
         this.bomBuffer[2] === 0xbf

[Survived] ConditionalExpression
src/utf8/decoder.ts:84:9
 
       if (
         this.bomBuffer.length >= 3 &&
-        this.bomBuffer[0] === 0xef &&
+        true &&
         this.bomBuffer[1] === 0xbb &&
         this.bomBuffer[2] === 0xbf

[NoCoverage] ConditionalExpression
src/utf8/decoder.ts:85:9
       if (
         this.bomBuffer.length >= 3 &&
         this.bomBuffer[0] === 0xef &&
-        this.bomBuffer[1] === 0xbb &&
+        true &&
         this.bomBuffer[2] === 0xbf
       ) {

[NoCoverage] EqualityOperator
src/utf8/decoder.ts:85:9
       if (
         this.bomBuffer.length >= 3 &&
         this.bomBuffer[0] === 0xef &&
-        this.bomBuffer[1] === 0xbb &&
+        this.bomBuffer[1] !== 0xbb &&
         this.bomBuffer[2] === 0xbf
       ) {

[NoCoverage] EqualityOperator
src/utf8/decoder.ts:86:9
         this.bomBuffer.length >= 3 &&
         this.bomBuffer[0] === 0xef &&
         this.bomBuffer[1] === 0xbb &&
-        this.bomBuffer[2] === 0xbf
+        this.bomBuffer[2] !== 0xbf
       ) {
         strippedBom = true;

[NoCoverage] ConditionalExpression
src/utf8/decoder.ts:86:9
         this.bomBuffer.length >= 3 &&
         this.bomBuffer[0] === 0xef &&
         this.bomBuffer[1] === 0xbb &&
-        this.bomBuffer[2] === 0xbf
+        true
       ) {
         strippedBom = true;

[NoCoverage] BlockStatement
src/utf8/decoder.ts:87:9
         this.bomBuffer[0] === 0xef &&
         this.bomBuffer[1] === 0xbb &&
         this.bomBuffer[2] === 0xbf
-      ) {
-        strippedBom = true;
-        this.totalOffset += 3;
-        // The remaining bytes in bomBuffer (if any) need to be processed
-        const remainingInBomBuffer = this.bomBuffer.slice(3);
-        const remainingInBytes = bytes.slice(i);
-        bufferToProcess = new Uint8Array(remainingInBomBuffer.length + remainingInBytes.length);
-        bufferToProcess.set(remainingInBomBuffer);
-        bufferToProcess.set(remainingInBytes, remainingInBomBuffer.length);
-      } else {
+      ) {} else {
         // Not a BOM. Process the whole bomBuffer + remaining bytes.
         const remainingInBytes = bytes.slice(i);

[NoCoverage] BooleanLiteral
src/utf8/decoder.ts:88:23
         this.bomBuffer[1] === 0xbb &&
         this.bomBuffer[2] === 0xbf
       ) {
-        strippedBom = true;
+        strippedBom = false;
         this.totalOffset += 3;
         // The remaining bytes in bomBuffer (if any) need to be processed

[NoCoverage] AssignmentOperator
src/utf8/decoder.ts:89:9
         this.bomBuffer[2] === 0xbf
       ) {
         strippedBom = true;
-        this.totalOffset += 3;
+        this.totalOffset -= 3;
         // The remaining bytes in bomBuffer (if any) need to be processed
         const remainingInBomBuffer = this.bomBuffer.slice(3);

[NoCoverage] MethodExpression
src/utf8/decoder.ts:91:38
         strippedBom = true;
         this.totalOffset += 3;
         // The remaining bytes in bomBuffer (if any) need to be processed
-        const remainingInBomBuffer = this.bomBuffer.slice(3);
+        const remainingInBomBuffer = this.bomBuffer;
         const remainingInBytes = bytes.slice(i);
         bufferToProcess = new Uint8Array(remainingInBomBuffer.length + remainingInBytes.length);

[NoCoverage] MethodExpression
src/utf8/decoder.ts:92:34
         this.totalOffset += 3;
         // The remaining bytes in bomBuffer (if any) need to be processed
         const remainingInBomBuffer = this.bomBuffer.slice(3);
-        const remainingInBytes = bytes.slice(i);
+        const remainingInBytes = bytes;
         bufferToProcess = new Uint8Array(remainingInBomBuffer.length + remainingInBytes.length);
         bufferToProcess.set(remainingInBomBuffer);

[NoCoverage] ArithmeticOperator
src/utf8/decoder.ts:93:42
         // The remaining bytes in bomBuffer (if any) need to be processed
         const remainingInBomBuffer = this.bomBuffer.slice(3);
         const remainingInBytes = bytes.slice(i);
-        bufferToProcess = new Uint8Array(remainingInBomBuffer.length + remainingInBytes.length);
+        bufferToProcess = new Uint8Array(remainingInBomBuffer.length - remainingInBytes.length);
         bufferToProcess.set(remainingInBomBuffer);
         bufferToProcess.set(remainingInBytes, remainingInBomBuffer.length);

[Killed] BlockStatement
src/utf8/decoder.ts:96:14
         bufferToProcess = new Uint8Array(remainingInBomBuffer.length + remainingInBytes.length);
         bufferToProcess.set(remainingInBomBuffer);
         bufferToProcess.set(remainingInBytes, remainingInBomBuffer.length);
-      } else {
-        // Not a BOM. Process the whole bomBuffer + remaining bytes.
-        const remainingInBytes = bytes.slice(i);
-        bufferToProcess = new Uint8Array(this.bomBuffer.length + remainingInBytes.length);
-        bufferToProcess.set(this.bomBuffer);
-        bufferToProcess.set(remainingInBytes, this.bomBuffer.length);
-      }
+      } else {}
       
       // Reset i and swap bytes to the reconstructed buffer
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 1 tests
{ seed: -1786554375, path: "0:1:1:3:2:2:2:2:0:2:1", endOnFailure: true }
Counterexample: ["!",[1]]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/utf8/decoder.ts:98:34
         bufferToProcess.set(remainingInBytes, remainingInBomBuffer.length);
       } else {
         // Not a BOM. Process the whole bomBuffer + remaining bytes.
-        const remainingInBytes = bytes.slice(i);
+        const remainingInBytes = bytes;
         bufferToProcess = new Uint8Array(this.bomBuffer.length + remainingInBytes.length);
         bufferToProcess.set(this.bomBuffer);
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 10 tests
{ seed: 843063457, path: "9:0:1:0", endOnFailure: true }
Counterexample: [[],[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/utf8/decoder.ts:99:42
       } else {
         // Not a BOM. Process the whole bomBuffer + remaining bytes.
         const remainingInBytes = bytes.slice(i);
-        bufferToProcess = new Uint8Array(this.bomBuffer.length + remainingInBytes.length);
+        bufferToProcess = new Uint8Array(this.bomBuffer.length - remainingInBytes.length);
         bufferToProcess.set(this.bomBuffer);
         bufferToProcess.set(remainingInBytes, this.bomBuffer.length);
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 1 tests
{ seed: 548142087, path: "0:1:0:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"":0},[1]]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/utf8/decoder.ts:112:9
     const startOffset = this.totalOffset;
 
     // If we have pending bytes from a previous chunk, try to complete the sequence
-    if (this.pending.length > 0) {
+    if (false) {
       while (i < bytes.length && this.pending.length < this.pendingExpected) {
         const b = bytes[i] as number;
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected '' to be 'é' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:112:9
     const startOffset = this.totalOffset;
 
     // If we have pending bytes from a previous chunk, try to complete the sequence
-    if (this.pending.length > 0) {
+    if (this.pending.length <= 0) {
       while (i < bytes.length && this.pending.length < this.pendingExpected) {
         const b = bytes[i] as number;
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:113:14
 
     // If we have pending bytes from a previous chunk, try to complete the sequence
     if (this.pending.length > 0) {
-      while (i < bytes.length && this.pending.length < this.pendingExpected) {
+      while (true && this.pending.length < this.pendingExpected) {
         const b = bytes[i] as number;
         if ((b & 0xc0) !== 0x80) {
killedBy: Utf8Decoder 3-byte characters handles 3-byte character split at every byte boundary
statusReason: expected '' to be '日' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:113:34
 
     // If we have pending bytes from a previous chunk, try to complete the sequence
     if (this.pending.length > 0) {
-      while (i < bytes.length && this.pending.length < this.pendingExpected) {
+      while (i < bytes.length && this.pending.length >= this.pendingExpected) {
         const b = bytes[i] as number;
         if ((b & 0xc0) !== 0x80) {
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected '' to be 'é' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:115:13
     if (this.pending.length > 0) {
       while (i < bytes.length && this.pending.length < this.pendingExpected) {
         const b = bytes[i] as number;
-        if ((b & 0xc0) !== 0x80) {
+        if (false) {
           // Not a valid continuation byte — the pending sequence is broken
           errors.push({
killedBy: Utf8Decoder invalid sequences detects invalid continuation across chunk boundary
statusReason: expected '' to be 'A' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:115:13
     if (this.pending.length > 0) {
       while (i < bytes.length && this.pending.length < this.pendingExpected) {
         const b = bytes[i] as number;
-        if ((b & 0xc0) !== 0x80) {
+        if ((b & 0xc0) === 0x80) {
           // Not a valid continuation byte — the pending sequence is broken
           errors.push({
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected '' to be 'é' // Object.is equality

[Killed] StringLiteral
src/utf8/decoder.ts:118:19
         if ((b & 0xc0) !== 0x80) {
           // Not a valid continuation byte — the pending sequence is broken
           errors.push({
-            kind: "invalid_continuation",
+            kind: "",
             byteOffset: startOffset - this.pending.length,
           });
killedBy: Utf8Decoder invalid sequences detects invalid continuation across chunk boundary
statusReason: expected '' to be 'invalid_continuation' // Object.is equality

[Survived] ArithmeticOperator
src/utf8/decoder.ts:119:25
           // Not a valid continuation byte — the pending sequence is broken
           errors.push({
             kind: "invalid_continuation",
-            byteOffset: startOffset - this.pending.length,
+            byteOffset: startOffset + this.pending.length,
           });
           this.pending = [];

[Survived] ArrayDeclaration
src/utf8/decoder.ts:121:26
             kind: "invalid_continuation",
             byteOffset: startOffset - this.pending.length,
           });
-          this.pending = [];
+          this.pending = ["Stryker was here"];
           this.pendingExpected = 0;
           // Don't consume this byte — it might be a valid start byte

[Killed] UpdateOperator
src/utf8/decoder.ts:127:9
           break;
         }
         this.pending.push(b);
-        i++;
+        i--;
         this.totalOffset++;
       }
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected [ { …(2) }, { …(2) } ] to have a length of +0 but got 2

[Survived] UpdateOperator
src/utf8/decoder.ts:128:9
         }
         this.pending.push(b);
         i++;
-        this.totalOffset++;
+        this.totalOffset--;
       }
 

[Killed] ConditionalExpression
src/utf8/decoder.ts:131:11
         this.totalOffset++;
       }
 
-      if (this.pending.length === this.pendingExpected) {
+      if (true) {
         // We have a complete sequence — decode it
         const result = this.decodeSequence(
killedBy: Utf8Decoder 3-byte characters handles 3-byte character split at every byte boundary
statusReason: expected 'Ɨ' to be '' // Object.is equality

[Killed] BlockStatement
src/utf8/decoder.ts:131:57
         this.totalOffset++;
       }
 
-      if (this.pending.length === this.pendingExpected) {
-        // We have a complete sequence — decode it
-        const result = this.decodeSequence(
-          this.pending,
-          startOffset - (this.pending.length - (i - 0)),
-        );
-        if (result.error) {
-          errors.push(result.error);
-        } else {
-          codePoints.push(result.codePoint);
-        }
-        this.pending = [];
-        this.pendingExpected = 0;
-      } else if (i >= bytes.length) {
+      if (this.pending.length === this.pendingExpected) {} else if (i >= bytes.length) {
         // Still incomplete — wait for more data
         const consumed = this.totalOffset - startOffset;
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected '' to be 'é' // Object.is equality

[Survived] ArithmeticOperator
src/utf8/decoder.ts:135:26
         // We have a complete sequence — decode it
         const result = this.decodeSequence(
           this.pending,
-          startOffset - (this.pending.length - (i - 0)),
+          startOffset - (this.pending.length + (i - 0)),
         );
         if (result.error) {

[Survived] ArithmeticOperator
src/utf8/decoder.ts:135:11
         // We have a complete sequence — decode it
         const result = this.decodeSequence(
           this.pending,
-          startOffset - (this.pending.length - (i - 0)),
+          startOffset + (this.pending.length - (i - 0)),
         );
         if (result.error) {

[Killed] ConditionalExpression
src/utf8/decoder.ts:137:13
           this.pending,
           startOffset - (this.pending.length - (i - 0)),
         );
-        if (result.error) {
+        if (false) {
           errors.push(result.error);
         } else {
killedBy: Utf8Decoder invalid sequences detects invalid continuation across chunk boundary
statusReason: expected '\u0000A' to be 'A' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:137:13
           this.pending,
           startOffset - (this.pending.length - (i - 0)),
         );
-        if (result.error) {
+        if (true) {
           errors.push(result.error);
         } else {
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected '' to be 'é' // Object.is equality

[Killed] BlockStatement
src/utf8/decoder.ts:139:16
         );
         if (result.error) {
           errors.push(result.error);
-        } else {
-          codePoints.push(result.codePoint);
-        }
+        } else {}
         this.pending = [];
         this.pendingExpected = 0;
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected '' to be 'é' // Object.is equality

[Killed] ArrayDeclaration
src/utf8/decoder.ts:142:24
         } else {
           codePoints.push(result.codePoint);
         }
-        this.pending = [];
+        this.pending = ["Stryker was here"];
         this.pendingExpected = 0;
       } else if (i >= bytes.length) {
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/utf8/decoder.ts:144:18
         }
         this.pending = [];
         this.pendingExpected = 0;
-      } else if (i >= bytes.length) {
+      } else if (true) {
         // Still incomplete — wait for more data
         const consumed = this.totalOffset - startOffset;

[Survived] EqualityOperator
src/utf8/decoder.ts:144:18
         }
         this.pending = [];
         this.pendingExpected = 0;
-      } else if (i >= bytes.length) {
+      } else if (i > bytes.length) {
         // Still incomplete — wait for more data
         const consumed = this.totalOffset - startOffset;

[Survived] ArithmeticOperator
src/utf8/decoder.ts:146:26
         this.pendingExpected = 0;
       } else if (i >= bytes.length) {
         // Still incomplete — wait for more data
-        const consumed = this.totalOffset - startOffset;
+        const consumed = this.totalOffset + startOffset;
         return { text: "", consumed, errors, strippedBom };
       }

[Killed] ObjectLiteral
src/utf8/decoder.ts:147:16
       } else if (i >= bytes.length) {
         // Still incomplete — wait for more data
         const consumed = this.totalOffset - startOffset;
-        return { text: "", consumed, errors, strippedBom };
+        return {};
       }
     }
killedBy: Utf8Decoder 3-byte characters handles 3-byte character split at every byte boundary
statusReason: expected undefined to be '' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:152:12
     }
 
     // Process remaining bytes
-    while (i < bytes.length) {
+    while (i >= bytes.length) {
       const b = bytes[i] as number;
       const seqOffset = this.totalOffset;
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:152:12
     }
 
     // Process remaining bytes
-    while (i < bytes.length) {
+    while (false) {
       const b = bytes[i] as number;
       const seqOffset = this.totalOffset;
killedBy: Parser push() accepts a string chunk
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/utf8/decoder.ts:156:11
       const b = bytes[i] as number;
       const seqOffset = this.totalOffset;
 
-      if (b <= 0x7f) {
+      if (true) {
         // Single-byte ASCII
         codePoints.push(b);
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'JosÃ©' to be 'José' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:156:11
       const b = bytes[i] as number;
       const seqOffset = this.totalOffset;
 
-      if (b <= 0x7f) {
+      if (false) {
         // Single-byte ASCII
         codePoints.push(b);
killedBy: Utf8Decoder ASCII decodes pure ASCII
statusReason: expected '' to be 'hello' // Object.is equality

[Timeout] UpdateOperator
src/utf8/decoder.ts:159:9
       if (b <= 0x7f) {
         // Single-byte ASCII
         codePoints.push(b);
-        i++;
+        i--;
         this.totalOffset++;
       } else if ((b & 0xe0) === 0xc0) {

[Killed] EqualityOperator
src/utf8/decoder.ts:161:18
         codePoints.push(b);
         i++;
         this.totalOffset++;
-      } else if ((b & 0xe0) === 0xc0) {
+      } else if ((b & 0xe0) !== 0xc0) {
         // 2-byte sequence
         const needed = 2;
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected undefined to deeply equal { path: '/src/app.ts' }

[Killed] ConditionalExpression
src/utf8/decoder.ts:161:18
         codePoints.push(b);
         i++;
         this.totalOffset++;
-      } else if ((b & 0xe0) === 0xc0) {
+      } else if (false) {
         // 2-byte sequence
         const needed = 2;
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos' to be 'José' // Object.is equality
