[Killed] ArithmeticOperator
src/utf8/decoder.ts:164:13
       } else if ((b & 0xe0) === 0xc0) {
         // 2-byte sequence
         const needed = 2;
-        if (i + needed <= bytes.length) {
+        if (i - needed <= bytes.length) {
           const seq = [b, bytes[i + 1] as number];
           const result = this.decodeSequence(seq, seqOffset);
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:164:13
       } else if ((b & 0xe0) === 0xc0) {
         // 2-byte sequence
         const needed = 2;
-        if (i + needed <= bytes.length) {
+        if (true) {
           const seq = [b, bytes[i + 1] as number];
           const result = this.decodeSequence(seq, seqOffset);
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:167:15
         if (i + needed <= bytes.length) {
           const seq = [b, bytes[i + 1] as number];
           const result = this.decodeSequence(seq, seqOffset);
-          if (result.error) {
+          if (true) {
             errors.push(result.error);
             i++;
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos' to be 'José' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:167:15
         if (i + needed <= bytes.length) {
           const seq = [b, bytes[i + 1] as number];
           const result = this.decodeSequence(seq, seqOffset);
-          if (result.error) {
+          if (false) {
             errors.push(result.error);
             i++;
killedBy: Utf8Decoder invalid sequences detects invalid continuation byte
statusReason: expected 0 to be greater than or equal to 1

[Timeout] UpdateOperator
src/utf8/decoder.ts:169:13
           const result = this.decodeSequence(seq, seqOffset);
           if (result.error) {
             errors.push(result.error);
-            i++;
+            i--;
             this.totalOffset++;
           } else {

[Timeout] BlockStatement
src/utf8/decoder.ts:171:18
             errors.push(result.error);
             i++;
             this.totalOffset++;
-          } else {
-            codePoints.push(result.codePoint);
-            i += needed;
-            this.totalOffset += needed;
-          }
+          } else {}
         } else {
           // Incomplete at end of chunk — buffer it

[Timeout] AssignmentOperator
src/utf8/decoder.ts:173:13
             this.totalOffset++;
           } else {
             codePoints.push(result.codePoint);
-            i += needed;
+            i -= needed;
             this.totalOffset += needed;
           }

[Survived] AssignmentOperator
src/utf8/decoder.ts:174:13
           } else {
             codePoints.push(result.codePoint);
             i += needed;
-            this.totalOffset += needed;
+            this.totalOffset -= needed;
           }
         } else {

[Timeout] BlockStatement
src/utf8/decoder.ts:176:16
             i += needed;
             this.totalOffset += needed;
           }
-        } else {
-          // Incomplete at end of chunk — buffer it
-          this.pendingExpected = needed;
-          this.pending = [];
-          for (let j = i; j < bytes.length; j++) {
-            this.pending.push(bytes[j] as number);
-          }
-          this.totalOffset += bytes.length - i;
-          i = bytes.length;
-        }
+        } else {}
       } else if ((b & 0xf0) === 0xe0) {
         // 3-byte sequence

[Killed] BlockStatement
src/utf8/decoder.ts:180:50
           // Incomplete at end of chunk — buffer it
           this.pendingExpected = needed;
           this.pending = [];
-          for (let j = i; j < bytes.length; j++) {
-            this.pending.push(bytes[j] as number);
-          }
+          for (let j = i; j < bytes.length; j++) {}
           this.totalOffset += bytes.length - i;
           i = bytes.length;
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:180:27
           // Incomplete at end of chunk — buffer it
           this.pendingExpected = needed;
           this.pending = [];
-          for (let j = i; j < bytes.length; j++) {
+          for (let j = i; j <= bytes.length; j++) {
             this.pending.push(bytes[j] as number);
           }
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected '' to be 'é' // Object.is equality

[Survived] ArithmeticOperator
src/utf8/decoder.ts:183:31
           for (let j = i; j < bytes.length; j++) {
             this.pending.push(bytes[j] as number);
           }
-          this.totalOffset += bytes.length - i;
+          this.totalOffset += bytes.length + i;
           i = bytes.length;
         }

[Survived] AssignmentOperator
src/utf8/decoder.ts:183:11
           for (let j = i; j < bytes.length; j++) {
             this.pending.push(bytes[j] as number);
           }
-          this.totalOffset += bytes.length - i;
+          this.totalOffset -= bytes.length - i;
           i = bytes.length;
         }

[Killed] ConditionalExpression
src/utf8/decoder.ts:186:18
           this.totalOffset += bytes.length - i;
           i = bytes.length;
         }
-      } else if ((b & 0xf0) === 0xe0) {
+      } else if (false) {
         // 3-byte sequence
         const needed = 3;
killedBy: Utf8Decoder 3-byte characters decodes 3-byte CJK character (日 = U+65E5)
statusReason: expected '' to be '日本語' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:186:18
           this.totalOffset += bytes.length - i;
           i = bytes.length;
         }
-      } else if ((b & 0xf0) === 0xe0) {
+      } else if ((b & 0xf0) !== 0xe0) {
         // 3-byte sequence
         const needed = 3;
killedBy: Mutation Killer — Byte Range Accuracy accurately handles 2-byte, 3-byte, and 4-byte UTF-8 string pushes for getUtf8ByteLength
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:189:13
       } else if ((b & 0xf0) === 0xe0) {
         // 3-byte sequence
         const needed = 3;
-        if (i + needed <= bytes.length) {
+        if (i + needed < bytes.length) {
           const seq = [b, bytes[i + 1] as number, bytes[i + 2] as number];
           const result = this.decodeSequence(seq, seqOffset);
killedBy: Utf8Decoder 3-byte characters decodes 3-byte CJK character (日 = U+65E5)
statusReason: expected '日本' to be '日本語' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:189:13
       } else if ((b & 0xf0) === 0xe0) {
         // 3-byte sequence
         const needed = 3;
-        if (i + needed <= bytes.length) {
+        if (false) {
           const seq = [b, bytes[i + 1] as number, bytes[i + 2] as number];
           const result = this.decodeSequence(seq, seqOffset);
killedBy: Utf8Decoder 3-byte characters decodes 3-byte CJK character (日 = U+65E5)
statusReason: expected '' to be '日本語' // Object.is equality

[Timeout] BlockStatement
src/utf8/decoder.ts:201:16
             i += needed;
             this.totalOffset += needed;
           }
-        } else {
-          this.pendingExpected = needed;
-          this.pending = [];
-          for (let j = i; j < bytes.length; j++) {
-            this.pending.push(bytes[j] as number);
-          }
-          this.totalOffset += bytes.length - i;
-          i = bytes.length;
-        }
+        } else {}
       } else if ((b & 0xf8) === 0xf0) {
         // 4-byte sequence

[Killed] ArrayDeclaration
src/utf8/decoder.ts:203:26
           }
         } else {
           this.pendingExpected = needed;
-          this.pending = [];
+          this.pending = ["Stryker was here"];
           for (let j = i; j < bytes.length; j++) {
             this.pending.push(bytes[j] as number);
killedBy: Utf8Decoder 3-byte characters handles 3-byte character split at every byte boundary
statusReason: expected '' to be '日' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:210:18
           this.totalOffset += bytes.length - i;
           i = bytes.length;
         }
-      } else if ((b & 0xf8) === 0xf0) {
+      } else if (true) {
         // 4-byte sequence
         const needed = 4;
killedBy: Utf8Decoder invalid sequences detects invalid start byte (0xFF)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/utf8/decoder.ts:210:18
           this.totalOffset += bytes.length - i;
           i = bytes.length;
         }
-      } else if ((b & 0xf8) === 0xf0) {
+      } else if (false) {
         // 4-byte sequence
         const needed = 4;
killedBy: Utf8Decoder 4-byte characters (emoji) decodes 4-byte emoji (😀 = U+1F600)
statusReason: expected '' to be '😀' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:213:13
       } else if ((b & 0xf8) === 0xf0) {
         // 4-byte sequence
         const needed = 4;
-        if (i + needed <= bytes.length) {
+        if (i + needed > bytes.length) {
           const seq = [b, bytes[i + 1] as number, bytes[i + 2] as number, bytes[i + 3] as number];
           const result = this.decodeSequence(seq, seqOffset);
killedBy: Mutation Killer — Byte Range Accuracy accurately handles 2-byte, 3-byte, and 4-byte UTF-8 string pushes for getUtf8ByteLength
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:213:13
       } else if ((b & 0xf8) === 0xf0) {
         // 4-byte sequence
         const needed = 4;
-        if (i + needed <= bytes.length) {
+        if (i + needed < bytes.length) {
           const seq = [b, bytes[i + 1] as number, bytes[i + 2] as number, bytes[i + 3] as number];
           const result = this.decodeSequence(seq, seqOffset);
killedBy: Utf8Decoder 4-byte characters (emoji) decodes 4-byte emoji (😀 = U+1F600)
statusReason: expected '' to be '😀' // Object.is equality

[NoCoverage] BlockStatement
src/utf8/decoder.ts:216:29
         if (i + needed <= bytes.length) {
           const seq = [b, bytes[i + 1] as number, bytes[i + 2] as number, bytes[i + 3] as number];
           const result = this.decodeSequence(seq, seqOffset);
-          if (result.error) {
-            errors.push(result.error);
-            i++;
-            this.totalOffset++;
-          } else {
+          if (result.error) {} else {
             codePoints.push(result.codePoint);
             i += needed;

[Killed] EqualityOperator
src/utf8/decoder.ts:228:27
         } else {
           this.pendingExpected = needed;
           this.pending = [];
-          for (let j = i; j < bytes.length; j++) {
+          for (let j = i; j >= bytes.length; j++) {
             this.pending.push(bytes[j] as number);
           }
killedBy: Utf8Decoder 4-byte characters (emoji) handles 4-byte emoji split across chunks
statusReason: expected false to be true // Object.is equality

[Timeout] BlockStatement
src/utf8/decoder.ts:234:14
           this.totalOffset += bytes.length - i;
           i = bytes.length;
         }
-      } else {
-        // Invalid start byte (0x80-0xBF or 0xF8+)
-        errors.push({
-          kind: "invalid_start_byte",
-          byteOffset: seqOffset,
-        });
-        i++;
-        this.totalOffset++;
-      }
+      } else {}
     }
 

[Timeout] UpdateOperator
src/utf8/decoder.ts:240:9
           kind: "invalid_start_byte",
           byteOffset: seqOffset,
         });
-        i++;
+        i--;
         this.totalOffset++;
       }

[Survived] ArithmeticOperator
src/utf8/decoder.ts:246:22
     }
 
     const text = String.fromCodePoint(...codePoints);
-    const consumed = this.totalOffset - startOffset;
+    const consumed = this.totalOffset + startOffset;
     return { text, consumed, errors, strippedBom };
   }

[Killed] BlockStatement
src/utf8/decoder.ts:253:28
   /**
    * Check if there are buffered incomplete bytes.
    */
-  hasIncomplete(): boolean {
-    return this.pending.length > 0;
-  }
+  hasIncomplete(): boolean {}
 
   /**
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:254:12
    * Check if there are buffered incomplete bytes.
    */
   hasIncomplete(): boolean {
-    return this.pending.length > 0;
+    return this.pending.length >= 0;
   }
 
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:254:12
    * Check if there are buffered incomplete bytes.
    */
   hasIncomplete(): boolean {
-    return this.pending.length > 0;
+    return this.pending.length <= 0;
   }
 
killedBy: Utf8Decoder 2-byte characters handles 2-byte character split across chunks
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/utf8/decoder.ts:260:34
   /**
    * Get the byte offset where the incomplete sequence started.
    */
-  incompleteByteOffset(): number {
-    return this.totalOffset - this.pending.length;
-  }
+  incompleteByteOffset(): number {}
 
   /**

[NoCoverage] ArithmeticOperator
src/utf8/decoder.ts:261:12
    * Get the byte offset where the incomplete sequence started.
    */
   incompleteByteOffset(): number {
-    return this.totalOffset - this.pending.length;
+    return this.totalOffset + this.pending.length;
   }
 

[NoCoverage] BlockStatement
src/utf8/decoder.ts:267:17
   /**
    * Reset decoder state.
    */
-  reset(): void {
-    this.pending = [];
-    this.pendingExpected = 0;
-    this.totalOffset = 0;
-  }
+  reset(): void {}
 
   /**

[NoCoverage] BlockStatement
src/utf8/decoder.ts:276:37
   /**
    * Total bytes processed (including any pending).
    */
-  get totalBytesProcessed(): number {
-    return this.totalOffset;
-  }
+  get totalBytesProcessed(): number {}
 
   /**

[Killed] BlockStatement
src/utf8/decoder.ts:291:35
     const len = seq.length;
 
     // Validate continuation bytes
-    for (let i = 1; i < len; i++) {
-      if (((seq[i] as number) & 0xc0) !== 0x80) {
-        return {
-          codePoint: 0,
-          error: { kind: "invalid_continuation", byteOffset: offset },
-        };
-      }
-    }
+    for (let i = 1; i < len; i++) {}
 
     let codePoint: number;
killedBy: Utf8Decoder invalid sequences detects invalid continuation byte
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/utf8/decoder.ts:291:21
     const len = seq.length;
 
     // Validate continuation bytes
-    for (let i = 1; i < len; i++) {
+    for (let i = 1; i <= len; i++) {
       if (((seq[i] as number) & 0xc0) !== 0x80) {
         return {
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos' to be 'José' // Object.is equality

[Killed] BlockStatement
src/utf8/decoder.ts:292:49
 
     // Validate continuation bytes
     for (let i = 1; i < len; i++) {
-      if (((seq[i] as number) & 0xc0) !== 0x80) {
-        return {
-          codePoint: 0,
-          error: { kind: "invalid_continuation", byteOffset: offset },
-        };
-      }
+      if (((seq[i] as number) & 0xc0) !== 0x80) {}
     }
 
killedBy: Utf8Decoder invalid sequences detects invalid continuation byte
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/utf8/decoder.ts:292:11
 
     // Validate continuation bytes
     for (let i = 1; i < len; i++) {
-      if (((seq[i] as number) & 0xc0) !== 0x80) {
+      if (((seq[i] as number) & 0xc0) === 0x80) {
         return {
           codePoint: 0,
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos' to be 'José' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:303:9
     let codePoint: number;
     let minCodePoint: number;
 
-    if (len === 2) {
+    if (false) {
       codePoint = (((seq[0] as number) & 0x1f) << 6) | ((seq[1] as number) & 0x3f);
       minCodePoint = 0x80;
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos󩀀' to be 'José' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:303:9
     let codePoint: number;
     let minCodePoint: number;
 
-    if (len === 2) {
+    if (true) {
       codePoint = (((seq[0] as number) & 0x1f) << 6) | ((seq[1] as number) & 0x3f);
       minCodePoint = 0x80;
killedBy: Utf8Decoder 3-byte characters decodes 3-byte CJK character (日 = U+65E5)
statusReason: expected 'ƗƜȪ' to be '日本語' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:306:16
     if (len === 2) {
       codePoint = (((seq[0] as number) & 0x1f) << 6) | ((seq[1] as number) & 0x3f);
       minCodePoint = 0x80;
-    } else if (len === 3) {
+    } else if (len !== 3) {
       codePoint =
         (((seq[0] as number) & 0x0f) << 12) |
killedBy: Utf8Decoder 3-byte characters decodes 3-byte CJK character (日 = U+65E5)
statusReason: expected '𪞀' to be '日本語' // Object.is equality

[Killed] BlockStatement
src/utf8/decoder.ts:306:27
     if (len === 2) {
       codePoint = (((seq[0] as number) & 0x1f) << 6) | ((seq[1] as number) & 0x3f);
       minCodePoint = 0x80;
-    } else if (len === 3) {
-      codePoint =
-        (((seq[0] as number) & 0x0f) << 12) |
-        (((seq[1] as number) & 0x3f) << 6) |
-        ((seq[2] as number) & 0x3f);
-      minCodePoint = 0x800;
-    } else {
+    } else if (len === 3) {} else {
       // len === 4
       codePoint =
killedBy: Utf8Decoder 3-byte characters decodes 3-byte CJK character (日 = U+65E5)
statusReason: Invalid code point NaN

[Killed] BlockStatement
src/utf8/decoder.ts:312:12
         (((seq[1] as number) & 0x3f) << 6) |
         ((seq[2] as number) & 0x3f);
       minCodePoint = 0x800;
-    } else {
-      // len === 4
-      codePoint =
-        (((seq[0] as number) & 0x07) << 18) |
-        (((seq[1] as number) & 0x3f) << 12) |
-        (((seq[2] as number) & 0x3f) << 6) |
-        ((seq[3] as number) & 0x3f);
-      minCodePoint = 0x10000;
-    }
+    } else {}
 
     // Check overlong encoding
killedBy: Utf8Decoder 4-byte characters (emoji) decodes 4-byte emoji (😀 = U+1F600)
statusReason: Invalid code point NaN

[Killed] ConditionalExpression
src/utf8/decoder.ts:323:9
     }
 
     // Check overlong encoding
-    if (codePoint < minCodePoint) {
+    if (true) {
       return {
         codePoint: 0,
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos' to be 'José' // Object.is equality

[Killed] BlockStatement
src/utf8/decoder.ts:323:35
     }
 
     // Check overlong encoding
-    if (codePoint < minCodePoint) {
-      return {
-        codePoint: 0,
-        error: { kind: "overlong", byteOffset: offset },
-      };
-    }
+    if (codePoint < minCodePoint) {}
 
     // Check valid Unicode range
killedBy: Utf8Decoder invalid sequences detects overlong encoding
statusReason: expected 0 to be greater than or equal to 1

[Killed] ObjectLiteral
src/utf8/decoder.ts:326:16
     if (codePoint < minCodePoint) {
       return {
         codePoint: 0,
-        error: { kind: "overlong", byteOffset: offset },
+        error: {},
       };
     }
killedBy: Utf8Decoder invalid sequences detects overlong encoding
statusReason: expected undefined to be 'overlong' // Object.is equality

[Killed] StringLiteral
src/utf8/decoder.ts:326:24
     if (codePoint < minCodePoint) {
       return {
         codePoint: 0,
-        error: { kind: "overlong", byteOffset: offset },
+        error: { kind: "", byteOffset: offset },
       };
     }
killedBy: Utf8Decoder invalid sequences detects overlong encoding
statusReason: expected '' to be 'overlong' // Object.is equality

[Killed] EqualityOperator
src/utf8/decoder.ts:331:9
     }
 
     // Check valid Unicode range
-    if (codePoint > 0x10ffff) {
+    if (codePoint <= 0x10ffff) {
       return {
         codePoint: 0,
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos' to be 'José' // Object.is equality

[Killed] ConditionalExpression
src/utf8/decoder.ts:331:9
     }
 
     // Check valid Unicode range
-    if (codePoint > 0x10ffff) {
+    if (true) {
       return {
         codePoint: 0,
killedBy: Utf8Decoder 2-byte characters decodes 2-byte character (é = U+00E9)
statusReason: expected 'Jos' to be 'José' // Object.is equality

[NoCoverage] StringLiteral
src/utf8/decoder.ts:334:24
     if (codePoint > 0x10ffff) {
       return {
         codePoint: 0,
-        error: { kind: "out_of_range", byteOffset: offset },
+        error: { kind: "", byteOffset: offset },
       };
     }

[Killed] BlockStatement
src/utf8/decoder.ts:346:55
  * Convert a string to its UTF-8 byte representation.
  * Utility for tests and string-mode push().
  */
-export function stringToUtf8(str: string): Uint8Array {
-  const encoder = new TextEncoder();
-  return encoder.encode(str);
-}
+export function stringToUtf8(str: string): Uint8Array {}
 
killedBy: Utf8Decoder ASCII decodes pure ASCII
statusReason: Cannot read properties of undefined (reading 'length')
