[Killed] BlockStatement
src/diagnostics/factory.ts:15:15
   message: string,
   recoverable: boolean,
   path?: string,
-): Diagnostic {
-  const diag: Diagnostic = {
-    code,
-    severity,
-    byteOffset,
-    message,
-    recoverable,
-  };
-  if (path !== undefined) {
-    diag.path = path;
-  }
-  return diag;
-}
+): Diagnostic {}
 
killedBy: Parser finish() returns truncated for incomplete JSON with length reason
statusReason: Cannot read properties of undefined (reading 'severity')

[Killed] ObjectLiteral
src/diagnostics/factory.ts:16:28
   recoverable: boolean,
   path?: string,
 ): Diagnostic {
-  const diag: Diagnostic = {
-    code,
-    severity,
-    byteOffset,
-    message,
-    recoverable,
-  };
+  const diag: Diagnostic = {};
   if (path !== undefined) {
     diag.path = path;
killedBy: Parser duplicate key detection detects duplicate keys
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/diagnostics/factory.ts:23:27
     message,
     recoverable,
   };
-  if (path !== undefined) {
-    diag.path = path;
-  }
+  if (path !== undefined) {}
   return diag;
 }

[Survived] ConditionalExpression
src/diagnostics/factory.ts:23:7
     message,
     recoverable,
   };
-  if (path !== undefined) {
+  if (false) {
     diag.path = path;
   }
