[Killed] BlockStatement
src/grammar/frame.ts:60:17
 export function createObjectFrame(
   path: string,
   byteStart: number,
-): GrammarFrame {
-  return {
-    containerType: "object",
-    path,
-    objectExpectation: "first_key_or_end",
-    seenKeys: new Set(),
-    nextArrayIndex: 0,
-    byteStart,
-  };
-}
+): GrammarFrame {}
 
 /**
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] StringLiteral
src/grammar/frame.ts:62:20
   byteStart: number,
 ): GrammarFrame {
   return {
-    containerType: "object",
+    containerType: "",
     path,
     objectExpectation: "first_key_or_end",
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] BlockStatement
src/grammar/frame.ts:77:17
 export function createArrayFrame(
   path: string,
   byteStart: number,
-): GrammarFrame {
-  return {
-    containerType: "array",
-    path,
-    arrayExpectation: "first_value_or_end",
-    nextArrayIndex: 0,
-    byteStart,
-  };
-}
+): GrammarFrame {}
 
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] StringLiteral
src/grammar/frame.ts:79:20
   byteStart: number,
 ): GrammarFrame {
   return {
-    containerType: "array",
+    containerType: "",
     path,
     arrayExpectation: "first_value_or_end",
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: expected [] to deeply equal [ 1, 2, 3 ]
