[Killed] BlockStatement
src/grammar/pointer.ts:9:59
  * Escape a JSON Pointer reference token per RFC 6901.
  * ~ → ~0, / → ~1
  */
-export function escapePointerToken(token: string): string {
-  return token.replace(/~/g, "~0").replace(/\//g, "~1");
-}
+export function escapePointerToken(token: string): string {}
 
 /**
killedBy: Parser snapshot() includes only committed fields in stableValue
statusReason: expected { undefined: '/src/app.ts' } to deeply equal { path: '/src/app.ts' }

[Survived] StringLiteral
src/grammar/pointer.ts:10:30
  * ~ → ~0, / → ~1
  */
 export function escapePointerToken(token: string): string {
-  return token.replace(/~/g, "~0").replace(/\//g, "~1");
+  return token.replace(/~/g, "").replace(/\//g, "~1");
 }
 

[Killed] BlockStatement
src/grammar/pointer.ts:16:79
 /**
  * Build a JSON Pointer path from parent path and a key or index.
  */
-export function appendPointer(parent: string, token: string | number): string {
-  if (typeof token === "number") {
-    return `${parent}/${token}`;
-  }
-  return `${parent}/${escapePointerToken(token)}`;
-}
+export function appendPointer(parent: string, token: string | number): string {}
 
killedBy: DefaultToolCallStreamCoordinator — uncovered branches handles stream end with open (not closed) call
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] EqualityOperator
src/grammar/pointer.ts:17:7
  * Build a JSON Pointer path from parent path and a key or index.
  */
 export function appendPointer(parent: string, token: string | number): string {
-  if (typeof token === "number") {
+  if (typeof token !== "number") {
     return `${parent}/${token}`;
   }
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: token.replace is not a function

[Killed] ConditionalExpression
src/grammar/pointer.ts:17:7
  * Build a JSON Pointer path from parent path and a key or index.
  */
 export function appendPointer(parent: string, token: string | number): string {
-  if (typeof token === "number") {
+  if (false) {
     return `${parent}/${token}`;
   }
killedBy: Parser valid JSON equivalence matches JSON.parse for: [1,2,3]
statusReason: token.replace is not a function
