[Killed] ConditionalExpression
src/lexer/scanner.ts:539:20
         if (isDigit(ch)) {
           this.numberBuffer += ch;
           this.numberHasDigit = true;
-        } else if (ch === "." && this.numberHasDigit) {
+        } else if (true && this.numberHasDigit) {
           this.numberBuffer += ch;
           this.state = ScannerState.NumberFraction;
killedBy: Valid JSON Equivalence matches JSON.parse: {"a":1}
statusReason: expected { a: NaN } to deeply equal { a: 1 }

[Killed] ConditionalExpression
src/lexer/scanner.ts:758:7
 
   private isValueTerminator(ch: string): boolean {
     return (
-      isWhitespace(ch) ||
-      ch === "," ||
-      ch === "}" ||
+      false ||
       ch === "]" ||
       ch === ":"
killedBy: Fuzz Corpus fuzz: fuzz-trunc-021 - Fuzz Truncation len=77
statusReason: expected [ 'truncated', 'salvaged' ] to include 'invalid'
