[Killed] LogicalOperator
src/parser.ts:253:9
       // Set up scanner for object key context
       const frame = this.grammar.current;
       if (
-        frame &&
-        frame.containerType === "object" &&
-        (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
+        frame && frame.containerType === "object" || frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma" &&
         this.scanner.currentState === ScannerState.Structural
       ) {
killedBy: Property-Based Testing (fast-check) Chunk invariance: Output is identical regardless of how chunks are split
statusReason: Property failed after 1 tests
{ seed: 536566355, path: "0:0:0:0", endOnFailure: true }
Counterexample: [[],[1]]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/parser.ts:255:60
       if (
         frame &&
         frame.containerType === "object" &&
-        (frame.objectExpectation === "first_key_or_end" || frame.objectExpectation === "key_after_comma") &&
+        (frame.objectExpectation === "first_key_or_end" || false) &&
         this.scanner.currentState === ScannerState.Structural
       ) {

[Killed] ConditionalExpression
src/parser.ts:355:9
     reason?: StreamEndReason;
     providerReason?: string;
   }): FinalResult {
-    if (this.phase === "finished") {
+    if (false) {
       throw new Error(
         "E_PUSH_AFTER_FINISH: finish() called more than once",
killedBy: Parser finish() throws if called twice
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/parser.ts:373:13
       const pendingInfo = this.scanner.getPendingInfo();
 
       if (pendingInfo.type === "number") {
-        if (reason === "complete") {
+        if (reason !== "complete") {
           // Stream ended normally — the number terminator is implicit EOF
           const finalized = this.scanner.finalizeNumber();
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:948:9
 
     if (frame.containerType === "object") {
       if (
-        frame.objectExpectation === "first_key_or_end" ||
+        false ||
         frame.objectExpectation === "key_after_comma"
       ) {
killedBy: Parser push() accepts a string chunk
statusReason: expected 'invalid' to be 'root_complete' // Object.is equality

[Killed] ConditionalExpression
src/parser.ts:1140:7
 
     const reason = this.finishMeta?.reason ?? "unknown";
     if (
-      reason === "length" ||
-      reason === "network_error" ||
-      reason === "provider_error" ||
-      reason === "cancelled" ||
+      false ||
       reason === "unknown"
     ) {
killedBy: Parser finish() returns non-executable for abnormal end reason
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/parser.ts:1185:24
     if (this.grammar.hasDuplicate) return "invalid";
     
     // Check if salvaged
-    const hasSalvage = this.allRepairs.some((r) => r.code === "R_CLOSE_CONTAINER");
+    const hasSalvage = this.allRepairs.every(r => r.code === "R_CLOSE_CONTAINER");
     if (hasSalvage) return "salvaged";
 
killedBy: Fuzz Corpus fuzz: fuzz-depth-011 - Fuzz Depth 70
statusReason: expected 'salvaged' to be 'valid' // Object.is equality

[Timeout] EqualityOperator
src/parser.ts:1227:7
  */
 function getUtf8ByteLength(ch: string): number {
   const code = ch.codePointAt(0) ?? 0;
-  if (code <= 0x7f) return 1;
+  if (code < 0x7f) return 1;
   if (code <= 0x7ff) return 2;
   if (code <= 0xffff) return 3;
