[Killed] ConditionalExpression
src/utf8/decoder.ts:70:9
       }
 
       const isBomPrefix =
-        (this.bomBuffer[0] === 0xef) &&
-        (this.bomBuffer.length < 2 || this.bomBuffer[1] === 0xbb) &&
+        true &&
         (this.bomBuffer.length < 3 || this.bomBuffer[2] === 0xbf);
 
killedBy: Parser finish() finalizes number at complete stream end
statusReason: expected 'empty' to be 'root_complete' // Object.is equality
